{
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Attacks on ML\\AI\\ATTEQ-NN：Attention-based QoE-aware Evasive Backdoor Attacks.pdf": {
        "title": "ATTEQ-NN：Attention-based QoE-aware Evasive Backdoor Attacks",
        "abstract": "深度神经网络在各种关键任务中取得了显著的成功。然而，最近的研究表明深度神经网络容易受到后门攻击的威胁，攻击者会发布带有后门的模型，这些模型在正常样本上表现正常，但在带有触发器的样本上会错误分类为目标标签。与对抗样本不同，后门攻击同时操作输入和模型，通过触发器扰乱样本并将后门注入模型。在本文中，我们提出了一种新颖的基于注意力的回避后门攻击，称为ATTEQ-NN。与现有的方法随意设置触发器掩码不同，我们精心设计了一个基于注意力的触发器掩码确定框架，将触发器放置在对预测结果影响最大的关键区域。为了使带有触发器的样本对人类检查员看起来更加自然和难以察觉，我们在触发器生成的损失函数中引入了一个体验质量(QoE)项，并仔细调整触发器的透明度。在迭代优化触发器生成和后门注入组件的过程中，我们提出了一种交替重新训练策略，这种策略被证明在提高干净数据准确性和回避某些基于模型的防御方法方面是有效的。\n\n我们在VGG-Flower、CIFAR-10、GTSRB、CIFAR-100和ImageNette数据集上进行了大量实验评估ATTEQ-NN。结果显示，当毒害比例较低时，ATTEQ-NN可以将攻击成功率提高多达82%，同时实现后门样本的高QoE。我们证明了ATTEQ-NN在不同光照条件和拍摄角度下在现实世界中达到了超过37.78%的攻击成功率。即使原始的带有后门的模型使用干净数据进行微调，ATTEQ-NN仍然保持了超过92.5%的攻击成功率。结果表明ATTEQ-NN在迁移学习场景中也是有效的。我们的用户研究表明，ATTEQ-NN生成的带有后门的样本在视觉检查下无法分辨。ATTEQ-NN被证明能够回避最先进的防御方法，包括模型修剪、NAD、STRIP、NC和MNTD。我们将在发表后公开我们的代码。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Attacks on ML\\AI\\Get a Model. Model Hijacking Attack Against Machine Learning Models.pdf": {
        "title": "Get a Model. Model Hijacking Attack Against Machine Learning Models",
        "abstract": "机器学习已经成为各种关键应用的基石，从自动驾驶到认证系统不一而足。然而，随着机器学习模型的日益普及，出现了多种攻击。其中一类攻击是训练时攻击，即攻击者在机器学习模型训练之前或期间执行攻击。在本文中，我们提出了一种针对基于计算机视觉的机器学习模型的新型训练时攻击，即模型劫持攻击。攻击者的目的是劫持目标模型，执行与其原始任务不同的任务，而模型所有者察觉不到。模型劫持可能导致问责和安全风险，因为被劫持的模型所有者可能会被认为提供非法或不道德的服务。模型劫持攻击与现有的数据污染攻击的方式相同。然而，模型劫持攻击的一个要求是隐蔽性，即用于劫持目标模型的数据样本应该与模型的原始训练数据集相似。为此，我们提出了两种不同的模型劫持攻击，即Chameleon和Adverse Chameleon，基于一种新颖的编码器-解码器风格的机器学习模型，即Camouﬂager。我们的评估结果显示，我们的两种模型劫持攻击都取得了很高的攻击成功率，而模型的效用几乎没有下降。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Attacks on ML\\AI\\Property Inference Attacks Against GANs.pdf": {
        "title": "Property Inference Attacks Against GANs",
        "abstract": "尽管机器学习（ML）在过去十年中取得了巨大的进展，但最近的研究表明，ML模型容易受到各种安全和隐私攻击。迄今为止，该领域的大部分攻击都集中在判别模型上，即分类器。与此同时，对生成模型（如生成对抗网络（GANs））的安全和隐私风险关注较少。在本文中，我们提出了针对GANs的首个训练数据集属性推断攻击集合。具体而言，攻击者旨在推断宏观级别的训练数据集属性，即用于训练目标GAN的样本比例与某个属性相关。成功的属性推断攻击可以使攻击者额外获取目标GAN的训练数据集的知识，从而直接侵犯目标模型所有者的知识产权。此外，它可以用作公平性审计员，检查目标GAN是否使用了有偏见的数据集进行训练。此外，属性推断可以作为其他高级攻击（如成员推断）的构建块。我们提出了一个通用的攻击流程，可以针对两种攻击场景进行调整，包括完全黑盒设置和部分黑盒设置。对于后者，我们引入了一种新的优化框架来提高攻击效果。在五个属性推断任务上对四个代表性GAN模型进行了大量实验证明了我们的攻击具有很强的性能。此外，我们还展示了我们的攻击可以用于提高对GANs的成员推断性能。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Attacks on ML\\AI\\RamBoAttack：A Robust and Query Efficient Deep Neural Network Decision Exploit.pdf": {
        "title": "RamBoAttack：A Robust and Query Efficient Deep Neural Network Decision Exploit",
        "abstract": "机器学习模型对于来自敌对样本的规避攻击非常容易受到影响。通常，敌对样本指的是在白盒访问设置下，具有完全访问模型权限的攻击者通过修改输入数据，使其与原始数据非常相似。然而，最近的攻击表明，使用黑盒攻击构造敌对样本的查询数量大大减少。尤其令人担忧的是，现在有实际能力利用越来越多的机器学习服务提供商（包括Google、Microsoft、IBM等）提供的训练模型访问接口中的分类决策（仅限硬标签），并被许多应用程序所使用。攻击者只利用模型查询中的预测硬标签来构造敌对样本的能力被称为基于决策的攻击。\n\n在我们的研究中，我们首先深入研究了ICLR和S&P中最新的基于决策的攻击，以突显利用近似梯度估计方法发现低畸变敌对样本的高成本性质。我们开发了一种强大的查询高效攻击方法，能够避免陷入局部最小值和在梯度估计方法中受到噪声梯度的误导。我们提出的攻击方法，RamBoAttack，利用随机块坐标下降的概念来探索隐藏的分类器流形，以针对特定输入特征进行扰动，以解决梯度估计方法的问题。重要的是，RamBoAttack对于对手可用的不同样本输入和目标类别具有更强的鲁棒性。总体而言，对于给定的目标类别，RamBoAttack在给定的查询预算内实现更低的畸变和更高的攻击成功率。我们使用大规模高分辨率的ImageNet数据集来验证我们的结果，并公开我们的攻击、测试样本和工件。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Blockchains\\Multi-Certificate Attacks against Proof-of-Elapsed-Time and Their Countermeasures.pdf": {
        "title": "Multi-Certificate Attacks against Proof-of-Elapsed-Time and Their Countermeasures",
        "abstract": "——经过时间的证明（Proof-of-Elapsed-Time，简称POET）是一种区块链共识协议，要求每个参与节点在每一轮的区块领导者选举中必须等待指定的时间间隔。它依赖于可信执行环境，如Intel SGX，以确保其安全性，并已在Hyperledger Sawtooth中实现并在许多实际应用中使用。本文研究了Sawtooth的POET设计和实现中的安全问题，包括公平性保证，并发现了针对POET的一类新的安全攻击，称为多证书攻击。这种攻击允许恶意节点在每一轮的区块领导者选举中不公平地创建多个证书，并选择能够最大化其获胜概率的证书。我们系统地分析了这些攻击的根本原因，并协助Sawtooth社区在最新版本的POET中修复了几个漏洞。为了进一步减轻已经发现的威胁，我们在本文中提出了一种新的POET设计，称为POETA，用于解决我们所发现的剩余漏洞。我们已经实现了POETA并评估了其安全性和性能。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Blockchains\\NC-Max：Breaking the Security-Performance Tradeoff in Nakamoto Consensus.pdf": {
        "title": "NC-Max：Breaking the Security-Performance Tradeoff in Nakamoto Consensus",
        "abstract": "Nakamoto Consensus（NC）最早在比特币中实施，尽管之后设计了许多替代协议，但NC仍然是加密货币中最具影响力的共识协议。然而，NC陷入了一个安全性与性能之间的平衡问题。尽管现有的努力大多试图通过放弃或调整NC的骨干协议来打破这种平衡，但我们转而关注网络层的相关性。我们确定并通过实验证明，问题出在尚未传播的交易导致的长时间块传播延迟。因此，我们提出了一个两步机制来确认只有完全传播的交易，从而消除NC性能上的限制，实现NC未开发的潜力。通过实施这个两步机制，我们提出了NC-Max，其（1）通过分析证明其安全性比NC对抗交易滞留攻击更强，（2）通过评估证明其性能充分利用了网络支持的吞吐量，并且相比于不损害安全性的NC，缩短了交易确认延迟3.0至6.6倍。NC-Max已经在Nervos CKB，一个公共无许可的区块链中实施。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Blockchains\\Shaduf：Non-Cycle Payment Channel Rebalancing.pdf": {
        "title": "Shaduf：Non-Cycle Payment Channel Rebalancing",
        "abstract": "—提高无权限区块链性能和可扩展性的主要方法之一是使用支付通道，该通道允许两个用户以几乎无限的频率进行链外支付。通过将支付通道链接在一起形成支付通道网络，通过通道路径相连的用户可以快速进行链外支付。然而，支付通道有遭遇资金耗尽的风险，这可能威胁到支付通道和网络的可用性。最近的方法需要一个基于循环的通道平衡过程，该过程需要一个公平的领导者和有平衡需求的用户在网络中形成有向循环。因此，其大规模应用受到限制。\n在这项工作中，我们介绍了Shaduf，这是一种新型的非循环链外平衡协议，为用户提供了一种在不依赖于循环设置的情况下直接在通道之间转移代币的新解决方案。Shaduf可以应用于更一般的平衡场景。我们提供了Shaduf的详细信息，并在通用组合性框架下正式证明了其安全性。我们的原型验证了其可行性，并且实验评估结果显示，Shaduf在支付成功率和交易量方面提高了闪电网络的性能。此外，我们的协议显著减少了用户在通道中的存款，同时保持了相同数量的支付。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Blockchains\\Speeding Dumbo：Pushing Asynchronous BFT Closer to Practice.pdf": {
        "title": "Speeding Dumbo：Pushing Asynchronous BFT Closer to Practice",
        "abstract": "异步BFT共识可以在不依赖任何时间假设的情况下实现强大的关键任务分散式服务网络。从HoneyBadgerBFT（CCS 2016）的工作开始，几项研究试图将异步BFT推向实践。在最近的Dumbo（CCS 2020）的工作中，他们重新设计了协议骨干，并使用了一个多值验证拜占庭协议（MVBA）来替代n个并发的异步二进制协议（ABA），从而显著提高了性能。尽管有这些努力，异步BFT协议仍然较慢，特别是延迟仍然很大。造成性能较差的原因有两个：（1）可靠广播（RBC）协议仍然需要很大的成本；（2）MVBA协议非常复杂且繁重，所有现有的构造都需要几十个回合，并占据整体延迟的大部分。我们首先提出了一种新的异步BFT构造，用更便宜的广播组件替换了RBC实例。它不仅将由n个RBC引起的O(n3)的消息复杂度减少到O(n2)，而且在存在公平的网络调度程序的情况下可以节省高达67%的通信量。此外，我们的技术核心是一种新的MVBA协议，名为Speeding MVBA，它比所有现有的MVBAs都更高效。它在最好的情况下只需要6个回合，在最坏的情况下预计需要12个回合（相比之下，Cachin等人的MVBA需要几十个回合，最近的Dumbo-MVBA需要约20个回合，Abraham等人的MVBA需要约20个回合）。我们构造的新技术可能具有独立的兴趣。我们实现了Speeding Dumbo并在全球范围内的15个AWS地区均匀分配的高达150个EC2 t2.medium实例中进行了广泛测试。实验结果显示，Speeding Dumbo将延迟降低到Dumbo的一半左右，并且将Dumbo的吞吐量提高了一倍，适用于从4个节点到150个节点的所有系统规模。我们还对广播和MVBA协议等各个组件进行了测试，这可能对未来的改进有所帮助。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cloud and Edge Computing\\Interpretable Federated Transformer Log Learning for Cloud Threat Forensics.pdf": {
        "title": "Interpretable Federated Transformer Log Learning for Cloud Threat Forensics",
        "abstract": "威胁检测和取证已成为任何数字取证现场的迫切目标。已经提出了监督方法来推断系统和网络异常，包括使用系统日志进行异常检测的贡献。然而，大多数研究都低估了模型决策过程的可解释性的重要性。在这项研究中，我们是首批提出了一种可解释的联邦变压器日志学习模型，以支持可解释的网络取证的威胁检测。所提出的模型是通过在组织单元中的每个客户端训练本地基于变压器的威胁检测模型来生成的。本地模型通过记录执行流程的系统日志学习系统的正常行为。随后，联邦学习服务器从本地模型中聚合学习到的模型参数，生成全局联邦学习模型。捕获正常行为的日志时间序列预计与具有网络威胁活动的日志时间序列不同。我们通过基于Karl-Pearson卡方统计量的拟合优度检验来证明这种差异。为了了解导致这种差异的行为，我们还集成了一个基于注意力的可解释性模块。我们使用HDFS、一个公开可用的日志数据集和一个名为CTDD的内部收集和公开释放的数据集来实施和评估我们提出的模型。CTDD数据集包含超过800万个代表云协作服务和受不同类别网络威胁损害的系统的系统日志。此外，通过不同的实验，我们证明了我们的方法在边缘计算系统等实际操作环境中的日志无关能力和适用性。我们的可解释性模块显示出正常日志和异常日志之间的显著注意力差异，为模型的决策过程提供了深入的解释。最后，我们认为获得的结果验证了我们的方法在实际威胁取证中的适当应用。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cloud and Edge Computing\\Remote Memory-Deduplication Attacks.pdf": {
        "title": "Remote Memory-Deduplication Attacks",
        "abstract": "内存利用率可以通过将相同的内存块合并为写时复制映射来降低。之前的研究表明，这种所谓的内存去重可以被利用在本地攻击中破解ASLR，监视其他程序，并确定数据的存在，即网站图片。所有这些攻击都利用了跨安全域的内存去重，而这一功能已被禁用。然而，在一个安全域内或者没有不受信任的本地访问的隔离系统上，内存去重仍然被认为不会带来安全风险，并且最近在Windows上默认重新启用了内存去重。\n\n在本文中，我们提出了第一个完全远程的内存去重攻击。与以前的攻击不同，我们的攻击不需要本地代码执行。因此，我们仅通过发送和计时HTTP/1和HTTP/2网络请求就可以披露远程服务器上的内存内容。我们在Windows和Linux上展示了我们对去重的攻击，并攻击了广泛使用的服务器软件，如Memcached和InnoDB。我们的侧信道在互联网上传输的数据量高达34:41 B，比其他相似的远程内存披露通道更快。我们在三个案例研究中展示了我们的远程内存去重攻击：首先，我们展示了攻击者可以在运行Memcached的服务器上披露内存中的数据存在。我们展示了这种信息泄漏通道也可以用于指纹识别，并在166:51秒内通过互联网检测正确的libc版本。其次，在与InnoDB结合使用时，我们提出了一种信息泄露攻击，以泄漏MariaDB数据库记录。第三，我们展示了一个完全远程的KASLR破解攻击，只需不到4分钟就可以在互联网上进行，即距离目标14个网络跳数。我们得出结论，即使仅在单个安全域内应用，内存去重也必须被视为安全风险。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cloud and Edge Computing\\Repttack：Exploiting Cloud Schedulers to Guide Co-Location Attacks.pdf": {
        "title": "Repttack：Exploiting Cloud Schedulers to Guide Co-Location Attacks",
        "abstract": "云计算范式已经成为存储和处理各种业务单位、公共组织、物联网和物理网络系统产生的大量数据的主要设施。为了满足用户的性能要求，同时最大化资源利用以实现成本效益，云管理员利用调度器将任务编排到不同的物理节点，并允许来自不同用户的应用程序共享同一物理节点。然而，微体系结构攻击，如侧信道攻击、瞬态执行攻击和Rowhammer攻击，利用共享资源来破坏共存的受害应用程序的机密性/完整性。由于共存对于微体系结构攻击是一项重要要求，因此在本研究中，我们调查攻击者是否可以利用云调度器满足微体系结构攻击的共存要求。具体而言，在本文中，我们全面分析了攻击者是否可以影响云调度器的调度过程，将其与云中的特定目标应用程序共存。我们的分析显示，对于允许用户提交应用程序要求的云调度器，攻击者可以精心选择攻击者的应用程序要求，以影响调度器将其与目标受害应用程序共存。我们称这种攻击为复制攻击（REPTTACK）。我们在模拟集群环境和真实集群中进行的实验结果显示出类似的趋势；单个攻击实例可以达到50％的共存率（共存概率），仅使用5个实例，共存率可以达到80％以上在异构云中。此外，我们提出并评估了一种缓解策略，可以帮助防御REPTTACK。我们相信我们的结果凸显了多用户集群中的调度器需要更加谨慎地设计安全性，并且制定调度决策的过程应尽可能少地涉及用户定义的信息。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cloud and Edge Computing\\Titanium：A Metadata-Hiding File-Sharing System with Malicious Security.pdf": {
        "title": "Titanium：A Metadata-Hiding File-Sharing System with Malicious Security",
        "abstract": "终端到终端加密的文件共享系统使用户能够在不向存储服务器透露文件内容的情况下共享文件。然而，服务器仍然可以获取元数据，包括用户身份和访问模式。先前的研究试图消除这种泄漏，但依赖于强假设。Metal（NDSS '20）对恶意服务器不安全。MCORAM（ASIACRYPT '20）提供了对恶意服务器的机密性，但没有完整性。Titanium是一个隐藏元数据的文件共享系统，提供了对恶意用户和服务器的机密性和完整性。与提供对恶意服务器机密性的MCORAM相比，Titanium还提供了完整性。实验表明，Titanium比MCORAM快5到200倍或更多。\n\n许多公司提供终端到终端加密的云存储，例如BoxCryptor [1]，Icedrive [2]，Keybase Filesystem [3]，MEGA [4]，pCloud [5]，PreVeil [6]，Sync [7]和Tresorit [8]。终端到终端加密的热情源于公众对个人数据被滥用的担忧[9]以及黑客窃取大企业的数据库[10]。然而，终端到终端加密并不是终点，因为云服务器仍然可以看到元数据。元数据，例如用户与谁共享文件，类似于通信隐私 - 斯坦福大学的MetaPhone研究[11]发现电话通话元数据“密切相互连接，易受重新识别，能够进行高度敏感的推断”。一位前NSA总顾问表示，“元数据绝对能告诉你有关某人生活的一切”[12]。\n\n从访问模式中提取秘密一直是安全研究的重要领域，并取得了很大成功。有一些作品使用社交关系使用户的匿名身份暴露[13-21]，使用访问模式侵犯加密数据库[22-28]，以及使用内存访问模式破解安全硬件[29,30]。这些攻击也可能适用于终端到终端加密的文件共享系统。\n\n为了了解元数据泄漏的影响，考虑一个应用程序（图1）以及它如何从元数据保护中受益。一个举报者Alice想向一名记者报告一家公司的丑闻。如果他们通过终端到终端加密存储进行通信，服务器会知道Alice与一名记者共享文件，并知道何时访问文件。如果服务器与该公司串通，该公司可能会发现举报者。终端到终端加密存储元数据隐藏的文件共享系统Alice和记者都有账户用户保持匿名Alice和记者共享文件F•Alice具有写权限•记者具有读权限F的访问控制列表未知Alice于5月26日给F写信记者于5月27日阅读了F有人于5月26日访问了某个文件有人于5月27日访问了某个文件5月28日，丑闻被报道了图1：终端到终端加密存储和元数据隐藏文件共享系统之间安全保证的比较。\n\n此外，黑客或云存储的恶意员工可能已经知道举报者的身份。\n\nAlice和记者需要一个隐藏元数据的存储系统。该系统必须具有匿名性，因此服务器不知道它正在与谁通信。它必须隐藏访问模式，以便服务器无法推断用户行为。是否存在这样的元数据隐藏文件共享系统？在过去的十年中，研究人员一直在努力设计实用的元数据隐藏存储[31-35]。这是具有挑战性的，因为几乎没有什么可信的东西：用户和服务器都可能是恶意的。我们需要恶意安全性。\n\nA. 对恶意安全性的需求\n\n实现恶意安全性的第一步是处理恶意用户。为了实现匿名性，必须有很多用户，并且我们不能假设他们中的任何一个都是恶意的。多年来，已经实现了对抗恶意用户的安全性，如表所示。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cyber-crime and Forensics\\Evaluating Susceptibility of VPN Implementations to DoS Attacks Using Adversarial Testing.pdf": {
        "title": "Evaluating Susceptibility of VPN Implementations to DoS Attacks Using Adversarial Testing",
        "abstract": "现今许多系统在连接网络和保护互联网上的服务方面都严重依赖虚拟私人网络（VPN）技术。然而，以往的研究只是比较了不同实现的性能，却没有考虑对抗性环境。为了填补这一空白，我们评估了VPN实现对基于洪水式拒绝服务（DoS）攻击的抵抗力。\n\n我们专注于一类无状态的洪水式攻击，这类攻击特别危险，因为攻击者可以通过欺骗性地伪造IP地址来执行这类攻击。我们实施了各种攻击来评估四种广泛使用的VPN解决方案的DoS抵抗力，并测量它们对具有40 Gb/s接口的高性能服务器的影响，结果令人惊讶：敌方只需使用300 Mb/s的攻击流量就能阻止已建立的WireGuard连接的数据传输。当使用strongSwan（IPsec）时，75 Mb/s的攻击流量足以阻止连接建立。100 Mb/s的洪水攻击会淹没OpenVPN，导致VPN连接和连接建立无法传输数据。Cisco的AnyConnect VPN解决方案甚至可以被更少的攻击流量压垮：当使用IPsec时，50 Mb/s的攻击流量会阻止连接建立。当使用SSL时，50 Mb/s的攻击流量会阻止已建立连接的数据传输。此外，对WireGuard的性能分析揭示了与多核同步相关的实现中的显著低效。我们还发现了strongSwan和OpenVPN实现中的漏洞，攻击者可以轻易地利用这些漏洞进行高效的DoS攻击。这些发现表明有必要对VPN实现进行对抗性测试，以提高其对DoS攻击的抵抗力。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cyber-crime and Forensics\\Forensic Analysis of Configuration-based Attacks.pdf": {
        "title": "Forensic Analysis of Configuration-based Attacks",
        "abstract": "因果关系分析是一种有效的技术，用于调查和检测网络攻击。然而，现有的因果分析技术主要集中在操作系统层面的审计，缺乏对重要的应用程序级语义的可见性，例如控制应用程序运行时行为的配置更改。这导致了错误的攻击归因和不完整的溯源。\n\n在这项工作中，我们提出了Dossier，一种专门的溯源追踪器，增强了Linux审计基础设施的可见性。通过为系统提供额外的钩子，Dossier可以生成目标应用程序事件历史和因果链的整体视图，特别是与配置更改相关的那些在现实世界中最常见的攻击向量。Dossier中的额外优势点使得法医调查人员可以弥合语义差距，并正确地拼凑攻击碎片。Dossier利用信息流追踪和系统调用内省的多功能性，跟踪所有配置更改，包括直接更新配置相关程序变量的动态修改和对磁盘上的配置文件进行的修订，运行时开销可忽略（低于7%）。对真实工作负载和现实世界的攻击场景的评估表明，Dossier可以有效地推理基于配置的攻击并准确重构整个攻击过程。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cyber-crime and Forensics\\LogicMEM：Automatic Profile Generation for Binary-Only Memory Forensics via Logic Inference.pdf": {
        "title": "LogicMEM：Automatic Profile Generation for Binary-Only Memory Forensics via Logic Inference",
        "abstract": "——内存取证工具依赖于对内核符号和内核对象布局的了解，从内存转储中检索数字证据和工件。这种知识被称为“配置文件”。现有的配置文件生成解决方案要么不方便，要么不准确。在本文中，我们提出了一种逻辑推理方法，可以直接从内存转储中自动生成配置文件。它利用内核数据结构中存在的不变量，跨所有内核版本和配置，精确地定位内核对象中所需的取证字段。我们实现了一个名为LOGIC MEM的原型，并对从主流Linux发行版、具有随机配置的自定义Linux内核以及为Android智能手机和嵌入式设备设计的操作系统收集的内存转储进行了评估。评估结果表明，所提出的逻辑推理方法非常适合定位所需的取证字段，并且在主流Linux发行版中实现了100％的精确度和召回率，以及在具有随机配置的自定义内核中实现了100％的精确度和95％的召回率。此外，我们还展示了通过改进的逻辑规则可以消除误报。我们还证明LOGIC MEM可以在现有方法难以（如果不是不可能）生成配置文件时生成配置文件，并支持内存取证任务，如rootkit检测。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cyber-crime and Forensics\\The Truth Shall Set Thee Free：Enabling Practical Forensic Capabilities in Smart Environments.pdf": {
        "title": "The Truth Shall Set Thee Free：Enabling Practical Forensic Capabilities in Smart Environments",
        "abstract": "在智能环境中，如智能家居和办公场所，设备、用户和应用之间的交互会产生大量的数据。这些数据包含有关智能环境中发生的事件和活动的有价值的取证信息。然而，当前的智能平台并没有提供任何数字取证能力来识别、追踪、存储和分析在这些环境中产生的数据。为了填补这一空白，本文介绍了VERITA S，一种新颖实用的智能环境数字取证能力。VERITA S由两个主要组成部分组成：收集器和分析器。收集器实施机制来自动收集智能环境中与取证相关的数据。然后，在取证调查事件发生时，分析器使用一阶马尔可夫链模型从收集的数据中提取有价值且可用的取证信息。然后，VERITA S使用取证信息来推断用户、设备和应用的活动和行为是否违反了环境中定义的安全策略。我们在一个真实的智能办公环境中实施和测试了VERITA S，该环境中有22个智能设备和传感器，产生了84209个具有取证价值的事件。评估结果显示，VERITA S在推断智能环境中的不同异常活动和取证行为方面的准确率超过95%。最后，VERITA S非常轻量级，对设备没有任何额外负担，并且后端资源（即云服务器）的开销非常小。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cyber-physical Systems\\Hiding My Real Self. Protecting Intellectual Property in Additive Manufacturing Systems Against Optical Side-Channel Attacks.pdf": {
        "title": "Hiding My Real Self. Protecting Intellectual Property in Additive Manufacturing Systems Against Optical Side-Channel Attacks",
        "abstract": "我们提出了一种光学侧信道攻击方法，用于恢复添加制造（AM）系统中的知识产权。具体而言，我们使用深度神经网络通过逐帧分析打印机视频来估计打印头的坐标随时间变化的函数关系。我们发现，深度神经网络可以成功恢复任意打印过程的路径。通过使用数据增强，神经网络可以容忍相机位置和角度以及照明条件的一定程度变化。神经网络可以智能地进行插值，并准确恢复训练数据集中未见图像的坐标。为了防御光学侧信道攻击，我们提出使用光学噪声注入方法。具体来说，我们使用光学投影仪人为地将精心制作的光学噪声注入到打印区域，以混淆攻击者并增加恢复打印路径的难度。我们发现，现有的噪声生成算法，如重播、随机斑点、白噪声和全功率，可以轻松地击败不知道注入噪声存在的天真攻击者。然而，了解注入噪声并在训练数据集中加入含有注入噪声的图像的高级攻击者可以击败所有现有的噪声生成算法。为了防御这种高级攻击者，我们提出了三种新颖的噪声生成算法：通道均匀化、状态均匀化和状态随机化。我们的实验结果表明，通过状态随机化生成的噪声可以成功防御高级攻击者。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cyber-physical Systems\\PoF：Proof-of-Following for Vehicle Platoons.pdf": {
        "title": "PoF：Proof-of-Following for Vehicle Platoons",
        "abstract": "合作车队编队显著提高了高速公路的安全性、燃油效率和交通流畅性。在这个模型中，一组车辆按照线形编队移动，并利用物理感知和车辆间通信（V2V）的组合来协调加速、刹车和转向。V2V消息的真实性和完整性对安全至关重要。因此，最近的V2V和V2X标准支持PKI的集成。然而，PKI不能将车辆的数字身份与车辆的物理状态（位置、速度等）绑定在一起。因此，具有有效加密凭据的车辆可以从远程位置影响编队。\n在本文中，我们试图在车队编队的背景下提供物理世界与数字世界之间的缺失链接。我们提出了一种新的访问控制协议，我们称之为Proof-ofFollowing（PoF），该协议验证了候选者和验证者之间的跟随距离。主要思想是从紧密行驶的车辆所经历的共同但不断变化的环境中获取安全性。我们利用环境射频信号的大尺度衰落效应作为构建PoF原语的共同随机源。大尺度衰落的相关性是移动户外环境的理想候选者，因为它随着距离和时间呈指数级衰减。我们在高速公路、公路和城市驾驶条件下对我们的PoF协议进行了实验性车队的评估。我们展示了PoF在面对预先记录和跟随攻击时，具有极高的概率能够抵抗这些攻击。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cyber-physical Systems\\RVPLAYER：Robotic Vehicle Forensics by Replay with What-if Reasoning.pdf": {
        "title": "RVPLAYER：Robotic Vehicle Forensics by Replay with What-if Reasoning",
        "abstract": "机器人车辆（RV）攻击取证可以确定事故的根本原因。在这个过程中，重现事故并推理其成因是关键的步骤。理想情况下，这种调查应该在真实世界的现场测试中进行，通过忠实地再现环境条件并改变不同因素来理解因果关系。然而，由于强制执行物理条件的困难，这种分析非常昂贵，在许多情况下也是不可行的。现有的RV取证技术侧重于在模拟中忠实地再现事故，并因此缺乏因果推理的支持。它们还需要大量的开销。我们提出了一种名为RVPLAYER的RV取证系统。它支持在模拟器内进行重放和假设推理（例如，通过改变某些控制参数、代码或车辆状态来检查是否可以避免事故）。它是昂贵的现场测试取证的低成本替代品。它具有一种高效的需求驱动自适应日志记录方法，可以捕获非确定性的物理条件，以及一种新的重放技术，支持各种重放策略，在重放过程中选择性地启用/禁用信息以进行根本原因分析。我们对6个RV（4个真实和2个虚拟）、5个真实世界自动驾驶轨迹和1194种文献中报告的各种攻击实例进行了评估，结果显示它能够准确地确定这些攻击的根本原因，而且没有误报。它只有简单日志设计的6.57%的开销。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Cyber-physical Systems\\Too Afraid to Drive：Systematic Discovery of Semantic DoS Vulnerability in Autonomous Driving Planning under Physical-World Attacks.pdf": {
        "title": "Too Afraid to Drive：Systematic Discovery of Semantic DoS Vulnerability in Autonomous Driving Planning under Physical-World Attacks",
        "abstract": "在高级自动驾驶（AD）系统中，行为规划负责制定高级驾驶决策，如巡航和停车，因此具有高度的安全性。在这项工作中，我们首次系统地研究了针对过度保守的AD行为规划行为的语义安全漏洞，即可能导致任务失败或显著降低性能的漏洞，这对于AD服务（如机器人出租车/配送）来说至关重要。我们称之为语义拒绝服务（DoS）漏洞，我们预计由于保守性倾向以避免安全事件，这些漏洞在实际AD系统中最常暴露。为了实现高实用性和逼真性，我们假设攻击者只能向驾驶环境中引入看似良性的外部物体，例如路外倾倒的纸箱。为了系统地发现这种漏洞，我们设计了一种新颖的动态测试方法PlanFuzz，解决了各种特定问题设计挑战。具体而言，我们提出并确定了规划不变量作为新颖的测试预言，并设计了新的输入生成方法，以系统地强制执行攻击者引入的物理对象的特定问题约束。我们还设计了一种新颖的行为规划漏洞距离度量方法，以有效地指导发现。我们在来自实际开源AD系统的3个规划实现上评估了PlanFuzz，并发现它可以有效地发现9个以前未知的语义DoS漏洞，而不会产生误报。我们发现所有新设计都是必要的，因为如果没有每个设计，通常会观察到统计上显著的性能下降。我们还使用仿真和真实车辆轨迹进行了利用案例研究，并讨论了根本原因和潜在修复方法。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Fuzzing\\Context-Sensitive and Directional Concurrency Fuzzing for Data-Race Detection.pdf": {
        "title": "Context-Sensitive and Directional Concurrency Fuzzing for Data-Race Detection",
        "abstract": "如今，模糊测试在漏洞检测和漏洞发现方面非常受欢迎。为了将模糊测试应用于并发问题，如数据竞争，最近的一些并发模糊测试方法考虑了程序执行的并发信息，并通过在运行时影响线程调度来探索线程交错。然而，这些方法在数据竞争检测方面仍然存在局限性。一方面，它们未考虑线程交错的执行上下文，可能会错过特定运行时上下文中的真实数据竞争。另一方面，它们执行随机的线程交错探索，经常重复已经覆盖的线程交错，并且错过许多不常见的线程交错。\n\n在本文中，我们开发了一种名为C ONZZER的新型并发模糊测试框架，以有效地探索线程交错并检测难以发现的数据竞争。C ONZZER的核心是一种上下文敏感和定向的并发模糊测试方法，用于线程交错探索，并引入了两种新技术。首先，为了确保上下文敏感性，我们提出了一种新的并发覆盖度指标，称为并发调用对，用于描述具有运行时调用上下文的线程交错。其次，为了定向地探索线程交错，我们提出了一种邻接指向突变的方法，生成可能的新线程交错，其中已经包含了已覆盖的线程交错，然后使用断点控制方法在运行时尝试实际覆盖它们。\n\n借助这两种技术，这种并发模糊测试方法可以有效地覆盖具有具体上下文信息的不常见线程交错，帮助发现难以发现的数据竞争。我们在8个用户级应用程序和4个内核级文件系统上评估了C ONZZER，并发现了95个真实的数据竞争。我们确认其中75个数据竞争是有害的，并将其发送给相关开发人员，其中44个已经得到确认。我们还将C ONZZER与现有的模糊测试工具进行了比较，发现C ONZZER持续探索更多的线程交错，并找到了这些工具错过的许多真实数据竞争。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Fuzzing\\EMS：History-Driven Mutation for Coverage-based Fuzzing.pdf": {
        "title": "EMS：History-Driven Mutation for Coverage-based Fuzzing",
        "abstract": "基于变异的模糊测试是发现程序漏洞最流行的方法之一。为了减轻变异过程中高度随机性带来的效率低下问题，近年来开发了多种解决方案，尤其是基于覆盖率的模糊测试。它们主要采用自适应变异策略或整合约束求解技术，以对触发独特路径和崩溃的测试用例进行良好的探索。然而，它们缺乏对模糊测试历史的细粒度重用，以构建这些有趣的测试用例，即它们在不同的模糊测试试验中往往无法充分利用模糊测试历史。实际上，我们发现模糊测试历史中的测试用例包含了导致发现独特路径和崩溃的关键变异策略的丰富知识。具体而言，在这些变异策略中隐含的部分路径约束解决方案可以被重用，以加速发现具有相似部分路径约束的新路径和崩溃。\n\n因此，我们首先提出了一种轻量级和高效的概率字节定向模型（PBOM），可以正确捕捉来自试验内和试验间历史的字节级变异策略，从而有效触发独特路径和崩溃。然后，我们提出了一种名为EMS的新型基于历史的变异框架，将PBOM作为变异操作符之一，根据输入值以概率方式提供所需的变异字节值。我们在9个真实世界程序上对EMS进行了评估，包括AFL、QSYM、MO PT、MO PT-dict、EcoFuzz和AFL++等最先进的模糊测试工具。结果显示，EMS发现的独特漏洞数量比基线多出4.91个，并且在大多数程序上比其他模糊测试工具具有更高的代码覆盖率。我们将所有发现的新漏洞报告给供应商，并将EMS的原型代码开源在GitHub上。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Fuzzing\\FirmWire：Transparent Dynamic Analysis for Cellular Baseband Firmware.pdf": {
        "title": "FirmWire：Transparent Dynamic Analysis for Cellular Baseband Firmware",
        "abstract": "如今，智能手机利用基带处理器来实现各种蜂窝通信协议。基带执行固件，负责解码数十年来发展的数百种蜂窝标准的消息类型。尽管基带固件的无线攻击面较大，但它接收到的安全分析却很少。以前的研究主要只分析了少数几个设备型号的几个固件镜像，但往往依赖耗时的手动静态分析或单功能模糊测试。\n为了填补这个空白，我们提出了FIRMWIRE，这是第一个为基带处理器提供全系统仿真平台的技术，可以执行未修改的基带二进制固件。FIRMWIRE提供了基带特定的API，以便轻松添加对新供应商、固件镜像和安全分析的支持。为了展示FIRMWIRE的可扩展性，我们支持了2个供应商和9个手机型号的213个固件镜像，并允许对它们进行执行和测试。利用这些镜像，FIRMWIRE可以自动发现和桥接内部基带API，从而方便地注入协议消息。利用这些入口，我们选择了LTE和GSM协议进行模糊测试，并发现了7个可能导致远程代码执行的预身份验证内存破坏问题，其中4个以前是未知的。我们在真实设备上通过无线方式重现了这些崩溃，证明了FIRMWIRE的仿真准确性。\nFIRMWIRE是一个可扩展的基带安全测试平台，并将其作为开源软件发布给社区供未来研究使用。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Fuzzing\\MobFuzz：Adaptive Multi-objective Optimization in Gray-box Fuzzing.pdf": {
        "title": "MobFuzz：Adaptive Multi-objective Optimization in Gray-box Fuzzing",
        "abstract": "—覆盖引导的灰盒模糊测试（CGF）是一种高效的软件测试技术。在CGF中通常有多个需要优化的目标。然而，现有的CGF方法无法同时成功地找到多个目标的最优值。在本文中，我们提出了一种用于多目标优化（MOO）的灰盒模糊测试器MobFuzz。我们将多目标优化过程建模为多人多臂赌博机（MPMAB）。首先，它自适应地选择包含当前情况下最合适目标的目标组合。其次，我们的模型处理能量调度，根据所选的目标组合自适应地分配能量给种子。在MobFuzz中，我们提出了一种名为NIC的进化算法，可以同时优化我们选择的目标而不会增加额外的性能开销。为了证明MobFuzz的有效性，我们在12个真实世界程序和MAGMA数据集上进行了实验。实验结果表明，与基准模糊测试器相比，MobFuzz中的多目标优化效果更好。与它们相比，MobFuzz可以选择最优的目标组合，并将多个目标的值增加到107%，同时能量消耗最多减少55%。此外，MobFuzz具有多达6%的程序覆盖率，并找到3倍以上的唯一漏洞。NIC算法的性能至少提高了2倍，性能开销约为3%。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Human Factors\\Above and Beyond：Organizational Efforts to Complement U.S. Digital Security Compliance Mandates.pdf": {
        "title": "Above and Beyond：Organizational Efforts to Complement U.S. Digital Security Compliance Mandates",
        "abstract": "组织提供的电力、医疗保健和安全金融交易等基本服务，需要使用数字安全合规程序来建立最低安全基准。不幸的是，这些合规程序因其编写和组织实施方式存在多种问题，导致组织采取自己的安全措施来弥补实际或感知到的合规漏洞。在本研究中，我们对来自美国六个基本服务行业的40名安全专业人员进行调查，以了解组织如何补充合规措施来解决感知到的安全漏洞，哪些措施特别有效，以及他们的组织如何确定和评估所采用的措施的优先级。\n\n我们发现，组织经常补充合规程序，40名参与者中有37人确认他们的组织已经超出了他们认为必要的合规措施，以减轻其他未解决的风险。尽管参与者对这些感知到的补充措施普遍持积极态度，但他们也报告了与管理不善、信息饱和和难以及时更新和相关的补充措施的挑战。根据这些结果，我们建议合规标准直接整合对组织选择实施的感知到的补充措施进行精心管理和审计的指导，并且组织在实施这些措施之前要进行端到端的部署和运营规划。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Human Factors\\Demystifying Local Business Search Poisoning for Illicit Drug Promotion.pdf": {
        "title": "Demystifying Local Business Search Poisoning for Illicit Drug Promotion",
        "abstract": "一种新型的地下非法药品推广方式，即在本地搜索服务（例如本地知识面板、地图搜索、语音搜索）上发布非法药品业务列表，正日益被不法分子利用在互联网上进行广告和销售受控物质。不法分子利用数据质量控制不严的上游本地数据经纪人发布促进非法药品业务的列表。这种推广进而污染主要的下游搜索提供商的知识库，并通过网络、地图和语音搜索触达大量受众。据我们所知，迄今为止，很少有人对这种新的非法推广进行范围、影响和技术方面的了解，更不用说在大规模上识别此类非法药品业务列表的努力了。在本文中，我们报告了对本地搜索服务上非法药品业务列表的首次测量研究。我们的发现揭示了脆弱且监管较少的本地业务列表生态系统以及此类非法活动的普遍存在，以及对本地搜索受众的影响。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Human Factors\\Fighting Fake News in Encrypted Messaging with the Fuzzy Anonymous Complaint Tally System (FACTS).pdf": {
        "title": "Fighting Fake News in Encrypted Messaging with the Fuzzy Anonymous Complaint Tally System (FACTS)",
        "abstract": "近年来，虚假信息通过在线平台传播的普遍性和现实影响都有了显著增加。同时，像WhatsApp、Signal和Telegram这样的加密消息系统正在迅速流行起来，因为用户在数字生活中追求更高的隐私保护。我们所面临的挑战是如何在不损害隐私的情况下打击虚假信息的病毒式传播。我们的FACTS系统在用户的投诉下对消息进行追踪，只有在收到足够多的投诉后才会揭示消息的内容和发送者。我们的系统是私密的，意味着不会泄露少量或没有投诉的消息的发送者或内容；安全的，意味着恶意用户无法逃避系统或对投诉系统产生过大的影响；可扩展的，因为我们展示了每天处理数百万投诉的优秀实际效率。我们的主要技术贡献是一个新的协作计数布隆过滤器，它是一种简单的结构，具有困难的概率分析，可以作为一种保护隐私的随机计数草图数据结构而具有独立的兴趣。与以往关于端到端加密消息中标记和追踪的工作相比，我们的创新之处在于添加了多个投诉的高门槛，即在进行审核或标记之前需要多个投诉。我们通过实验展示并仔细分析了我们数据结构的概率性能，提供了精确的安全定义和证明，然后通过实验测量了我们方案的准确性和可扩展性。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Human Factors\\Hazard Integrated：Understanding Security Risks in App Extensions to Team Chat Systems.pdf": {
        "title": "Hazard Integrated：Understanding Security Risks in App Extensions to Team Chat Systems",
        "abstract": "团队聊天（TACT）系统现在广泛用于在线协作和项目管理。这些系统的一个独特特点是其集成了第三方应用程序，这扩展了其功能，但也带来了潜在的复杂性，可能会对TACT系统及其最终用户造成风险。在本文中，我们首次展示了TACT系统中的第三方应用程序确实为新的安全风险打开了大门，例如特权升级、欺骗和隐私泄露。我们研究了12个流行的TACT系统，按照第三方应用程序的生命周期的关键步骤进行研究（安装、更新、配置和运行时操作）。值得注意的是，我们设计并实施了一个管道，以高效地识别TA API的安全风险，这是系统-应用程序通信提供的核心功能。我们的研究发现了12个平台上的55个安全问题，其中25个在安装和配置阶段，30个API容易受到攻击或风险。这些安全弱点主要是由于设计不当、缺乏细粒度的访问控制和模糊的数据访问策略引起的。我们向所有相关方报告了我们的发现，其中8个得到了承认。尽管我们仍在与TACT供应商合作确定剩下的缺陷的安全影响，但我们的用户研究已经确认了它们的重要性，进一步揭示了用户对主流TACT平台上实施的一些安全策略以及他们对现有保护的误解的关注。此外，我们与供应商的沟通表明，他们的威胁模型没有经过深思熟虑，一些假设相互冲突。我们进一步提出建议，以提高当今TACT系统的安全质量。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\IoT and Networks\\A Lightweight IoT Cryptojacking Detection Mechanism in Heterogeneous Smart Home Networks.pdf": {
        "title": "A Lightweight IoT Cryptojacking Detection Mechanism in Heterogeneous Smart Home Networks",
        "abstract": "最近，加密货币挖矿恶意软件成为了获取和从大量受害者中获利的一种简单途径。之前的研究主要关注浏览器内和基于主机的加密货币挖矿恶意软件的检测系统。然而，这些早期工作中没有研究在这个背景下不同的攻击配置和网络设置。例如，一个采用激进盈利策略的攻击者可能会将计算资源增加到最大利用率，以在短时间内获得更多利益，而一个隐秘的攻击者可能希望在受害者设备上保持较长时间的未被发现状态。检测机制的准确性可能会因攻击者的激进程度和隐秘性而有所不同。不仅是盈利策略，还有加密货币挖矿恶意软件类型、受害者设备以及网络完全或部分受损的各种网络设置可能在检测机制的性能评估中起关键作用。另外，多个物联网设备的智能家居网络容易被攻击者利用，它们被用来代表攻击者进行加密货币挖矿。然而，之前的研究没有调查加密货币挖矿恶意软件对物联网设备和受损的智能家居网络的影响。本文首先提出了一种基于网络流量特征的准确高效的物联网加密货币挖矿恶意软件检测机制，可以检测浏览器内和基于主机的加密货币挖矿。然后，我们关注在新设备类别（如物联网）上的加密货币挖矿实施问题，并设计了几个新颖的实验场景来评估我们的检测机制，以覆盖攻击者当前的攻击面。特别地，我们在各种攻击配置和网络设置下测试了我们的机制。为此，我们使用了一个包含640万个网络数据包的数据集，并展示了我们的检测算法在仅有一小时的训练数据的情况下可以达到99%的准确率。据我们所知，这项工作是第一次关注物联网加密货币挖矿，并且是在加密货币挖矿检测领域分析各种攻击者行为和网络设置的第一项研究。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\IoT and Networks\\ditto：WAN Traffic Obfuscation at Line Rate.pdf": {
        "title": "ditto：WAN Traffic Obfuscation at Line Rate",
        "abstract": "许多大型组织通过专用广域网（WAN）与互联网分开运营，以通过高吞吐量的链路连接其数据中心和远程站点。尽管加密通常可以有效保护这些WAN免受内容窃听，但它们仍然容易受到流量分析攻击的影响，这些攻击可以通过分析流量的数量、数据包大小或时间信息来推断访问的网站、观看的视频或VoIP通话的内容。现有的混淆互联网流量的技术对于WAN来说并不适用，因为它们要么效率非常低，要么需要对终端主机使用的通信协议进行修改。\n\n本文介绍了ditto，一种适用于WAN需求的流量混淆系统：在不修改终端主机的情况下，实现高吞吐量的流量混淆。ditto向数据包添加填充，并引入干扰数据包，使得所得到的混淆流量与实际产生的流量在数据包大小、时间和流量数量上独立。\n\n我们在网络数据平面上评估了完整的ditto实现。我们的结果表明，ditto以100 Gbps的线速率运行，并在每个WAN链路的实际流量负载高达70 Gbps时表现出可忽略的性能开销。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\IoT and Networks\\EqualNet：A Secure and Practical Defense for Long-term Network Topology Obfuscation.pdf": {
        "title": "EqualNet：A Secure and Practical Defense for Long-term Network Topology Obfuscation",
        "abstract": "路径跟踪工具（如traceroute）是网络运营商检测和修复网络故障的简单而基本的网络调试工具。不幸的是，攻击者也可以使用这些工具来检索以前未知的网络拓扑信息，这对于实现更高效的拒绝服务攻击（如链路洪水攻击）至关重要。在过去几年中，已经提出了几种网络混淆防御方法，通过展示虚拟（假的）拓扑来积极减轻链路洪水攻击，以隐藏潜在的瓶颈网络链路。然而，迄今为止，对它们的虚拟拓扑所提供的安全性和实用性水平尚未进行全面系统的分析。因此，对其进行关键性分析是更好地了解其限制并建立更强大、更实用的链路洪水攻击防御的必要步骤。\n\n在本文中，我们首先对三种最先进的网络混淆防御进行安全性分析。我们的分析揭示了四个重要的共同限制，这些限制可能会严重降低其虚拟拓扑的安全性和实用性。受我们的发现启发，我们提出了EqualNet，一种安全且实用的长期网络拓扑混淆积极防御方法，可减轻网络域内的链路洪水攻击。EqualNet旨在平衡节点和链路上的跟踪流分布，以使攻击者无法区分哪些是最重要的节点和链路，从而显著增加执行链路洪水攻击的成本。同时，EqualNet保留子网信息，帮助使用路径跟踪工具调试网络的网络运营商。为了证明其可行性，我们使用软件定义网络（SDN）实现了一个完整的原型，并进行了软件和硬件的广泛评估。我们的结果表明，即使网络中只有少数路由器支持SDN，EqualNet也可以有效地平衡小型、中型和大型网络的跟踪流分布。最后，我们分析了EqualNet对各种攻击的安全性。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\IoT and Networks\\FANDEMIC：Firmware Attack Construction and Deployment on Power Management Integrated Circuit and Impacts on IoT Applications.pdf": {
        "title": "FANDEMIC：Firmware Attack Construction and Deployment on Power Management Integrated Circuit and Impacts on IoT Applications",
        "abstract": "供应链已成为我们经济世界的支柱，并为企业和用户带来了巨大的优势。这些网络由公司和供应商组成，旨在通过将生产过程的各个阶段转移到第三方铸造厂来降低成本和生产时间。尽管全球化的供应链提供了许多优势，但它们也容易受到管道各个环节的攻击。对于物联网（IoT）设备来说，这个问题由固件漏洞加剧，这些漏洞影响系统硬件的低级控制。此外，根据国家漏洞数据库（NVD），每年物联网设备中的固件漏洞数量都在快速增加，这使得这些固件漏洞成为一个令人担忧的问题，并加大了解决新兴固件漏洞的需求。在本文中，我们试图定义和扩展一类固件漏洞，其特点是恶意配置电源管理集成电路（PMIC）。我们提出了一种在电源管理IC（FANDEMIC）上构建和部署固件攻击的方法，其中包括逆向工程裸机物联网固件二进制文件，并识别与其PMIC交互的功能。我们演示了直接更改二进制文件以故意错误配置PMIC的可能性，从而改变供电线路电压，这可能导致设备出现各种问题。我们提出了一种使用Ghidra和Python脚本编写的二进制逆向工程工作流，并提供了两种简单但新颖的函数匹配算法。此外，我们强调并讨论了PMIC攻击可能导致的前述后果，特别是电池退化和故障、加速老化效应以及传感器数据损坏。作为概念验证，我们在nRF52微控制器和MAX20303 PMIC上实施了提出的攻击，以演示传感器数据损坏。最后，我们讨论了可能的缓解技术，包括二进制审计和安全固件更新。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Kernel Security\\An In-depth Analysis of Duplicated Linux Kernel Bug Reports.pdf": {
        "title": "An In-depth Analysis of Duplicated Linux Kernel Bug Reports",
        "abstract": "在过去的三年中，持续模糊测试项目Syzkaller和Syzbot在检测内核漏洞方面取得了巨大的成功，发现的内核漏洞数量超过了过去20年的总和。然而，持续模糊测试的一个副作用是会生成大量的崩溃报告，其中许多是由同一个漏洞引起的“重复”报告。虽然Syzbot使用简单的启发式方法来对报告进行分组（去重），但我们发现它经常不准确。在本文中，我们通过实证分析重复的内核漏洞报告来了解：（1）重复性的普遍程度；（2）重复性引入的潜在成本；以及（3）重复问题的主要原因。我们收集了从2017年9月到2020年11月的所有修复的内核漏洞，包括由Syzbot分组的3,240,000个崩溃报告，涵盖了2,526个漏洞报告（通过唯一的漏洞标题进行标识）。我们发现这些漏洞报告确实存在重复：2,526个漏洞报告中有47.1%与一个或多个其他报告重复。通过分析这些报告的元数据，我们发现未检测到的重复性会带来额外的时间和开发人员工作量成本。然后，我们组织了Linux内核专家来分析重复的漏洞样本（375个漏洞报告，唯一的120个漏洞），并确定了导致重复的6个关键因素。基于这些实证结果，我们提出并设计了用于漏洞去重的可操作策略的原型。在使用真实数据集确认其有效性后，我们进一步应用了我们的方法，并在未解决的漏洞中识别出以前未知的重复情况。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Kernel Security\\Kasper：Scanning for Generalized Transient Execution Gadgets in the Linux Kernel.pdf": {
        "title": "Kasper：Scanning for Generalized Transient Execution Gadgets in the Linux Kernel",
        "abstract": "由于序列化指令的高成本，以减轻对错误预测条件分支的Spectre类攻击（Spectre-PHT），关键软件（如Linux内核）的开发人员选择性地应用此类缓解措施，并在假设具有推测执行危险的代码路径上进行注释。这种方法导致保护不完整，因为它只对易于识别的小工具应用缓解措施。然而，直到现在，这是足够的，因为现有的小工具扫描器（和内核开发人员）是基于模式的：它们寻找已知的利用签名，无法检测到更通用的小工具。\n\n在本文中，我们放弃了模式扫描的方法，采用了一种模拟推测执行攻击中使用的基本步骤的方法，从而使我们能够发现更通用的小工具，远远超出现有扫描器的能力范围。特别是，我们提出了KASPER，一种推测执行小工具扫描器，它使用污点分析策略来模拟攻击者能够利用瞬态路径上的任意软件/硬件漏洞来控制数据（例如通过内存操作或LVI），访问秘密信息（例如通过越界或使用后释放访问），并泄露这些秘密信息（例如通过基于缓存、基于MDS或基于端口竞争的隐蔽通道）。\n\n最后，尽管现有解决方案针对用户程序，KASPER在内核中发现了小工具，这是一个更有价值的攻击目标，但也更复杂分析。尽管内核受到了严格的瞬态执行攻击的防护，KASPER仍然发现了1379个尚未缓解的小工具。我们通过演示KASPER发现的一个小工具的端到端的概念证明攻击来确认我们的发现。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Kernel Security\\Progressive Scrutiny：Incremental Detection of UBI bugs in the Linux Kernel.pdf": {
        "title": "Progressive Scrutiny：Incremental Detection of UBI bugs in the Linux Kernel",
        "abstract": "——Linux内核有一个快速的开发周期，平均每小时有10个提交。虽然这些更新提供了新功能和错误修复，但也可能引入新的错误和安全漏洞。最近的技术展示了如何使用静态分析来检测一些类型的漏洞，但这些工具无法快速运行以跟上内核开发的速度。理想情况下，增量分析技术可以解决这个问题，通过进行一次完整的分析，然后仅分析后续更改的代码部分。然而，Linux内核的增量分析面临独特的挑战，因为它的规模庞大，需要高精度来减少误报。\n在本文中，我们设计并实现了一种新颖的Linux内核增量分析工具INCRELUX。它通过对新代码和受影响的先前代码进行有针对性的分析，实现了在每次更新后快速检测漏洞，并加快了对已有错误的跟踪，以了解它们存在的时间，从而增强对此类错误的认识。我们的方法依赖于一种自下而上、基于函数摘要的方法，它利用了一次性的干净状态分析先前Linux基线的好处，但代价较高。INCRELUX还使用了一种有效的启发式方法，将符号执行应用于增量结果以提高精度。通过对查找使用前未初始化（UBI）错误这个具有挑战性的问题进行广泛实验，我们展示了INCRELUX的许多好处：(a)我们可以快速检查任何新发布是否引入了UBI错误，并在过程早期帮助消除它们。(b)我们进行历史分析，确定一个错误是何时首次引入的，以及何时被修复（这是Linux内核中错误分析的关键步骤）。(c)我们将增量分析结果与干净状态分析进行比较，并展示我们的方法几乎得到了完全相同的结果，证明了它的准确性和效率。虽然干净状态分析耗时106.45小时，但增量分析通常在几分钟内完成，实现了主线内核平均200倍的加速和稳定分支平均440倍的加速。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Kernel Security\\Semantic-Informed Driver Fuzzing Without Both the Hardware Devices and the Emulators.pdf": {
        "title": "Semantic-Informed Driver Fuzzing Without Both the Hardware Devices and the Emulators",
        "abstract": "设备驱动程序是安全关键的。在像Linux这样的内核中，有数十万个驱动程序与核心内核在相同的特权级别上运行。因此，驱动程序中的一个错误可能会危及整个系统的安全。更为严重的是，驱动程序特别容易出现错误。首先，驱动程序不仅接收来自用户空间的复杂而不可信的输入，还接收来自硬件的输入。其次，驱动程序的代码可能由经验不足的第三方开发，并且由于运行驱动程序需要相应的硬件设备或仿真器，因此测试较少。因此，现有的研究表明，驱动程序往往具有更高的错误密度，并且已经成为主要的安全威胁。现有的测试技术必须将模糊测试集中在有相应设备或仿真器的有限数量的驱动程序上，因此无法扩展。\n\n在本文中，我们提出了一种不需要硬件设备进行模糊测试的驱动程序模糊系统DR. FUZZ。DR. FUZZ的核心是一种语义信息驱动的机制，它能够有效地生成输入以正确构建相关的数据结构，通过驱动程序初始化的“验证链”，从而实现无需设备的驱动程序模糊测试。不需要硬件设备和仿真器消除了驱动程序测试中的瓶颈。语义信息驱动的机制采用了多种新技术，使得无需设备的驱动程序模糊测试变得实用：推断初始化过程中通过验证链的有效输入值，推断输入字节的时间使用顺序以最小化变异空间，并利用错误状态作为反馈来指导模糊测试通过验证链。此外，语义信息驱动的机制是通用的；我们还可以指示它生成半格式错误的输入以实现更高的代码覆盖率。\n\n我们在214个Linux驱动程序上评估了DR. FUZZ。在仅有24小时的时间预算内，DR. FUZZ能够成功初始化和启用大多数驱动程序，而像syzkaller这样的现有模糊器在任何情况下都无法成功。DR. FUZZ还在其他方面显著优于即使配备设备或仿真器的现有驱动程序模糊器：它将代码覆盖率提高了70％，吞吐量提高了18％。通过DR. FUZZ，我们还发现了46个新的Linux驱动程序中的错误。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Keys and Authentication\\F-PKI：Enabling Innovation and Trust Flexibility in the HTTPS Public-Key Infrastructure.pdf": {
        "title": "F-PKI：Enabling Innovation and Trust Flexibility in the HTTPS Public-Key Infrastructure",
        "abstract": "我们提出了F-PKI，这是HTTPS公钥基础设施（或Web PKI）的一种增强，为客户端和域名所有者提供了信任灵活性，并使认证机构（CAs）能够执行更强的安全措施。在今天的Web PKI中，所有的CAs都被同等信任，安全性由最薄弱的环节决定。我们通过引入信任灵活性来解决这个问题：通过F-PKI，每个域名所有者可以定义一个域名策略（例如指定哪些CAs有权为其域名发行证书），每个客户端可以基于信任级别设置或选择验证策略。因此，F-PKI支持了当今互联网急需的一种特性：信任异质性。不同的参与方可以表达不同的信任偏好，同时仍能够验证所有的证书。相比之下，当今的Web PKI只允许客户端完全不信任可疑/行为不端的CAs，这很可能导致合法证书被拒绝造成副作用。我们的贡献是提出了一个向后兼容的系统，为客户端和域名所有者提供了合理的安全性属性，确保了所有证书的可验证性，并防止了降级攻击。此外，F-PKI为创新提供了一个基础，因为它给予CAs部署新的安全措施以吸引更多客户的动力，而不会受到易受攻击的CAs的破坏。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Keys and Authentication\\Let's Authenticate：Automated Certificates for User Authentication.pdf": {
        "title": "Let's Authenticate：Automated Certificates for User Authentication",
        "abstract": "—密码有许多缺点，因此许多系统被设计来替代它们。密码替代方案通常由于平衡可用性、可部署性和安全性的复杂性而未能取代密码。然而，尽管缺乏成功，最近密码管理器和FIDO2的进展为探索替代密码的系统设计提供了新机会。在这项工作中，我们探索了基于证书的用户认证系统的可行性。我们不是开发新的密码学技术，而是开发了一个名为Let's Authenticate的新系统，它结合了密码管理器、FIDO2和证书的元素。我们的设计结合了对397名参与者的调查反馈，以了解他们对系统功能的偏好。Let's Authenticate向用户提供保护隐私的证书，自动管理他们的凭据，并消除对第三方的信任。我们提供了详细的安全和隐私分析、开销分析，并使用一个众所周知的框架对该系统与各种替代方案进行了系统比较。我们讨论了Let's Authenticate与其他系统的比较，从我们的设计中学到的经验教训，以及与身份验证数据的集中管理相关的问题。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Keys and Authentication\\Transparency Dictionaries with Succinct Proofs of Correct Operation.pdf": {
        "title": "Transparency Dictionaries with Succinct Proofs of Correct Operation",
        "abstract": "本文介绍了Verdict，一个透明度字典，其中一个不受信任的服务维护着一个标签-值映射表，客户端可以查询和更新（为端到端加密和其他应用提供基础设施）。为了防止未经授权的字典修改，例如通过恶意或被入侵的服务提供商，Verdict生成可以公开验证的加密证明，证明它正确执行读取和授权更新。与先前的工作相比，Verdict的一个重要进展是在产生高效可验证证明的同时，产生了适度的证明开销。Verdict通过将索引Merkle树（一种新的SNARK友好的数据结构）与Phalanx（一种新的SNARK，支持摊销恒定大小的证明，并利用特定的工作负载特征加快证明速度）进行组合来实现这一点。我们的实验评估表明，Verdict可以扩展到具有数百万个标签的字典，同时对服务和客户端施加适度的开销。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\ML and AI #1\\DeepSight：Mitigating Backdoor Attacks in Federated Learning Through Deep Model Inspection.pdf": {
        "title": "DeepSight：Mitigating Backdoor Attacks in Federated Learning Through Deep Model Inspection",
        "abstract": "联邦学习（FL）允许多个客户端在不泄露数据的情况下协同训练神经网络（NN）模型。最近，针对FL的几种有针对性的毒化攻击被引入。这些攻击将后门注入到生成的模型中，使得对手控制的输入被错误分类。现有的对抗后门攻击的对策效率低下，通常只是排除与聚合不符的模型。然而，这种方法也会移除具有偏离数据分布的客户端的良性模型，导致聚合模型在这些客户端上表现不佳。\n\n为了解决这个问题，我们提出了DeepSight，一种新颖的模型过滤方法来减轻后门攻击。它基于三个新颖的技术，可以刻画用于训练模型更新的数据分布，同时寻求衡量NN的内部结构和输出的细微差异。利用这些技术，DeepSight可以识别可疑的模型更新。我们还开发了一个能够准确聚类模型更新的方案。将两个组件的结果结合起来，DeepSight能够识别并消除包含高攻击影响的被毒化模型的模型集群。我们还展示了使用现有的基于权重剪裁的防御方法可以有效减轻可能未被检测到的被毒化模型的后门贡献。我们评估了DeepSight的性能和有效性，并展示它可以在对良性数据的模型性能几乎没有影响的情况下减轻最先进的后门攻击。\n\n关键词-深度学习（DL），联邦学习（FL），毒化，后门，模型检查"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\ML and AI #1\\Local and Central Differential Privacy for Robustness and Privacy in Federated Learning.pdf": {
        "title": "Local and Central Differential Privacy for Robustness and Privacy in Federated Learning",
        "abstract": "联邦学习（FL）允许多个参与者通过保持他们的本地数据集并仅交换模型更新来共同训练机器学习模型。然而，这种方法并不一定能够免受隐私和鲁棒性漏洞的影响，例如成员身份攻击、属性攻击和后门攻击。本文研究了在FL中是否以及在多大程度上可以使用差分隐私（DP）来保护隐私和鲁棒性。为此，我们首次评估了本地差分隐私（LDP）和中央差分隐私（CDP）技术在FL中的可行性和有效性。\n\n我们的实验表明，尽管在保护-效用权衡方面存在不同水平的差异，但两种差分隐私变体都能够有效防御后门攻击，并且比其他鲁棒性防御方法更为有效。差分隐私还可以减轻FL中的白盒成员推断攻击，我们的工作是首次在实证上证明了这一点。然而，无论是LDP还是CDP，都无法防御属性推断攻击。总的来说，我们的工作提供了一种全面的、可重复使用的测量方法，用于量化差分隐私FL中鲁棒性/隐私和效用之间的权衡。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\ML and AI #1\\MIRROR：Model Inversion for Deep LearningNetwork with High Fidelity.pdf": {
        "title": "MIRROR：Model Inversion for Deep LearningNetwork with High Fidelity",
        "abstract": "模型反演是从给定模型中反向工程输入样本，因此对信息机密性构成严重威胁。我们提出了一种基于StyleGAN的新颖反演技术，其生成器具有特殊的架构，强制将输入分解为不同粒度的样式，以便模型能够在训练中分别学习它们。在样本生成过程中，生成器将潜在值转换为控制这些样式的参数，以组成一个样本。在我们的反演中，给定一个要反演的目标标签（例如，基于私人面部的身份识别模型），我们的技术利用在同一领域的公共数据（例如，公共人脸数据集）上训练的StyleGAN，结合梯度下降或遗传搜索算法，以及基于分布的剪辑，找到适当的样式参数化，使生成的样本能够被目标标签（由主题模型）正确分类并被人类识别。结果显示，我们的反演样本具有高度的保真度，大大优于现有最先进技术的样本。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\ML and AI #1\\Tetrad：Actively Secure 4PC for Secure Training and Inference.pdf": {
        "title": "Tetrad：Actively Secure 4PC for Secure Training and Inference",
        "abstract": "将算术和布尔电路混合以进行隐私保护的机器学习变得越来越受欢迎。为此，我们提出了一个适用于最多具有一个主动腐败的四方案例的框架，称为Tetrad。 Tetrad基于环运算，并支持两个级别的安全性，即公平性和鲁棒性。公平乘法协议的成本为5个环元素，相比最先进的Trident（Chaudhari等人，NDSS’20）有所改进。 Tetrad的一个关键特点是，在公平协议上，鲁棒性是免费的。在两种变体中的其他亮点包括（a）无额外开销的概率截断，（b）多输入乘法协议，以及（c）在计算领域之间切换的转换协议，以及量身定制的混淆电路方法。我们对Tetrad在LeNet和VGG16等深度神经网络上进行了训练和推理的基准测试。我们发现Tetrad在机器学习训练中的速度高达原来的4倍，而在机器学习推理中的速度高达原来的5倍。从部署成本的角度来看，Tetrad也是轻量级的，成本比Trident低多达6倍。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\ML and AI #2\\Euler：Detecting Network Lateral Movement via Scalable Temporal Graph Link Prediction.pdf": {
        "title": "Euler：Detecting Network Lateral Movement via Scalable Temporal Graph Link Prediction",
        "abstract": "侧向移动是高级持续性威胁使用的系统入侵的关键阶段。检测它并不是一项简单的任务。当网络主机日志被抽象为离散的时间图时，问题可以重新定义为在不断演化的网络中进行异常边缘检测。现代深度图学习技术的研究已经产生了许多创造性和复杂的模型用于解决这个问题。然而，正如在许多机器学习领域一样，模型的普适性对于训练和推断的准确性和可扩展性至关重要。在本文中，我们提出了一种正式的方法来解决这个问题，我们称之为 EULER 框架。它由一个不依赖于特定模型的图神经网络和一个不依赖于特定模型的序列编码层（如循环神经网络）堆叠而成。按照 EULER 框架构建的模型可以轻松地将它们的图卷积层分布到多台机器上，以获得更好的性能提升。此外，我们证明基于 EULER 的模型在异常链路检测和预测方面与许多最先进的方法相竞争，甚至更好。作为基于异常的入侵检测系统，EULER 模型可以高效地识别实体之间的异常连接，并且在异常侧向移动检测方面优于其他无监督技术。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\ML and AI #2\\FedCRI：Federated Mobile Cyber-Risk Intelligence.pdf": {
        "title": "FedCRI：Federated Mobile Cyber-Risk Intelligence",
        "abstract": "在普及数字化的当今时代，越来越多的服务变得可以在线上提供，而这一点在冠状病毒大流行的背景下被进一步加强。快速增长的移动服务市场为移动服务生态系统带来了新的攻击面。因此，移动服务提供商面临着各种挑战，需要保护他们的服务，尤其是相关的移动应用程序。然而，应用程序的防御通常仅限于（轻量级）应用程序级别的保护，如应用程序加固、监控和入侵检测。因此，有效的风险管理对于限制移动服务面临的威胁和攻击造成的潜在损害至关重要。\n\n在本文中，我们提出了一种名为FedCRI的解决方案，用于共享网络风险情报（CRI）。FedCRI的核心是将移动网络风险转化为机器学习（ML）模型，并利用基于ML的风险管理来评估移动设备上的安全风险。FedCRI利用联邦学习（FL）实现了可行动的基于ML的CRI知识的快速自主共享。FL允许不同移动服务提供商共同训练有效的风险检测模型，同时保护各个组织的训练数据的隐私。我们在代表不同欧洲国家的九个不同服务提供商提供的几个真实用户数据库上对我们的方法进行了广泛评估。这些数据集在金融服务、支付和保险领域收集了六年的数据，涵盖了2380万名用户，自Android 4和iOS 6以来提供了安全关键的移动应用程序。我们的方法可以成功提取准确的CRI模型，从而能够有效地识别移动设备上的网络安全风险。我们的评估结果显示，联邦风险检测模型在大多数风险分类任务中可以达到超过99%的准确率（以F1分数衡量），同时误报率非常低。\n\n关键词-网络风险情报（CRI），联邦学习（FL），网络威胁情报（CTI），移动平台"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\ML and AI #2\\Fooling the Eyes of Autonomous Vehicles：Robust Physical Adversarial Examples Against Traffic Sign Recognition Systems.pdf": {
        "title": "Fooling the Eyes of Autonomous Vehicles：Robust Physical Adversarial Examples Against Traffic Sign Recognition Systems",
        "abstract": "对抗性样本（AEs）可以欺骗深度神经网络（DNNs），最近受到了广泛关注。然而，大多数对抗性样本的研究都是在数字领域进行的，而且对抗性贴片是静态的。这种研究与许多真实世界的DNN应用（如自动驾驶车辆中的交通标志识别系统）非常不同。在交通标志识别系统中，目标检测器使用DNNs实时处理流媒体视频。从目标检测器的角度来看，交通标志的位置和视频的质量不断变化，使得数字对抗性样本在物理世界中失效。\n在本文中，我们提出了一个系统化的流程来生成针对真实世界目标检测器的强健物理对抗性样本。强健性通过三种方式实现。首先，我们通过扩展图像变换的分布，使用模糊变换和分辨率变换模拟车内摄像头。其次，我们设计了单个和多个边界框过滤器，以提高扰动训练的效率。第三，我们考虑了四种代表性的攻击向量，即隐藏攻击（HA）、外观攻击（AA）、非目标攻击（NTA）和目标攻击（TA）。对于每种攻击向量，定义了一个损失函数，以最小化制造过程对物理对抗性样本的影响。\n我们在不同的环境条件下进行了一系列全面的实验，通过改变距离从0米到30米，将角度从-60度到60度，并考虑阳光明媚和多云天气以及夜晚的照明。实验结果表明，我们通过流程生成的物理对抗性样本在攻击基于YOLO v5的交通标志识别系统时是有效且强健的。这些攻击具有良好的可转移性，并且可以欺骗其他最先进的目标检测器。我们在一辆全新的2021年车型上发起了HA和NTA攻击。这两种攻击都成功地欺骗了交通标志识别系统，对于自动驾驶车辆来说可能是一种威胁生命的情况。最后，我们讨论了基于图像预处理、对抗性样本检测和模型增强的三种防御机制。\n"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\ML and AI #2\\What You See is Not What the Network Infers：Detecting Adversarial Examples Based on Semantic Contradiction.pdf": {
        "title": "What You See is Not What the Network Infers：Detecting Adversarial Examples Based on Semantic Contradiction",
        "abstract": "对抗性样本（AEs）对于深度神经网络（DNNs）在安全关键领域（例如自动驾驶）的应用构成严重威胁。虽然已经有大量的AE防御解决方案，但据我们所知，它们都存在一些弱点，例如只能防御部分AEs或者对合法输入造成相对较高的准确率损失。此外，大多数现有解决方案无法防御适应性攻击，即攻击者了解防御机制并相应地制作AEs。\n\n在本文中，我们提出了一种基于AEs本质的新型AE检测框架，即它们的语义信息与目标DNN模型提取的判别特征不一致。具体而言，所提出的解决方案名为ContraNet，通过首先将输入和推理结果输入生成器来获得合成输出，然后将其与原始输入进行比较来建模这种矛盾。对于正确推断的合法输入，合成输出试图重构输入。相反，对于AEs，合成输出会尽可能地符合错误的标签，而不是重构输入。因此，通过使用度量学习来衡量输入和合成输出之间的距离，我们可以区分AEs和合法输入。我们在各种AE攻击场景下进行了全面评估，实验结果表明ContraNet在很大程度上优于现有解决方案，尤其是在适应性攻击下。此外，我们的分析表明，能够绕过ContraNet的成功AEs往往具有较弱的对抗性语义。我们还展示了ContraNet可以轻松与对抗性训练技术相结合，以实现进一步改进的AE防御能力。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Network Protocols\\HeadStart：Efficiently Verifiable and Low-Latency Participatory Randomness Generation at Scale.pdf": {
        "title": "HeadStart：Efficiently Verifiable and Low-Latency Participatory Randomness Generation at Scale",
        "abstract": "通过公众参与生成随机性允许参与者直接贡献随机性并验证结果的安全性。理想情况下，参与这种活动的难度应尽可能低，以减少成为贡献者的计算负担。然而，由于可扩展性或可用性问题，现有的随机性生成协议不适用于这种情况。因此，本文介绍了HeadStart，一种针对大规模公众参与设计的参与性随机性协议。HeadStart允许贡献者在普通设备上高效地验证结果，并提供一个参数L，可以将结果发布的延迟降低L倍。此外，我们提出了两种实现改进，以进一步加快验证速度并减小证明大小。对于持续时间为T的贡献阶段，HeadStart的验证复杂度仅为O(L * polylog(T) + log C)，其中T是时间，C是贡献次数。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Network Protocols\\PMTUD is not Panacea：Revisiting IP Fragmentation Attacks against TCP.pdf": {
        "title": "PMTUD is not Panacea：Revisiting IP Fragmentation Attacks against TCP",
        "abstract": "有一种普遍的观点认为TCP不容易受到IP分片攻击，因为TCP在默认情况下执行路径最大传输单元发现（PMTUD）机制，该机制可以通过动态匹配TCP分段的最大大小和从发起者到目的地的路径的最大传输单元（MTU）来避免IP分片。然而，本文揭示了事实上TCP确实容易受到IP分片攻击，这与常见的观点相反。\n\n我们对IP分片和TCP之间的复杂互动进行了系统研究，并发现了两种情况下即使发起者执行了PMTUD，TCP分段仍然可能触发IP分片。首先，当中间路由器的下一跳MTU小于发起者可接受的最小路径MTU时，路由器会对发起者的TCP分段进行分片。其次，当由于恶意构造的ICMP错误消息导致IP层和TCP层之间的发起者路径MTU值不同步时，发起者可能被欺骗分片TCP分段。一旦TCP分段上的IP分片可能被错误触发，攻击者就可以在成功解决预测IPID和欺骗TCP校验和的实际问题后，将伪造的分片注入到受害者连接中，以破坏目标TCP流量。我们对HTTP和BGP的案例研究证明了通过IP分片来感染基于TCP的应用程序的可行性和有效性。我们还进行了全面评估，以显示我们的攻击在现实世界中可能造成严重的破坏。最后，我们提出了减轻TCP分段上恶意IP分片并击败攻击的对策。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Network Protocols\\ROV-MI：Large-Scale, Accurate and Efficient Measurement of ROV Deployment.pdf": {
        "title": "ROV-MI：Large-Scale, Accurate and Efficient Measurement of ROV Deployment",
        "abstract": "保护互联网的域间路由系统免受非法前缀通告一直是研究人员和网络运营商的重要关注点。在许多BGP（边界网关协议）安全增强机制未能广泛部署的情况下，可以看到RPKI（资源公钥基础设施）的部署正在全球范围内逐渐增加，这是令人鼓舞的。为了更深入地了解RPKI的影响，许多研究致力于测量RPKI的部署情况，包括ROA（路由起源授权）和ROV（路由起源验证）的部署情况。与可以直接从RPKI存储库中的数据推导出ROA部署的测量不同，ROV部署的测量需要更复杂的测量和推断技术。然而，现有的工作测量范围有限，并且推断方法要么不准确，要么效率低下。\n\n在本文中，我们提出了一个新的框架ROV-MI，用于测量ROV的部署情况，它包括一个由现实世界中RPKI无效前缀驱动的大规模测量基础设施，用于探测数据平面中这些无效更新的过滤，并且基于贝叶斯推断技术的高效准确的推断算法。我们实现了ROV-MI来测量实际世界中的ROV部署情况，并将其与之前的工作进行了比较，结果显示ROV-MI可以准确推断出比当前最先进的方法少20%的执行时间下约10倍的AS（自治系统）的ROV采用情况。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Network Protocols\\Subverting Stateful Firewalls with Protocol States.pdf": {
        "title": "Subverting Stateful Firewalls with Protocol States",
        "abstract": "我们分析了多个TCP/IP网络堆栈实现中协议头字段的生成，并发现了泄漏全局协议状态信息的新方法。然后，我们通过这些协议字段远程观察和修改系统的全局状态，展示了新的隐秘通道。与以往的研究不同，我们的研究重点放在了位于防火墙网络中的主机上（包括源地址验证-SA V），这是现在非常常见的情况。我们的攻击设计是非破坏性的-在数据泄漏场景中，这使得攻击更加隐秘，从而延长了攻击的持久性；在主机别名解析和类似技术的情况下-这确保了技术的道德性。我们重点研究了ICMP和UDP，ICMP通常由防火墙提供，而UDP预计会随着HTTP/3和QUIC的出现在互联网流量中占据更重要的份额，尽管我们也报告了TCP的结果。\n我们发现的信息泄漏场景使得可以构建实际的隐秘通道，直接穿透防火墙，或者通过位于防火墙网络中同时使用SA V的主机间接建立通信。在这个背景下，我们描述并测试了三种新的攻击：通过防火墙本身进行数据泄漏，通过DMZ主机进行数据泄漏，以及通过共存容器进行数据泄漏。这些都是绕过防火墙的通用的隐秘通道用例，使得不被允许直接与互联网通信的设备仍然能够将数据从网络中泄漏出去。换句话说，我们从隔离的网络中向互联网泄漏数据。我们还解释了如何利用新的信息泄漏技术进行已知攻击，如主机别名解析、去网络地址转换和容器共存检测。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Privacy and Anonymity\\Clarion：Anonymous Communication from Multiparty Shuffling Protocols.pdf": {
        "title": "Clarion：Anonymous Communication from Multiparty Shuffling Protocols",
        "abstract": "本文研究了多方洗牌协议在实现更高效的元数据隐藏通信中的作用。我们展示了通过让服务器协同洗牌和验证消息的秘密份额，而不是使用传统的混合网络方法，可以加速消息洗牌的过程。我们将这种技术应用于匿名广播和消息系统中，实现了实际和渐进的改进。首先，我们展示了如何构建一个三个服务器匿名广播方案，对抗一个恶意服务器，只依赖对称加密。接下来，我们将我们的三个服务器广播方案改进为对抗k-1个恶意服务器的k服务器方案，代价是更昂贵的每次洗牌预处理阶段。最后，我们展示了我们的方案如何显著改善MCMix匿名消息系统的性能。\n\n我们在一个名为Clarion的系统中实现了我们的洗牌协议，并发现它在广播小消息时优于由一系列可验证（单服务器）洗牌组成的混合网络，性能提升了9.2倍，并且在MCMix对话协议上的性能提升了11.8倍。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Privacy and Anonymity\\DRAWN APART：A Device Identification Technique based on Remote GPU Fingerprinting.pdf": {
        "title": "DRAWN APART：A Device Identification Technique based on Remote GPU Fingerprinting",
        "abstract": "浏览器指纹识别旨在通过在用户浏览器中执行的脚本来识别用户或其设备，并收集有关软件或硬件特征的信息。它用于跟踪用户或作为一种附加手段来提高安全性。指纹识别技术有一个显著的限制：它们无法长时间跟踪个别用户。这是因为浏览器指纹会随时间演变，这些演变最终会导致与共享类似硬件和软件的其他设备的指纹混淆。\n\n在本文中，我们报告了一种新技术，可以显著延长基于指纹的跟踪方法的跟踪时间。我们称之为DRAWN APART的技术是一种新的GPU指纹识别技术，它通过其GPU堆栈的独特属性来识别设备。具体来说，我们展示了由GPU组成的多个执行单元之间速度的变化可以作为可靠和强大的设备签名，可以使用非特权JavaScript来收集。\n\n我们在两种情况下研究了DRAWN APART的准确性。在第一个情景中，我们的受控实验证实了该技术在区分具有相似硬件和软件配置的设备方面的有效性，即使它们被当前最先进的指纹识别算法认为是相同的。在第二种情况下，我们将我们的一次性学习版本的技术集成到最先进的浏览器指纹跟踪算法中。我们通过一个大规模实验验证了我们的技术，该实验涉及在几个月的时间里从超过2500个众包设备收集的数据，并且显示与最先进的方法相比，它提供了高达67%的中位跟踪持续时间提升。\n\nDRAWN APART对浏览器指纹识别的现状做出了两方面的贡献。在概念上，它是首个探索相同GPU之间制造差异的工作，并且是第一个在隐私环境中利用这些差异的工作。在实际方面，它展示了一种强大的技术，可以区分具有相同硬件和软件配置的机器，这种技术在实际环境中提供了实际的准确性提升。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Privacy and Anonymity\\hbACSS：How to Robustly Share Many Secrets.pdf": {
        "title": "hbACSS：How to Robustly Share Many Secrets",
        "abstract": "尽管近年来在实现多方计算（MPC）方面取得了重大进展，但目前没有任何现有的MPC库能够提供完全的鲁棒性，这意味着在具有间歇性延迟的网络中能够保证输出的传递，包括离线阶段。重要的是，已经有几种理论上的MPC构造在这种情况下确保了鲁棒性。我们观察到，理论与实践之间的差距的关键原因是缺乏高效的可验证/完备的秘密分享（VSS/CSS）构造；现有的CSS协议要么需要在实践中具有挑战性的广播通道，要么引入计算和通信开销，其至少是参与者数量的平方量级。\n\n本文提出了hbACSS，一个拥有最佳容错性的异步完备秘密分享协议套件，其计算和通信开销在（准）线性范围内。为了开发hbACSS，我们开发了hbPolyCommit，这是一个高效的多项式承诺方案，其计算和通信开销在（多项式次数）的计算和通信开销方面是（准）线性的，而不需要可信设置。我们实现了hbACSS协议，对其实用性进行了广泛分析，并观察到我们的协议在参与方数量增加时具有良好的可扩展性。特别地，我们使用hbACSS来生成MPC输入掩码：这是一个在实践中之前只能非鲁棒地计算的有用原语。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Privacy and Anonymity\\VPNInspector：Systematic Investigation of the VPN Ecosystem.pdf": {
        "title": "VPNInspector：Systematic Investigation of the VPN Ecosystem",
        "abstract": "由于公众对在线隐私和安全风险的意识增强，虚拟专用网络（VPN）的使用迅速增长。这种增长推动了VPN生态系统扩展为一个价值数十亿美元的行业，并不断涌现出新的VPN供应商。然而，VPN生态系统仍然受到严重研究不足的困扰，目前有关VPN的研究受限于繁琐的手动过程。需要一种解决方案，使研究人员和普通用户能够调查他们的VPN供应商。\n\n在这项工作中，我们提出了VPNalyzer，这是一个系统，可以对VPN生态系统进行系统化、半自动化的调查。我们开发了一个跨平台的工具，其中包含15个测量测试，测试服务、安全和隐私要点、错误配置和泄漏等方面。使用VPNalyzer工具，我们对80个桌面VPN进行了最大规模的调查。\n\n我们的调查揭示了一些以前未报告的发现，突出了VPN生态系统中的关键问题和实现不足之处。我们发现在26个VPN提供商中，在隧道故障期间存在流量泄露的证据，这严重危及敏感用户数据的曝光风险。我们是第一个测量和检测隧道故障期间的DNS泄漏的研究者，在八个提供商中观察到了这种情况。总体而言，我们发现大多数供应商缺乏IPv6支持，甚至有五个供应商将IPv6流量泄露给用户的ISP。我们观察到，VPN供应商对我们认为的安全和隐私要点的采用不是均衡的。多个供应商共享基础设施，29个供应商使用第三方公共DNS服务。令人担忧的是，10个VPN提供商甚至在最安全的配置下泄露流量，其中六个在启用“断开开关”功能时仍然泄露数据。我们的结果突显了VPNalyzer在发现问题方面的有效性，即使是最受欢迎的VPN供应商也不例外。消费者报告机构在为用户创建数据驱动的建议时使用了VPNalyzer。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Run-time Defenses\\Building Embedded Systems Like It's 1996.pdf": {
        "title": "Building Embedded Systems Like It's 1996",
        "abstract": "嵌入式设备无处不在。然而，初步证据显示，保护我们的桌面/服务器/手机的攻击缓解措施在嵌入式设备中缺失，对嵌入式安全构成了重大威胁。为此，本文对嵌入式设备上普遍采用的攻击缓解措施进行了深入研究。具体而言，本文测量了超过10,000个基于Linux的已部署嵌入式设备固件中针对内存破坏的标准缓解措施的存在情况。研究表明，嵌入式设备在用户空间和内核级别的攻击缓解措施上大多被省略。嵌入式设备的采用率比桌面设备低多倍。同样重要的观察是，情况并没有随着时间的推移而改善。如果不改变当前的做法，攻击缓解措施将继续缺失，在即将到来的物联网时代可能会成为更大的威胁。通过后续分析，我们进一步推断了一些可能导致缺乏攻击缓解措施的因素。其中一些例子包括大规模重用未受保护软件、过时内核的升级滞后以及自动构建工具的限制。我们预计这些洞察将成为改善嵌入式设备上攻击缓解措施采用情况的启示。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Run-time Defenses\\CFInsight：A Comprehensive Metric for CFI Policies.pdf": {
        "title": "CFInsight：A Comprehensive Metric for CFI Policies",
        "abstract": "软件漏洞是计算机安全的主要威胁之一，过去几十年已经造成了巨大的损害。因此，提出了许多技术来减轻易受攻击的程序的风险。其中最相关的防御机制之一是控制流完整性 (CFI)：已经引入了多种变体，并在学术界广泛讨论和在工业界部署。然而，很难比较这些实现的安全保证，因为现有的度量标准（如AIR）没有考虑到不同基本块对攻击者的不同有用性，而基本块是构成任何应用程序代码的基本组成部分。\n\n本文介绍了BLOCK INSULATION和CFGI NSULATION，这是两种新颖的度量标准，旨在通过模拟攻击者在遍历程序控制流图时对基本块的有用性来克服这一限制。此外，我们提出了一种新的CFI策略生成器，名为NumCFI，它与现有的策略生成器正交，并防止攻击者从易受攻击的代码快捷方式到系统调用指令。我们使用BLOCK INSULATION、CFGI NSULATION和现有的度量标准评估了NumCFI以及其他几个CFI策略生成器。最后，我们描述了L+TCFI，我们的实现将NumCFI和现有的基于标签的策略结合起来，性能开销仅为1.27%。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Run-time Defenses\\Chosen-Instruction Attack Against Commercial Code Virtualization Obfuscators.pdf": {
        "title": "Chosen-Instruction Attack Against Commercial Code Virtualization Obfuscators",
        "abstract": "代码虚拟化是一种众所周知的复杂混淆技术，它使用自定义虚拟机（VM）来模拟原始本机指令的语义。商业虚拟机（VM）混淆器（例如Themida和VMProtect）经常被恶意软件开发人员滥用以隐藏恶意行为。由于商业混淆器的内部机制是一个黑盒子，分析员很难理解虚拟化程序的行为。为了了解代码虚拟化机制并设计反混淆技术，分析员必须对大规模高度混淆的程序进行逆向工程。这种知识学习过程成本高且不准确。\n\n在这个项目中，我们研究如何通过一种新颖的选择指令攻击（CIA）技术从商业虚拟机（VM）混淆器中自动提取知识。我们的想法受到选择明文攻击的启发，后者是一种密码分析攻击模型，用于获取降低加密方案安全性的信息。给定一个商业虚拟机（VM）混淆器，我们精心构造输入程序，主动与混淆器进行交互，并从虚拟化输出程序中提取知识。我们提出使用锚指令和引导简化技术，分别从输出程序中高效定位和提取与知识相关的指令。我们的实验结果表明，现代商业虚拟机（VM）混淆器受到选择指令攻击（CIA）的威胁。我们已经发现了760个锚指令，并从四个最广泛使用的商业混淆器中提取了1915个经过验证的指令映射规则。提取的知识使安全分析人员能够了解虚拟化恶意软件并改进反混淆技术。此外，我们还为系统评估反混淆技术贡献了第一个细粒度基准套件。评估结果显示，现代商业虚拟机（VM）混淆器对于三种最先进的反混淆技术来说是不足够的，而我们提取的知识可以改进这些技术。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Run-time Defenses\\The Taming of the Stack：Isolating Stack Data from Memory Errors.pdf": {
        "title": "The Taming of the Stack：Isolating Stack Data from Memory Errors",
        "abstract": "尽管有大量关于保护堆栈对象免受内存错误利用的研究，但仍然存在大量堆栈数据风险。从历史上看，堆栈防御主要关注保护代码指针，如返回地址，但是新兴的利用内存错误的技术促使我们需要实际解决方案来保护堆栈数据对象。然而，最近的方法未能全面考虑内存错误，并且不必要地限制了可以保护的对象集。在本文中，我们介绍了DATAGUARD系统，该系统可以静态地识别哪些堆栈对象在空间、类型和时间上是安全的，以便高效地保护这些对象。DATAGUARD通过更全面和准确的安全分析提高了安全性，证明了更多的堆栈对象不会受到内存错误的影响，同时确保没有不安全的堆栈对象被错误地分类为安全。对服务器程序和SPEC CPU2006基准套件进行的DATAGUARD分析表明，DATAGUARD通过以下方式提高了安全性：（1）确保任何被分类为安全的堆栈对象都不会发生内存安全违规，从而移除了Safe Stack方法先前分类为安全的6.3％堆栈对象；（2）阻止了CGC二进制文件中的所有118个堆栈漏洞的利用。DATAGUARD通过将Safe Stack方法先前分类为不安全的70％以上的堆栈对象标记为安全，从而扩展了堆栈保护的范围，平均而言，有91.45％的所有堆栈对象只能被安全引用。通过识别更多仅具有安全堆栈对象的函数，DATAGUARD将使用Clang的Safe Stack防御来保护SPEC CPU2006基准测试的开销从11.3％降低到4.3％。因此，DATAGUARD表明，全面而准确的分析可以增加堆栈数据保护的范围并减少开销。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Secure Computing\\Binary Search in Secure Computation.pdf": {
        "title": "Binary Search in Secure Computation",
        "abstract": "二分查找是计算机科学中最流行的算法之一。然而，在要求数据无感知执行的安全多方计算环境中实现它是非常困难的。以前只有使用无感知RAM（ORAM）进行安全计算才能实现它，在本研究中，我们开始研究基于秘密共享的传统安全计算技术在这个问题上的应用。我们开发了一套具有不同特性和结构的协议，用于通过私有数值密钥搜索包含m个元素的私有数据集。我们的协议使用基于秘密共享的标准和现成的操作，通信复杂度为O(m)和O(pm)。我们进一步扩展我们的协议以支持写操作，即无感知更新所选元素的二分查找，并实现了两个变体：更新非关键字段和更新关键字段。我们的实施结果表明，即使在最快的ORAM构造中应用已知的和我们自己的优化措施后，我们的解决方案在多达230个元素的数据集上比优化的ORAM方案快两个数量级。我们希望这项工作能够引起对这个重要问题的进一步关注和寻求高效的实现方法。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Secure Computing\\Chunked-Cache：On-Demand and Scalable Cache Isolation for Security Architectures.pdf": {
        "title": "Chunked-Cache：On-Demand and Scalable Cache Isolation for Security Architectures",
        "abstract": "多核处理器中共享缓存资源容易受到缓存侧信道攻击的威胁。最近提出的防御措施，如将地址随机映射到缓存行或采用已知的缓存分区方法，都有自己的局限性：基于随机化的防御措施已被证明对新的攻击算法易受攻击，而且依赖于弱密码学原语。它们并没有从根本上解决缓存侧信道攻击的根本原因，即不信任代码共享缓存资源。缓存分区防御提供了有效阻止所有侧信道威胁所需的严格资源分区。然而，它们通常依赖于基于路的分区，这种分区不够细粒度，并且无法扩展以支持更多的保护域，例如可信执行环境（TEE）安全架构，此外还会降低性能并经常导致缓存未充分利用。\n为了克服这两种方法的缺点，我们提出了一种新颖且灵活的用于TEE架构的集合关联缓存分区设计，称为CHUNKED-CACHE。 CHUNKED-CACHE的核心思想是，如果执行需要侧信道鲁棒性，它可以使执行上下文“切割”出一个独占的可配置缓存块。如果不需要侧信道鲁棒性，主流缓存资源可以自由利用。因此，我们提出的缓存设计通过启用有效的选择性和按需利用侧信道鲁棒缓存，实际上解决了安全性和性能之间的权衡问题，同时提供了可靠的未来安全保证。我们展示了CHUNKED-CACHE为敏感代码执行提供了侧信道鲁棒的缓存利用，硬件开销小，在操作系统上没有性能开销。我们还展示了它比传统的基于路的缓存分区性能提高了43％，并且在支持更多的保护域方面具有更好的可扩展性。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Secure Computing\\Hybrid Trust Multi-party Computation with Trusted Execution Environment.pdf": {
        "title": "Hybrid Trust Multi-party Computation with Trusted Execution Environment",
        "abstract": "可信执行环境（TEE），如Intel SGX，依赖于硬件保护，可以比纯软件解决方案更高效地进行安全的多方计算（MPC）。然而，当前的实现中发现了多种侧信道攻击，导致不同方之间存在各种信任级别。例如，一方可能认为对手无法破坏TEE，而另一方可能只对TEE有部分信任，甚至完全不信任。在由具有不同信任级别的方组成的MPC场景中，可以回退到纯软件解决方案。虽然满足了所有方的安全需求，但接受TEE的人将无法享受其带来的好处。\n\n本文通过提出一种名为H YBRTC的通用框架，研究了上述情景，该框架可以以混合信任方式评估一个函数。我们在通用可组合性（UC）中给出了安全形式化，并引入了一种针对类似TEE的硬件的新的密码模型，称为多面信任硬件（FTH），该模型捕捉了不同方所感知到的各种信任级别。为了证明混合设置的相关性，我们提供了一个分布式数据库场景，其中一个用户完全或部分信任不同的TEE来保护她的分布式查询，而多个服务器拒绝使用TEE来保护其敏感数据库。我们提出了一种在多方设置下针对典型的选择和连接查询的恶意安全协议。实验结果表明，在具有220条数据集记录的两个服务器上，并且选择了四分之一的记录，仅需165.82秒，相比于加密解决方案，实现了超过18,752:58倍的加速。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Secure Computing\\SynthCT：Towards Portable Constant-Time Code.pdf": {
        "title": "SynthCT：Towards Portable Constant-Time Code",
        "abstract": "最近的攻击表明现代微架构存在微架构侧信道问题。恒定时间（CT）编程是一种软件开发方法论，程序被精心编写以避免这些信道。简而言之，该方法的思想是只将秘密数据传递给安全指令，即执行这些指令不会产生与操作数无关的硬件资源使用。\n\n然而，目前的CT编程实践存在重大的安全和性能问题。CT代码只编写和编译一次，但可能在多个不同的微架构上执行。然而，哪些指令是安全的还是不安全的，根本上是一个微架构特定的问题。新的微架构优化（或漏洞）可能会改变安全指令集并破坏CT的保证。\n\n在这项工作中，我们开发了SYNTH CT来解决上述问题。给定一个安全/不安全指令的规范，SYNTH CT可以自动合成ISA中所有不安全指令的翻译，只使用安全指令集中的指令。这些合成的翻译可以作为后期编译器的一部分，为特定的微架构生成加固的二进制文件。这样可以通过针对每个微架构单独制定规范和安全翻译来关闭安全漏洞。这也允许CT代码在特定微架构上恢复一些性能，例如在被认为是安全的情况下使用更复杂/性能更高的指令。\n\n使用SYNTH CT中开发的技术，我们能够为大多数x86 64 ISA合成翻译。具体而言，SYNTH CT可以仅使用ISA的剩余25%来生成ISA的75%的安全翻译。有趣的是，SYNTH CT无法为大多数无法合成翻译的指令生成翻译，而这些指令是专家们认为在当今的x86 64微架构上是安全指令的。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Smartphones\\GhostTalk：Interactive Attack on Smartphone Voice System Through Power Line.pdf": {
        "title": "GhostTalk：Interactive Attack on Smartphone Voice System Through Power Line",
        "abstract": "不可闻声音命令注入是对语音助手最具威胁的攻击之一。现有的攻击旨在通过空中注入攻击信号，但它们需要访问授权用户的声音以激活语音助手。此外，这些攻击在嘈杂的环境中的有效性可能会大大降低。在本文中，我们探讨了一种新类型的信道，即电力线侧信道，用于发动不可闻的语音命令注入。通过通过修改的充电线将音频信号注入到电力线上，攻击可以更具弹性，可以应对各种环境因素和活体检测模型。同时，可以通过修改的电缆窃听智能手机的音频输出，实现高度交互式攻击。\n为了利用电力线侧信道，我们提出了GhostTalk，这是一种新型的隐藏语音攻击，能够同时注入和窃听。通过快速修改移动电源电缆，攻击者可以远程发起电话呼叫或从语音助手中捕获私人信息，从而发动交互式攻击。GhostTalk通过偷偷触发开关组件以模拟头戴式耳机上的按键，克服了绕过说话者验证系统的挑战。在智能手机通过未经修改的标准电缆充电时，我们发现通过监视电力线上的充电电流，可以从智能手机扬声器中恢复音频信号。为了证明可行性，我们设计了GhostTalk-SC，这是一个针对公共USB端口中充电的智能手机的自适应窃听系统。为了正确识别音频中的私人信息，GhostTalk-SC仔细提取音频谱，并集成了一个神经网络模型来分类言语中的数字。\n我们对9款主流商品智能手机发动了GhostTalk和GhostTalk-SC攻击。实验结果证明，GhostTalk可以以100%的成功率向不同的智能手机注入未经授权的语音命令，并且注入的音频可以欺骗人耳和多个活体检测模型。此外，GhostTalk-SC在平均识别不同智能手机上言语中的数字方面达到了92%的准确率，使其成为一种易于部署但高度有效的攻击，可以渗透敏感信息，如密码和验证码。对于防御，我们提供了防御这种新威胁的对策建议。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Smartphones\\PHYjacking：Physical Input Hijacking for Zero-Permission Authorization Attacks on Android.pdf": {
        "title": "PHYjacking：Physical Input Hijacking for Zero-Permission Authorization Attacks on Android",
        "abstract": "如今，大多数移动设备都配备了各种硬件接口，例如触摸屏、指纹扫描仪、摄像头和麦克风，用于捕捉用户的输入。许多移动应用程序使用这些物理接口来接收用户输入，用于身份验证/授权操作，包括一键登录、基于指纹的支付批准以及面部/语音解锁。在本文中，我们调查了所谓的PHYjacking攻击，即通过一个零权限的恶意应用程序误导受害者向移动设备上的不同硬件接口输入物理输入，从而导致意外的授权。我们分析了Android对不同类型物理输入接口的保护机制，并引入了绕过它们的新技术。具体而言，我们发现了现有系统API的保护方案存在的弱点，并观察到应用程序在实现基于物理输入的授权时常见的问题。更糟糕的是，我们发现了Android中的一种竞争条件错误，即使应用程序级的缓解措施被正确实施，也可以利用这个错误。基于这些发现，我们介绍了指纹劫持和面部劫持技术，并展示了它们对真实应用程序的影响。我们还讨论了对NFC和麦克风输入发起类似攻击的可行性，以及对单点登录应用程序发起有效的窃听攻击。我们设计了一个静态分析器来检查3000多个真实世界的应用程序，发现其中44%的应用程序存在与PHYjacking相关的实现缺陷。我们通过概念验证实现展示了PHYjacking的实用性和潜在影响，这使得在一个拥有超过8亿用户的支付应用程序上进行未经授权的资金转移成为可能，从一个拥有超过4亿用户的社交媒体应用程序中泄露用户隐私，并在Android 11中升级应用程序权限。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Smartphones\\The Droid is in the Details：Environment-aware Evasion of Android Sandboxes.pdf": {
        "title": "The Droid is in the Details：Environment-aware Evasion of Android Sandboxes",
        "abstract": "恶意软件沙箱长期以来一直是检测和分析恶意软件的有价值工具。移动设备的普及和移动应用的发展导致了移动设备沙箱的开发和使用激增，以确保应用市场的完整性。为了逃避这些沙箱，恶意软件已经进化到在沙箱环境中执行时暂停其恶意活动。复杂的恶意软件沙箱试图通过修补与恶意软件分析系统相关的运行时属性来防止沙箱检测。\n\n在本文中，我们提出了一组新颖的移动沙箱逃避技术，统称为“环境感知”沙箱检测。我们通过探索从现成的API中提取的工件分布来区分真实用户设备和沙箱。为此，我们确定了可以用于提取与环境相关特征的Android API，例如用户配置的工件（例如屏幕亮度），设备上的文件数量（例如照片和歌曲数量）以及硬件传感器（例如步数计数器的存在）。\n\n通过收集来自真实用户和Android沙箱的真实数据，我们展示了攻击者可以轻松地构建一个分类器，能够以98.54%的准确率区分真实的Android设备和知名的移动沙箱。此外，为了展示在沙箱环境中独立修补API的无效性，我们重点关注了沙箱的声称制造商（三星、LG等）与这些制造商的真实设备之间的特征不一致性。我们的研究结果强调了创建强大的沙箱环境的困难，无论其基础平台是模拟环境还是实际移动设备。最重要的是，我们的工作表明，最先进的移动沙箱对于“环境感知”沙箱检测的保护不足，这可以被移动恶意软件轻易地滥用以逃避检测并延长其寿命。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Smartphones\\Uncovering Cross-Context Inconsistent Access Control Enforcement in Android.pdf": {
        "title": "Uncovering Cross-Context Inconsistent Access Control Enforcement in Android",
        "abstract": "由于庞大的代码库和Android的多上下文特性导致了复杂性，Android存在不一致的访问控制执行，恶意软件可以利用这一点绕过访问控制并执行未经授权的安全敏感操作。不幸的是，现有的研究只关注于Android的Java上下文中不一致的访问控制执行。在本文中，我们首次对Android的Java上下文和本地上下文中的不一致访问控制执行进行了系统调查。特别地，为了自动发现跨上下文的不一致性，我们设计并实现了一种新工具IAceFinder，该工具提取并对比了在Android的Java上下文和本地上下文中强制执行的访问控制。将IAceFinder应用于14个开源Android ROM，我们发现它能有效地揭示它们的跨上下文的不一致访问控制执行。具体而言，IAceFinder发现了23个可以被攻击者利用来威胁设备并侵犯用户隐私的不一致性。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Software Components and Interactions\\COOPER：Testing the Binding Code of Scripting Languages with Cooperative Mutation.pdf": {
        "title": "COOPER：Testing the Binding Code of Scripting Languages with Cooperative Mutation",
        "abstract": "像JavaScript这样的脚本语言被集成到商业软件中，以支持简单的文件修改。例如，Adobe Acrobat接受JavaScript来动态操作PDF文件。为了弥合高级脚本和低级语言（如C/C++）之间的差距，需要一个绑定层来传输数据和转换表示。然而，由于两个方面的复杂性，绑定代码容易出现不一致的语义和安全漏洞，从而导致严重的漏洞。现有的绑定代码测试工作仅关注于脚本方面，并且错过了需要特殊程序本地输入的错误。在本文中，我们提出了合作变异(cooperative mutation)的概念，它修改脚本代码和程序本地输入以触发绑定代码中的错误。我们的观点是，许多错误是由于程序初始状态和动态操作之间的相互作用引起的，这些错误只能通过二维变异来触发。我们开发了三种新技术，以实现对流行脚本语言的实际合作变异：首先，我们将对象聚类为语义相似的类，以减少本地输入的变异空间；然后，我们基于大量的执行结果统计推断脚本代码和对象类之间的关系；最后，我们使用推断的关系来选择适当的对象和相关的脚本代码进行有针对性的变异。我们将我们的工具C OOPER 应用于集成脚本语言的三个流行系统，包括Adobe Acrobat、Foxit Reader和Microsoft Word。C OOPER 成功发现了134个以前未知的错误。我们已将所有错误报告给开发人员。在发表论文时，已修复了59个错误，其中33个已分配CVE编号。我们总共获得了22,000美元的奖励，用于报告的17个错误中的其中17个。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Software Components and Interactions\\Cross-Language Attacks.pdf": {
        "title": "Cross-Language Attacks",
        "abstract": "多年来，针对C/C++等不安全编程语言的内存破坏攻击一直是计算机系统的主要威胁。各种消毒剂和运行时利用缓解技术只能提供部分保护。最近开发出的诸如Rust和Go之类的“安全”编程语言承诺通过使用强类型系统和适当的编译时和运行时检查来防止内存破坏错误。逐步部署这些语言被宣传为在整个应用程序可以用安全语言开发之前提高现有应用程序的安全性的一种方式。这在流行应用程序如Firefox和Tor中尤为显著。在本文中，我们系统地分析了多语言应用程序的安全性。我们表明，因为安全语言中的语言安全检查和应用于不安全语言的利用缓解技术（例如，控制流完整性）破坏了攻击的不同阶段以防止控制劫持攻击，攻击者可以在不同语言之间谨慎操纵以发动成功的攻击。本质上，我们说明了各种语言所做的不兼容的假设集使得攻击在单独的每种语言中都是不可能的。我们研究了这些攻击的不同变体，并分析了Firefox以说明这个问题的可行性和程度。我们的研究结果表明，如果没有极端谨慎地进行逐步部署安全编程语言，实际上可能对安全性产生负面影响。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Software Components and Interactions\\D-Box：DMA-enabled Compartmentalization for Embedded Applications.pdf": {
        "title": "D-Box：DMA-enabled Compartmentalization for Embedded Applications",
        "abstract": "嵌入式和物联网（IoT）设备在许多领域中得到了广泛应用。这些设备的安全性非常重要，因为它们经常用于控制关键基础设施、医疗设备和车辆。现有的隔离微控制器（MCU）资源以增强安全性的解决方案面临着诸多挑战，如特定硬件不可用性、内存保护单元（MPU）的限制以及严重缺乏直接内存访问（DMA）支持。然而，DMA对于嵌入式应用的功耗和性能要求是至关重要的。\n\n在本文中，我们提出了D-Box，一种系统化的方法，通过使用实时操作系统（RTOS）来实现嵌入式应用的隔离解决方案，以实现安全的DMA操作。D-Box定义了一个参考架构和工作流程，以全面保护DMA操作。它提供了实用的方法来强化内核，并定义基于能力的安全策略，以便轻松定义具有强大安全性的DMA操作。我们在流行的FreeRTOS-MPU（F-MPU）之上为Cortex-M3/M4实现了一个D-Box原型。与标准的F-MPU相比，D-Box程序和更严格的安全模型使得DMA操作暴露的ROP（返回导向编程）小工具减少了41倍。D-Box仅增加了2%的处理器开销，同时将外设操作基准的功耗降低了18.2%。D-Box的安全性和性能经过了一个可编程逻辑控制器（PLC）应用的实际案例研究的测试和确认。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Software Components and Interactions\\Preventing Kernel Hacks with HAKCs.pdf": {
        "title": "Preventing Kernel Hacks with HAKCs",
        "abstract": "由于实际和历史原因，商品操作系统内核仍然是单块的。所有内核代码共享一个地址空间，在提升的处理器权限下执行，并且可以大部分无障碍地访问所有数据，包括与完成特定任务无关的数据。应用最小特权原则，限制可用资源仅限于执行特定任务所需的资源，对内核进行区分化将实现重大安全收益，类似于微内核，但无需进行重大重新设计。在这里，我们介绍一种称为硬件辅助内核区分化（HAKC）的区分化设计，该设计近似于最小特权分离，同时最大程度地减少开发人员的工作量和性能开销。HAKC将代码和数据分割成单独的分区，并为每个分区指定访问策略。数据由单个分区拥有，分区的访问控制策略在运行时执行，防止未经授权的数据访问。当一个分区需要将控制流传递到外部时，数据所有权被转移到目标，返回时再转移回来。HAKC设计允许将代码和数据与内核的其余部分隔离开来，在区分化代码执行时不使用任何额外的可信计算基础。相反，HAKC依赖硬件进行执行。\n\n可加载内核模块（LKMs）是动态加载内核代码和数据以提供专门功能的Linux源代码库中最大的部分。不幸的是，它们的总体大小和复杂性使得LKMs成为Linux内核发布的大部分CVE的原因。内核模块的大攻击面和Linux内核的单块设计使得LKMs成为区分化的理想候选。为了证明我们的方法的有效性，我们使用Arm v8.5-A ISA的扩展在Linux v5.10中实现了HAKC，并将包含超过55k LOC的ipv6.ko LKM进行了区分化。在Apachebench测试中，平均开销仅为1.6%至24%。此外，我们对nf_tables.ko数据包过滤LKM进行了区分化，并测量同时使用两个区分化LKMs的综合影响。当使用两个区分化LKMs时，开销呈合理的线性增长。最后，在Alexa排名前50的网站上进行实际的网络浏览实验时，使用区分化的ipv6.ko LKM与未修改的LKM相比，性能没有显著差异。\n\n发布说明A。已获得公开发行批准。分发无限制。本资料基于美国国防部研究与工程副部长根据美国空军合同号FA8702-15-D-0001的支持进行的工作。本资料中表达的任何观点、发现、结论或建议均为作者个人观点，不一定反映美国国防部研究与工程副部长的观点。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Special Problems and Use Cases\\FakeGuard：Exploring Haptic Response to Mitigate the Vulnerability in Commercial Fingerprint Anti-Spoofing.pdf": {
        "title": "FakeGuard：Exploring Haptic Response to Mitigate the Vulnerability in Commercial Fingerprint Anti-Spoofing",
        "abstract": "如何防御通过人工假手指进行的演示攻击是指纹生物识别中的一个核心挑战。安全性、可用性和生产成本之间的权衡驱使研究人员达成了一个共识，即将商用指纹技术与反欺诈检测（例如脊纹特征）集成在一起。这些反欺诈解决方案被认为在假手指无法与真实手指密切相关时具有足够的弹性，原因可能是欺诈材料的组成或非自动化制造误差。在本文中，我们首先确定了商用指纹产品中实践中反欺诈解决方案的漏洞。我们模拟了一个更真实的场景，攻击者使用低成本的聚乙烯醇酯材料制造高精度的假指纹。在此基础上，我们引入了一种实用且安全的对策，即FakeGuard，以克服这个暴露的漏洞。我们研究了指尖表皮与触觉表面相互作用时产生的3D触觉反应效应，并反映了真实和假指纹的不同解剖结构。与以前的缓解策略不同，FakeGuard与现有指纹扫描仪具有硬件和软件兼容性。作为基于触觉的反欺诈解决方案的首次探索，我们展示了FakeGuard防止已知和未知假手指攻击的能力，平均检测误差为1.4%。我们还检验并证明了FakeGuard对七种不同的物理攻击的弹性，例如通过压力变化或部分指纹进行暴力破解，通过高级欺诈材料或侧信道干扰进行触觉反应改变，以及通过操纵环境的湿度、照明和温度进行拒绝服务攻击。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Special Problems and Use Cases\\On Utility and Privacy in Synthetic Genomic Data.pdf": {
        "title": "On Utility and Privacy in Synthetic Genomic Data",
        "abstract": "基因组数据的可用性对于生物医学研究、个性化医学等方面的进展至关重要。然而，其极高的敏感性使得发布或共享成为问题，甚至完全不可能。因此，已经推出了几项试验性的倡议，例如使用生成模型来学习真实数据的基础分布，并生成保留其显著特征而不暴露真实数据的人工数据集。\n\n本文首次评估了六种最先进的生成合成基因组数据模型的效用和隐私保护。我们评估了合成数据在一些常见任务上的性能，如等位基因群体统计和连锁不平衡。然后，我们通过成员推断攻击的视角来衡量隐私，即推断一条记录是否是训练数据的一部分。我们的实验表明，没有一种单一方法生成的合成基因组数据在效用和隐私方面都表现出色。此外，训练数据集的大小和性质也很重要。而且，尽管某些数据集和模型的组合可以产生与真实数据分布接近的合成数据，但往往存在一些目标数据点容易受到成员推断攻击的情况。展望未来，我们的技术可以被从业者用来评估在实际中应用合成基因组数据的风险，并成为未来工作的基准。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Special Problems and Use Cases\\Privacy in Urban Sensing with Instrumented Fleets, Using Air Pollution Monitoring As A Usecase.pdf": {
        "title": "Privacy in Urban Sensing with Instrumented Fleets, Using Air Pollution Monitoring As A Usecase",
        "abstract": "提供打车共享、电子商务物流和食品配送等服务的公司，愿意为了扩大交通拥堵、行程时间、道路表面质量、空气质量等方面的测量，对其车辆进行仪器化。分析这些大型车队的细粒度传感器数据可能非常有益；然而，这些传感器信息会揭示部署车队的位置和车辆数量。这些敏感数据对于同一业务领域中的竞争对手公司具有很高的商业价值，例如，在打车共享领域中的Uber与Ola、Uber与Lyft之间的竞争，或者在电子商务领域中的Amazon与Alibaba之间的竞争。本文利用基于高斯过程回归(GPR)的插值、差分隐私(DP)和安全的两方计算(2PC)，为上述场景提供隐私保证。通过保护车队和客户隐私，同时保持客户实用性，我们可以提供仪器化车队的传感器数值。即使对于资源受限的移动客户端，我们的系统也具有高效的延迟和带宽开销。为了展示我们的端到端系统，我们构建了一个示例Android应用程序，以隐私保护的方式提供给定源-目的地对的最少污染路线选择。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Special Problems and Use Cases\\ProvTalk：Towards Interpretable Multi-level Provenance Analysis in Networking Functions Virtualization (NFV).pdf": {
        "title": "ProvTalk：Towards Interpretable Multi-level Provenance Analysis in Networking Functions Virtualization (NFV)",
        "abstract": "网络功能虚拟化（NFV）使得网络服务能够敏捷地部署在云平台之上。然而，由于NFV涉及多个层次的抽象来表示相同的组件，因此确定安全事件的根本原因可能变得具有挑战性。例如，安全事件可能在不同的层次被检测到，而其根本原因的操作可能在另一个层次进行，两者之间没有明显的联系。此外，现有的溯源分析技术可能会产生对于人类分析师来说过于庞大的结果，这是由于NFV本身的复杂性所导致的。在本文中，我们提出了ProvTalk，一种溯源分析系统，它处理了NFV独特的多层次特性，并帮助分析师确定安全事件的根本原因。具体而言，我们首先定义了一个多层次的溯源模型来捕捉NFV层次之间的依赖关系。接下来，我们通过三种新颖的技术，即多层次修剪、基于挖掘的聚集和基于规则的自然语言翻译，提高了解释性。我们在一个Tacker-OpenStack NFV平台上实现了ProvTalk，并基于真实世界的安全事件验证了其有效性。我们证明ProvTalk捕捉到了发给所有NFV服务的管理API调用，并通过显著减小溯源图的大小（通过多层次修剪方案减小约3.6倍，通过聚集方案减小两倍）产生了更具解释性的结果。我们的用户研究表明，ProvTalk通过生成更具解释性的结果，促进了真实用户的分析任务。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Web Security\\HARPO：Learning to Subvert Online Behavioral Advertising.pdf": {
        "title": "HARPO：Learning to Subvert Online Behavioral Advertising",
        "abstract": "在线行为广告及其相关的追踪工具对隐私构成了真正的威胁。不幸的是，现有的隐私增强工具并不总是有效地对抗在线广告和追踪。我们提出了HARPO，一种基于学习的原则方法，通过混淆来破坏在线行为广告。HARPO使用强化学习来自适应地交替真实页面访问和虚假页面，以扭曲追踪器对用户浏览配置文件的观点。我们评估了HARPO针对用于在线行为广告的真实用户配置文件和广告定位模型。结果显示，HARPO通过触发超过40%的错误兴趣分段和高出6个竞价值来提高隐私。与相同开销的现有混淆工具相比，HARPO的性能提高了多达16倍。HARPO还能比现有的混淆工具更好地实现对对手检测的隐蔽性。HARPO在利用混淆来破坏在线行为广告方面显著推进了最新技术的发展。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Web Security\\Probe the Proto：Measuring Client-Side Prototype Pollution Vulnerabilities of One Million Real-world Websites.pdf": {
        "title": "Probe the Proto：Measuring Client-Side Prototype Pollution Vulnerabilities of One Million Real-world Websites",
        "abstract": "原型污染是一种相对较新的JavaScript漏洞类型，允许对原型对象（例如Object.prototype）注入属性。注入的属性可能在其他敏感位置（如innerHTML）中被使用，从而导致跨站脚本攻击（XSS），或者在document.cookie中被使用，从而导致Cookie的篡改。之前的研究提出了使用静态分析来检测Node.js应用程序中的原型污染的方法。然而，目前尚不清楚客户端JavaScript中原型污染的普遍程度，更不用说原型污染可能导致的后果（例如XSS和Cookie篡改）了。\n\n在本文中，我们提出了PROBETHE PROTO，这是第一个对一百万个真实世界网站进行客户端原型污染的大规模测量研究。PROBETHE PROTO由两个重要部分组成：动态污点分析，它跟踪所谓的连接属性查询和赋值的联合污点流，以及输入/利用生成，它指导联合污点流进入与进一步后果相关的最终漏洞。PROBETHE PROTO回答了一个原型对象是否可控、是否可以操纵哪些属性以及注入的值是否会导致进一步的后果等问题。\n\n我们实现了PROBETHE PROTO的原型，并在一百万个网站上进行了评估。结果显示，包括前1000名中的十个网站在内，共有2738个真实世界网站存在2917个零日可利用的原型污染漏洞。我们验证了48个漏洞进一步导致XSS攻击，736个漏洞导致Cookie篡改，830个漏洞导致URL篡改。我们向网站维护者报告了所有发现的问题，目前已有185个易受攻击的网站已经修复了漏洞。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Web Security\\ScriptChecker：To Tame Third-party Script Execution With Task Capabilities.pdf": {
        "title": "ScriptChecker：To Tame Third-party Script Execution With Task Capabilities",
        "abstract": "我们提出了一种名为ScriptChecker的新型基于浏览器的框架，可以根据主机网页的指令有效且高效地限制第三方脚本的执行。ScriptChecker与所有现有的在JavaScript层面上运行的方案不同，它全面利用上下文分离和浏览器的安全监控机制，在执行不受信任代码时实施按需访问控制。主机页面可以在任务创建时灵活地分配资源访问能力给任务。通过利用任务能力方法的好处，ScriptChecker在安全性、可用性和性能方面超过了现有技术。我们在Chrome上实现了ScriptChecker的原型，并通过对前1000个网站的实证研究对其安全性进行了严格评估，共检测了1373个恶意脚本，并对其可用性进行了评估。实验结果表明，它在安全性和易用性方面具有强大的优势，并且性能损失不明显。在进行DOM访问时，它只引入大约0.2微秒的额外开销，加载流行的JS图形和实用程序库时只会延迟5%。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Web Security\\Testability Tarpits：the Impact of Code Patterns on the Security Testing of Web Applications.pdf": {
        "title": "Testability Tarpits：the Impact of Code Patterns on the Security Testing of Web Applications",
        "abstract": "虽然静态应用程序安全测试工具（SAST）有许多已知的限制，但编码风格对它们发现漏洞的能力的影响仍然大部分未被探索。为了填补这一空白，本研究中我们尝试了商业和开源安全扫描工具的组合，并编制了一个包含270多种不同代码模式的列表，当这些模式存在时，会阻碍先进工具分析PHP和JavaScript代码的能力。通过在软件开发生命周期中发现这些模式的存在，我们的方法可以向开发人员提供有关其代码可测试性的重要反馈。它还可以帮助他们更好地评估即使静态分析工具报告未发现漏洞，代码仍可能包含漏洞的剩余风险。最后，我们的方法还可以指出替换代码的替代方法，以增加其对SAST的可测试性。我们的实验表明，可测试性陷阱非常普遍。例如，一个普通的PHP应用程序中包含超过21个这样的陷阱，即使是最好的静态分析工具在遇到其中之一之前也无法分析超过20条连续的指令。为了评估模式转换对静态分析结果的影响，我们尝试了手动和自动的代码转换，旨在用更可测试的代码替换一部分模式。这些转换使现有工具能够更好地理解和分析应用程序，并导致在48个项目中检测到440个新的潜在漏洞。我们负责地公开了所有这些问题：31个项目已经回复，并确认了182个漏洞。在这些已确认的问题中，由于应用程序代码可测试性差，以前未知的问题有38个影响流行的Github项目（>1k星），例如PHP Dzzoffice（3.3k）、JS Docsify（19k）和JS Apexcharts（11k）。已经发布了25个CVE，我们还有其他正在进行中。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Wireless\\Packet-Level Open-World App Fingerprinting on Wireless Traffic.pdf": {
        "title": "Packet-Level Open-World App Fingerprinting on Wireless Traffic",
        "abstract": "移动应用程序在不同方面深刻地改变了现代生活方式。人们自然而然地对移动应用程序的隐私风险提出了几个关切。尽管加密通信很普遍，但应用程序指纹识别（AF）攻击仍对用户的在线隐私构成严重威胁。然而，现有的AF攻击通常受到四个具有挑战性的问题的限制，即隐藏目的地、不可见边界、应用程序多路复用和开放世界识别，当它们应用于无线流量时。没有任何现有的AF攻击能够解决所有这些挑战。在本文中，我们提出了一种新颖的AF攻击，称为P ACKET PRINT，通过提出两个新模型，即顺序XGBoost和分层词袋模型，来识别与感兴趣的应用程序相关的用户活动，并解决上述挑战。我们进行了大量实验来评估所提出的攻击在一系列具有挑战性的场景下的表现，包括开放世界设置、数据包丢失和网络拥塞、同时使用不同应用程序以及跨数据集识别。实验结果表明，P ACKET PRINT能够准确识别与感兴趣的应用程序相关的用户活动。它在开放世界应用程序识别方面的平均F1分数为0.884，而在应用程序内用户操作识别方面的平均F1分数为0.959。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Wireless\\SemperFi：Anti-spoofing GPS Receiver for UAVs.pdf": {
        "title": "SemperFi：Anti-spoofing GPS Receiver for UAVs",
        "abstract": "众所周知，GPS容易受到信号欺骗攻击。尽管存在一些欺骗检测技术，但它们无法对抗隐蔽攻击并进行恢复。在这项工作中，我们提出了SemperFi，这是一个单天线GPS接收器，能够追踪合法的GPS卫星信号并在面对强大对手时估算真实位置。我们的设计利用了绝大多数无人机上内置的基于扩展卡尔曼滤波器的GPS失效机制，以及一个自定义设计的合法信号恢复模块，用于检测和自动从大多数欺骗攻击中恢复。我们开发了算法，精心合成恢复信号，并扩展了连续干扰消除技术，以保留合法信号的到达时间，同时消除攻击者的信号。对于能够隐蔽和无缝接管的强大对手，SemperFi利用短期惯性传感器的稳定性进行简短的机动操作，并识别隐蔽的欺骗攻击。我们在GNSS-SDR中实现了SemperFi，这是一个开源软件定义的GNSS接收器，并使用UA V模拟器、真实无人机、各种真实世界的GPS数据集以及各种嵌入式平台评估了其性能。我们的评估结果表明，在许多场景中，SemperFi可以通过执行不到100米的飞行模式来识别对手的峰值，并在0.54秒内恢复真实位置（Jetson Xavier）。我们展示了我们的接收器对于利用惯性传感器误差并执行无缝接管攻击的幼稚和隐蔽欺骗者是安全的。此外，我们将SemperFi设计为可插拔模块，能够生成一个无欺骗的GPS信号，供当今任何商用GPS接收器进行处理。最后，我们将我们的实现发布给社区以供使用和进一步研究。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Wireless\\SpiralSpy：Exploring a Stealthy and Practical Covert Channel to Attack Air-gapped Computing Devices via mmWave Sensing.pdf": {
        "title": "SpiralSpy：Exploring a Stealthy and Practical Covert Channel to Attack Air-gapped Computing Devices via mmWave Sensing",
        "abstract": "隐蔽通道是一种用于从计算设备中泄露信息并突破计算机系统安全政策的通信方法。任何共享资源都有潜在的隐蔽通道利用可能，而传统的网络安全智慧认为与互联网断开连接的空气隔离计算设备是高度安全的。最近的研究表明，使用声学、热学和电磁效应的高级隐蔽通道攻击只能在有限的接近限制下发挥作用（例如，2米之内）。在这项工作中，我们介绍了一种名为SpiralSpy的新型隐蔽通道，通过毫米波（mmWave）感测技术攻击空气隔离的计算设备。SpiralSpy可以在实际距离（最长达8米）上悄然启动并绕过严格隔离的计算设备。具体而言，我们证明了普通的冷却风扇可以用于隐蔽通道攻击。空气隔离计算设备内的恶意软件可以明显地将机密数据编码到风扇控制信号中，并且风扇运动的调制状态可以通过一种普通的mmWave传感器远程解码。SpiralSpy可以应用于多风扇系统，并实现多通道和高速信息传输的可扩展容量。我们使用71台带有冷却风扇的计算设备对SpiralSpy进行评估。实验结果表明，SpiralSpy可以达到每秒6比特的传输速度，比现有的空气隔离计算设备上的隐蔽通道快6-24倍。我们在不同的现实场景下评估了SpiralSpy的可用性和鲁棒性。此外，我们对基于SpiralSpy的隐蔽通道攻击的对策进行了深入分析和讨论，以提高计算机和信息安全。"
    },
    "\\\\NAS\\Library\\Papers\\NDSS\\2022(29th)\\Wireless\\V-Range：Enabling Secure Ranging in 5G Wireless Networks.pdf": {
        "title": "V-Range：Enabling Secure Ranging in 5G Wireless Networks",
        "abstract": "预计许多安全和安全关键应用程序，如资产跟踪、智能生态系统、自动驾驶车辆和驾驶员辅助功能等，都将从5G提供的位置信息中受益。为了支持这种广泛的定位感知服务和应用，当前的5G版本将距离和定位作为5G技术的一个组成部分进行探索。近年来，已经展示了对定位和距离测量系统的许多攻击，因此构建对距离和位置操纵攻击具有弹性的5G系统至关重要。无论是3GPP还是研究界，都没有现有的提案来解决5G中安全位置估计的挑战。在本文中，我们开发了V-Range，这是第一个完全兼容5G标准并可以直接在现有的5G-NR收发器上实现的安全测距系统。我们设计了V-Range系统，可以执行对抗距离扩大和缩小攻击的安全测距操作。我们通过实验证实，V-Range在精度高、延迟低且可以在5G的次6GHz和毫米波频段中运行。我们的结果显示，攻击者在没有被高概率检测到的情况下，不能将距离减小或增加超过系统的不精确度。"
    }
}