{
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1A：Infrastructure security\\Red Team vs. Blue Team：A Real-World Hardware Trojan Detection Case Study Across Four Modern CMOS Technology Generations.pdf": {
        "title": "Red Team vs. Blue Team：A Real-World Hardware Trojan Detection Case Study Across Four Modern CMOS Technology Generations",
        "abstract": "验证集成电路(ICs)中恶意插入的木马的缺失是一项关键任务，特别是对于启用安全功能的产品而言。(验证恶意木马缺失的重要性，特别是对于启用安全功能的产品而言。)根据具体的威胁模型，可以应用不同的技术来实现这一目的。假设原始IC布局是良性的，并且没有后门，主要的安全威胁通常被认定为外包制造和运输过程中的安全威胁。为了确保委托芯片中没有木马，一个直接的解决方案是将接收到的半导体器件与最初提交给晶圆厂的设计文件进行比较。显然，进行这样的比较需要先进的实验室设备和合格的专家。尽管如此，现在已经很好地理解了需要对硅布局进行明显更改才能检测到木马的基本技术。尽管如此，公开描述整个过程并公开可用的基础数据集的案例研究明显缺乏。在这项工作中，我们旨在通过提供一个基于四种不同数字IC的公开的和开放的硬件木马检测案例研究来改进这一技术的现状。在这里，红队通过在90纳米、65纳米、40纳米和28纳米IC的布局中创建作为插入的木马代理的小改变。蓝队的任务是通过GDSII与SEM图像的比较来检测数字布局和制造设备之间的所有差异。蓝队能有效地完成这个任务吗？我们的结果对于寻找木马的人士带来了乐观，并回答了关于这种技术对相关IC尺寸的效率的常见问题。此外，它们还可以得出关于技术规模对检测性能的影响的结论。(通过公开的和开放的硬件木马检测案例研究，我们旨在改进当前的技术水平。红队通过在不同数字IC的布局中创建代表插入木马的小改变，蓝队的任务是通过GDSII与SEM图像的比较来检测数字布局和制造设备之间的所有差异。我们的结果对于寻找木马的人士带来了乐观，并回答了关于这种技术对相关IC尺寸的效率的常见问题。此外，它们还可以得出关于技术规模对检测性能的影响的结论。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1A：Infrastructure security\\Scaphy：Detecting Modern ICS Attacks by Correlating Behaviors in SCADA and PHYsical.pdf": {
        "title": "Scaphy：Detecting Modern ICS Attacks by Correlating Behaviors in SCADA and PHYsical",
        "abstract": "现代工业控制系统（ICS）攻击通过利用对ICS过程的了解，将它们的活动与良性的监控和数据采集（SCADA）操作相融合，造成了实际世界的物理损害。我们提出了S CAPHY来通过利用SCADA的独特执行阶段来检测SCADA中的ICS攻击，以识别在不同阶段控制物理世界的有限行为集，这与攻击者的活动有所区别。例如，SCADA通常在初始化过程中设置ICS设备对象，但在过程控制过程中则是异常行为。为了提取SCADA执行阶段的独特行为，S CAPHY首先利用开放的ICS约定生成一个新的物理过程依赖和影响图（PDIG），以识别破坏性的物理状态。然后，S CAPHY使用PDIG来进行物理过程感知的动态分析，通过诱导SCADA过程控制执行的代码路径来揭示与合法过程控制阶段独特的API调用行为。利用这种建立的行为，S CAPHY有选择地监控违反合法过程控制行为的攻击者的物理世界目标活动。我们在美国一个国家实验室的ICS测试环境中评估了S CAPHY。使用了4个ICS行业的多样化部署场景和攻击，S CAPHY达到了95%的准确率和3.5%的误报率（FP），相比之下，现有工作的准确率为47.5%，误报率为25%。我们分析了S CAPHY对攻击者了解我们方法的抵御能力。\n\n与信息技术（IT）攻击不同，工业控制系统（ICS）攻击会对依赖于生命的物理过程（如电力和供水）造成实际损害。ICS过程由运行特殊程序来控制物理世界的监控和数据采集（SCADA）主机控制。现代ICS攻击是从SCADA发起的，攻击者利用合法的ICS资源将其活动与良性的SCADA操作相融合，并发送恶意信号来干扰过程。为了检测ICS攻击，对ICS流量的统计分析对于噪声行为（如网络扫描和格式错误的协议）是有效的，但对于使用合法协议和ICS参数知识来引起有针对性（而非噪声）破坏的现代攻击则会被规避。此外，物理模型通过监视传感器来了解观察到的物理状态与预期状态的偏差，通过将历史传感器数据拟合到线性模型中来实现。然而，实践中发现，这样的模型可能需要专家来构建，并且详细的过程模型可能不可用。此外，由于噪声和配置更改，物理模型在部署到生产环境时会触发误报，导致模型之外出现良性状态。总的来说，现有的ICS工具被现代攻击所规避，并容易产生误报，因为它们在孤立地分析流量/传感器数据，因此无法将其分析与SCADA中的攻击执行上下文联系起来。在SCADA中检测ICS攻击很困难，因为攻击者使用与良性SCADA程序相同的API调用行为。例如，导致乌克兰电网瘫痪的Industroyer恶意软件执行的恶意操作是正常SCADA活动的一部分，例如访问ICS设备对象。同样，2021年佛罗里达水污染事件[4]使用正常的人机界面（HMI）命令向供水中倾倒有毒化学物质。因此，现有的主机代理程序寻找“非SCADA”API将无法检测到它们。我们发现，虽然这些攻击行为是正常的SCADA活动，但在SCADA的非典型执行阶段中执行时是异常的。因此，在这项工作中，我们不再将SCADA视为一个整体的执行过程，而是将其行为专门化为独特的执行阶段，即初始化和过程控制。我们观察到，为了使Industroyer攻击起作用，攻击者必须执行在过程控制中非典型但攻击所需的API调用。例如，为了劫持ICS设备句柄，Industroyer在过程控制中执行了注册表设置API，这在初始化中是正常的，因此是异常的。在感染了SCADA之后，攻击者必须“设置/连接”他们的工具来攻击物理世界。这些攻击行为与SCADA的基于阶段的行为不一致，并导致错误阶段中的非典型API。因此，如果我们识别出有限的合法过程控制行为集，我们可以有选择地监视和检测违反这些行为的攻击者的物理目标活动。此外，由于SCADA会对物理世界的变化做出响应，我们可以通过刺激相关变化来诱导SCADA展现其过程控制行为。然而，这需要对ICS过程及其元素状态进行物理建模。有趣的是，我们发现可以利用ICS开放平台通信（OPC）约定来通过ICS元素配置来表征过程。然后，我们可以切换每个元素的状态来诱导SCADA展现其过程控制行为，从而使我们能够识别它们。此外，我们可以推导出这些状态变化的影响，以识别破坏性的过程状态。这可以使我们检测到由（改变状态的）控制信号引起的破坏性物理世界效果。我们提出了一种新的混合技术S CAPHY来通过将SCADA执行阶段特定行为与物理世界影响相关联来检测ICS攻击。S CAPHY识别每个SCADA执行阶段独特的API调用集，这些集合与这些阶段中的攻击者活动不同，使得S CAPHY能够检测到它们。为了表征SCADA用于控制物理世界的“所需”内部主机通道，我们引入了一个新的参考模型，SCADA 202023 IEEE安全与隐私研讨会（SP）©2023年，Moses Ike。在IEEE的许可下。DOI 10.1109/SP46215.2023.000212023 IEEE安全与隐私研讨会（SP）| 978-1-6654-9336-9/23/$3"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1A：Infrastructure security\\Shedding Light on Inconsistencies in Grid Cybersecurity：Disconnects and Recommendations.pdf": {
        "title": "Shedding Light on Inconsistencies in Grid Cybersecurity：Disconnects and Recommendations",
        "abstract": "—运营、学术和政策界对电网威胁的可能性和所导致的损害存在分歧。例如，对于MadIoT式攻击的可行性和影响正在积极讨论中。通过对电网专家（N=18）进行调查，我们发现这种分歧不仅存在于MadIoT攻击中，而且在多个经过深入研究的电网威胁中都存在。根据以往的研究和我们的调查，我们假设这些分歧源于电网威胁建模的不一致性。我们确定了五个可能导致建模不一致的原因：1）使用不切实际的电网拓扑，2）假设攻击者具有不切实际的能力，3）探索过少的电网情景，4）使用遗漏了相关电网过程的不完整模拟器，以及5）使用错误地对关键电网过程进行建模的模拟器。为了验证这些假设，我们创建了一个建模框架，并研究了这些因素如何改变我们对电网威胁的可行性和影响的理解。我们以四个不同的电网威胁作为案例研究：MadIoT、虚假数据注入攻击、变电站断路器接管和发电厂接管。我们发现，我们假设的每个建模不一致性的原因都对攻击的结果建模产生了显著影响。例如，我们发现在实际拓扑上，MadIoT攻击的可行性要小得多，并且需要更多高功率的物联网设备，而以前用于对其进行建模的拓扑则不然。相反，我们发现在紧急情况下，变电站断路器接管攻击更加可行，并且可能需要更少的变电站发生故障，而以前的建模则不是这样表明的。我们最后给出了准确评估电网威胁影响的可行建议。\n\n指标词—电网、网络安全、电网安全、计算机安全、工业控制系统。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\Detection of Inconsistencies in Privacy Practices of Browser Extensions.pdf": {
        "title": "Detection of Inconsistencies in Privacy Practices of Browser Extensions",
        "abstract": "-所有主要的网络浏览器都支持扩展来提供额外的功能，并增强用户的浏览体验，而这些扩展在用户的网络浏览过程中可以访问和收集用户的数据。尽管网络扩展通过多种形式的通知向用户告知它们的数据处理方式，但之前的研究忽视了实际数据处理方式与浏览器扩展发布的隐私通知之间的重要差距。为了填补这一差距，我们提出了ExtPrivA，它可以自动检测浏览器扩展的数据收集与隐私披露之间的不一致性。从隐私政策和仪表盘披露中，ExtPrivA提取隐私声明，以清楚解释扩展的隐私实践。它模拟用户交互以触发扩展的功能，并分析网络请求的发起者，以准确提取扩展从浏览器传输到外部服务器的用户数据。我们的端到端评估结果显示，ExtPrivA可以以85%的准确性检测隐私披露与数据收集行为之间的不一致性。在对Chrome Web Store上的47.2k个扩展进行的大规模研究中，我们发现有820个扩展的1,290个流与其隐私声明不一致。更糟糕的是，我们发现360个扩展的仪表盘披露和隐私政策中存在525对相互矛盾的隐私声明。这些隐私披露与实际数据收集行为之间的不一致被视为商店政策的严重违规行为。我们的发现突显了浏览器扩展的隐私披露中的重要问题，这些问题可能误导，甚至对最终用户造成严重的隐私风险。\n\nI. 引言\n虽然网络浏览器扩展被广泛用于扩展功能和丰富用户体验，但它们对用户的隐私构成重大风险。数十亿的网络浏览器用户可以通过扩展商店轻松安装免费扩展。由于它们与网络浏览器集成，扩展可以收集高度敏感的数据，如个人身份信息（PII）和用户输入到网页中的任何内容。这些类型的数据可以被扩展本身收集，也可以被传输给不需要/不知名/未经授权的第三方。主要的扩展商店对扩展的隐私实践有严格的要求，以减少用户的隐私风险。例如，Chrome Web Store要求扩展通过开发者仪表盘和隐私政策提供隐私实践披露。隐私政策是自由格式的文件，而仪表盘披露基于一个在商店上所有扩展之间共享的通用模板。图1展示了一个Chrome扩展的仪表盘隐私披露的示例。\n\n不同形式的隐私披露和扩展的行为之间的不一致性是对商店开发者计划政策的严重违规。由于“不一致”要求，即使数据收集是为了潜在的良性目的，如果收集的数据在政策中没有披露，仍然可能违反扩展的隐私政策。例如，如果一个扩展声称不收集或使用用户数据，那么即使扩展仅在调试和产品分析目的上收集用户的位置和按键记录，它也将违反隐私披露。之前的研究在扩展的执行行为和隐私政策之间的不一致性方面大都忽视了这一问题。由于缺乏/无法确定数据传输的合法性，之前的无政策检测技术只能分析常见的恶意用户数据泄露。例如，它们只能检测明显的恶意行为（如卸载其他扩展）或检查隐私泄露是意外还是故意的。我们的主要问题是：我们能否自动检测浏览器扩展的实际数据收集与其声明的隐私实践之间的不一致性？我们提出了一种名为ExtPrivA的端到端系统，它可以提取声明的隐私实践并对扩展的数据收集行为进行详细分析。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\RuleKeeper：GDPR-Aware Personal Data Compliance for Web Frameworks.pdf": {
        "title": "RuleKeeper：GDPR-Aware Personal Data Compliance for Web Frameworks",
        "abstract": "-受到现有法规（如欧盟GDPR）的压力，在线服务必须广告个人数据保护政策，声明收集个人数据的类型和目的，并且必须严格按照用户的同意决定执行。然而，由于缺乏系统级支持，获得对政策执行的强有力保证是困难的，这给软件漏洞和漏洞留下了机会，从而导致违反GDPR合规性的问题。\n\n我们提出了RuleKeeper，一个针对Web开发框架的GDPR感知个人数据政策合规系统。目前已经移植到MERN框架，RuleKeeper允许Web开发人员从中指定GDPR清单，从而自动生成Web应用的数据保护政策，并通过静态代码分析和运行时访问控制机制进行透明强制执行。GDPR合规性以横切方式进行检查，对应用程序代码的更改很少。我们使用原型实现对四个真实世界应用程序进行了RuleKeeper的评估。我们的系统可以建模真实的GDPR数据保护要求，对Web应用程序增加适度的性能开销，并可以检测GDPR违规错误。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\WebSpec：Towards Machine-Checked Analysis of Browser Security Mechanisms.pdf": {
        "title": "WebSpec：Towards Machine-Checked Analysis of Browser Security Mechanisms",
        "abstract": "—多年来，浏览器的复杂性不断增加，这是由于不断引入和更新Web平台组件，例如新的Web API和安全机制所驱动的。这些规范需要专家手动审核，以发现潜在的安全问题。然而，由于现代浏览器规范的广泛性和新旧Web平台组件之间的相互作用，这个过程已经被证明容易出错。为了解决这个问题，我们开发了WebSpec，这是用于分析浏览器安全机制的第一个形式化安全框架，它可以自动发现逻辑缺陷并开发机器检查的安全证明。WebSpec特别包括了Coq证明助手中浏览器的综合语义模型，以及这个模型中对十个Web安全不变量的形式化，以及将Coq模型和Web不变量转化为SMT-lib公式的工具链，以便使用Z3定理证明器进行模型检查。如果发现违规行为，工具链会自动生成与发现的攻击路径对应的可执行测试，在主要浏览器中验证。我们通过发现由不同浏览器机制相互作用引起的两个新的逻辑缺陷，并确定了当前Web平台中的三个先前发现的逻辑缺陷，以及旧版本中的五个逻辑缺陷，展示了WebSpec的有效性。最后，我们展示了WebSpec如何帮助验证我们提出的修正当前Web平台上的不一致性的变更。\n\nI. 引言\nWeb浏览器被认为是当今使用的最复杂的软件之一，Web平台组件的数量，即浏览器的功能和安全机制，不断增加。这些组件通常由浏览器供应商以W3C编辑草案的形式提出，并在社区内进行讨论。如果达成足够的共识，则标准化过程必须通过多个成熟度级别的进展，才能成为W3C的推荐标准。\n\n虽然新的Web平台组件的实现受到广泛的合规性测试的约束（例如，Web平台测试项目[6]），但它们的规范经过专家手动审查以发现潜在问题：这是一个持续而极其复杂的过程，必须考虑与旧API的相互作用，并且原则上应该在新组件登陆Web平台时进行修订。不幸的是，手动审查往往会忽视逻辑缺陷，最终导致严重的安全漏洞。例如，HttpOnly标志是由Internet Explorer 6引入的[21]，用于保护cookie的机密性。\n\n我们通过发现由不同浏览器机制相互作用引起的两个新的逻辑缺陷，并确定了当前Web平台中的三个先前发现的逻辑缺陷，以及旧版本中的五个逻辑缺陷，展示了WebSpec的有效性。最后，我们展示了WebSpec如何帮助验证我们提出的修正当前Web平台上的不一致性的变更。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\TeSec：Accurate Server-side Attack Investigation for Web Applications.pdf": {
        "title": "TeSec：Accurate Server-side Attack Investigation for Web Applications",
        "abstract": "网络应用程序的用户界面（UI）通常是企业和组织受到网络攻击的入口。找到入侵者使用的UI元素对于攻击拦截和修复网络应用程序都非常重要。当前针对Web UI的攻击调查方法要么提供粗略的分析结果，要么在高并发场景下性能差，导致繁重的手工分析工作。在本文中，我们提出了一种准确的Web UI应用程序攻击调查方法TESEC。TESEC利用了两种相关性。第一种是由PID / TID和分隔符日志分割的注释审核日志构建的相关性，捕捉了审核日志条目与Web请求之间的对应关系。第二种是在系统测试期间构建的Aho-Corasick自动机建模的相关性，捕捉了请求与UI元素/事件之间的对应关系。利用这两种相关性，TESEC可以在高并发场景下准确自动地定位UI元素/事件（即警报的根本原因）。此外，TESEC只需部署在服务器上，无需从客户端浏览器收集日志。我们评估了TESEC在12个Web应用程序上的性能。实验结果显示，UI事件/元素与警报之间的匹配精度超过99.6%。安全分析师每次仅需平均检查不超过2个UI元素进行取证分析。平均响应时间和审核日志空间开销的最大开销都很低（分别为4.3%和4.6%）。\n\n索引词-攻击调查、Web应用程序取证、Aho-Corasick自动机、日志分割"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\The Leaky Web：Automated Discovery of Cross-Site Information Leaks in Browsers and the Web.pdf": {
        "title": "The Leaky Web：Automated Discovery of Cross-Site Information Leaks in Browsers and the Web",
        "abstract": "在浏览网络时，我们都不希望网站推测出我们之前访问过哪些其他网站或登录了哪些网站。然而，攻击者控制的网站可以通过被称为跨站泄漏（XS-Leaks）的浏览器侧信道推测出这种状态。尽管自2000年以来就已经知道这些问题，但之前的报告大多数只发现了个别问题，而没有系统地研究问题空间。此外，这些问题在实际环境中的影响通常是不透明的。\n\n为了解决这些未解决的问题，我们开发了第一个自动化框架，系统地发现浏览器中的观察信道。在这个过程中，我们检测和描述了Chromium、Firefox和Safari引擎中泄漏跨站信息的280个观察信道，其中包括许多被认为已修复的泄漏的变种。在这个框架之上，我们创建了一个自动化流程，在真实世界的网站中发现XS-Leaks。通过这个流程，我们对Tranco Top10K进行了关于XS-Leak的流行度的迄今为止最大规模的研究，包括访问推测和新提出的变种cookie接受推测攻击。此外，我们还对100个网站进行了经典XS-Leak攻击向量的登录检测。\n\n我们的结果表明，XS-Leaks对网络生态系统构成了重大威胁，因为至少15%、34%和77%的所有测试网站都容易受到这三种攻击。此外，我们还展示了浏览器之间的实现差异，导致实际环境中的攻击面不同。为了确保浏览器供应商和网站开发人员可以检查他们的应用程序是否存在XS-Leaks，我们开放源代码我们的框架，并包括了关于在不久的将来消除XS-Leaks并确保浏览器中的新功能不引入新的XS-Leaks的广泛讨论。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\'It's up to the Consumer to be Smart'：Understanding the Security and Privacy Attitudes of Smart Home Users on Reddit.pdf": {
        "title": "'It's up to the Consumer to be Smart'：Understanding the Security and Privacy Attitudes of Smart Home Users on Reddit",
        "abstract": "智能家居技术为用户提供了许多好处。然而，它们也带来了复杂的安全和隐私问题，用户在采用过程中往往难以评估和考虑这些问题。(智能家居技术的安全和隐私问题)为了更好地了解用户对智能家居安全和隐私的考虑和态度，特别是用户如何逐渐形成这些态度，我们对来自/r/homeautomation（一个重要的Reddit智能家居论坛）的180个安全和隐私相关讨论主题中的4,957个Reddit评论进行了定性内容分析。我们的分析显示，用户的安全和隐私态度，体现在关注程度和采用保护策略的程度上，受到多维考虑的影响。用户的态度会根据采用阶段等变化的情境因素而发展，以及他们如何意识到这些因素。此外，我们还描述了关于安全和隐私风险以及保护措施的在线讨论如何促进个体和集体态度的发展。根据我们的发现，我们提出了改进智能家居设计、支持用户态度发展、促进信息交流以及指导未来智能家居安全和隐私研究的建议。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\Characterizing Everyday Misuse of Smart Home Devices.pdf": {
        "title": "Characterizing Everyday Misuse of Smart Home Devices",
        "abstract": "-物联网（IoT）安全的探索通常关注外部和技术熟练的攻击者带来的威胁。虽然了解这些最极端的情况很重要，但同样重要的是了解智能设备拥有者面临的最有可能的伤害风险。本文探讨了智能设备如何被设备拥有者的日常关系人滥用-未经允许地使用以造成伤害，如朋友、家人和恋人等。在一项初步的表征调查（n=100）中，我们广泛收集了参与者所经历或参与的未经授权使用和滥用事件的类型。然后，在一项普查调查（n=483）中，我们评估了这些事件在具有代表性的人口中的普遍程度。我们的研究结果显示，未经授权使用智能设备的情况很普遍（43％的参与者经历过），而滥用也很常见（至少有19％的参与者经历过）。然而，高度个体化的因素决定了这些未经授权使用事件是否构成滥用。通过关注日常滥用行为，这项研究揭示了当今智能家居所有者面临的最普遍的安全和隐私威胁。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\Design and Evaluation of Inclusive Email Security Indicators for People with Visual Impairments.pdf": {
        "title": "Design and Evaluation of Inclusive Email Security Indicators for People with Visual Impairments",
        "abstract": "由于检测和过滤网络钓鱼邮件的挑战，不可避免地一些网络钓鱼邮件仍然能够进入用户的收件箱。因此，Gmail等电子邮件提供商已经实施了网络钓鱼警告以帮助用户更好地识别网络钓鱼行为。现有研究主要关注视力正常的用户的网络钓鱼警告，但人们对于视力受损者如何与网络钓鱼邮件和警告进行交互还不够了解。在本文中，我们与一组视力受损的用户（N=41）合作，研究了现有警告的有效性，并探索了更具包容性的设计（以Gmail警告设计为基准进行比较）。我们采用了多管齐下的方法，包括探索性研究（了解用户面临的挑战），用户参与设计和原型制作，以及主要研究（评估设计选择的影响）。我们的结果表明，视力受损的用户经常会忽略现有的Gmail警告，因为当前的设计（例如警告位置、使用的HTML标签）与屏幕阅读器用户的阅读习惯不匹配。警告的不一致性（例如在标准视图和HTML视图中）也给用户带来了障碍。我们展示了一个包容性设计（结合音频警告、快捷键和警告页面叠加）可以有效地增加警告的可注意性。基于我们的结果，我们向电子邮件提供商提出了一些建议。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\User Perceptions and Experiences with Smart Home Updates.pdf": {
        "title": "User Perceptions and Experiences with Smart Home Updates",
        "abstract": "更新可能是消费者在智能家居设备中减少安全和隐私漏洞的几个工具之一。然而，目前很少有研究了解用户对智能家居更新的看法和经验。为了填补这一空白，我们对美国412名智能家居用户进行了在线调查，样本具有多样的人口统计特征。我们发现用户普遍认为智能家居更新很重要且紧急。然而，更新看法与安全和隐私看法之间的关系不太明确。我们还确定了更新中存在的问题，并发现当前与用户偏好的更新模式之间存在差距。然后，我们提出了设计更易用和易于理解的更新机制和界面的方法。\n\n关键词：智能家居，物联网，安全，隐私，人机交互"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\When and Why Do People Want Ad Targeting Explanations. Evidence from a Four-Week, Mixed-Methods Field Study.pdf": {
        "title": "When and Why Do People Want Ad Targeting Explanations. Evidence from a Four-Week, Mixed-Methods Field Study",
        "abstract": "-许多人担心他们的个人数据在在线行为广告（OBA）中的使用方式。广告定位解释被提出作为提高透明度以减少这种担忧的一种方式。然而，什么时候以及为什么人们可能想要广告定位解释还不清楚。如果没有这种洞察力，我们有可能设计出不能解决真正担忧的解释。为了弥合这个差距，我们进行了为期四周的混合方法实地研究，与60名参与者一起了解他们在浏览网页时真正遇到的广告时何时以及为什么需要定位解释。我们发现，在研究中我们询问的4,251个广告中，用户希望解释约占30％，而主观感知个人数据如何被收集和共享与用户何时希望解释密切相关。通常，用户希望这些解释来确认或否认他们自己对数据收集方式或广告商动机的先入为主的看法。我们工作的一个重要结果是，一刀切的广告解释方法很可能无法解决人们对广告定位的实际担忧，相反，需要更个性化的解释。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\Control Flow and Pointer Integrity Enforcement in a Secure Tagged Architecture.pdf": {
        "title": "Control Flow and Pointer Integrity Enforcement in a Secure Tagged Architecture",
        "abstract": "控制流攻击利用软件漏洞将控制流转移到意外路径，最终执行攻击代码。本文探讨使用指令和数据标记作为一种通用手段来阻止此类控制流攻击，包括依赖于破坏指针完整性的攻击。使用特定类型的窄带宽数据标记以及嵌入在二进制文件中的窄带宽指令标记有助于实施所需的安全策略，以防止此类攻击，从而实现实际可行的解决方案。(标记的指令标签紧密地与其对应的指令放置在缓存行中，消除了对指令标签访问的分离机制的需求。从编译器的分析阶段获取的信息被增强并用于生成指令和数据标记。展示了一个完整的堆栈实现，包括修改过的LLVM编译器，标记的Linux操作系统支持以及用于强制执行CFI、数据指针和代码指针完整性的FPGA实现的CPU硬件原型。通过适度的硬件增强，原型系统上的基准应用程序的执行时间被限制为基准系统的低个位数百分比。关键词：控制流完整性、硬件安全、指针完整性、安全架构、安全和隐私策略。 (控制流攻击是一种利用软件漏洞的攻击方式，通过改变程序的控制流程，使其执行攻击者指定的恶意代码。本文提出了使用指令和数据标记的方法来防止这种类型的攻击，包括那些依赖于破坏指针完整性的攻击。通过在二进制代码中嵌入窄带宽的指令和数据标记，可以实施所需的安全策略，从而有效地防止这些攻击。此外，还提出了在缓存行中紧密放置指令标记的方法，以减少对指令标记访问的开销。通过分析编译器生成的信息，可以生成指令和数据标记。作者还展示了一个完整的实现，包括修改过的LLVM编译器、支持标记的Linux操作系统和基于FPGA的CPU硬件原型。通过适度的硬件增强，实验结果表明，在原型系统上运行基准应用程序的执行时间仅为没有标记的基准系统的几个百分点。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\EC：Embedded Systems Compartmentalization via Intra-Kernel Isolation.pdf": {
        "title": "EC：Embedded Systems Compartmentalization via Intra-Kernel Isolation",
        "abstract": "嵌入式系统由低功耗微控制器组成，构成从物联网节点到超级计算机的计算系统。(嵌入式系统由低功率微控制器组成，从物联网节点到超级计算机构成计算系统。)\n不幸的是，由于低功耗的限制，这些系统的安全性经常被忽视，留下了巨大的攻击面。(不幸的是，由于低功耗的限制，这些系统的安全性经常被忽视，留下了巨大的攻击面。)\n例如，攻击者入侵用户任务后可以访问任何内核数据结构。(例如，攻击者入侵用户任务后可以访问任何内核数据结构。)\n现有的工作已经应用了隔离技术来减少攻击面，但这些系统要么产生很高的运行时开销，要么需要对现有固件进行重大修改。(现有的工作已经应用了隔离技术来减少攻击面，但这些系统要么产生很高的运行时开销，要么需要对现有固件进行重大修改。)\n在本文中，我们提出了嵌入式隔离器（EC），这是一个全面且自动化的隔离工具链，适用于实时操作系统（RTOSs）和裸机固件。(在本文中，我们提出了嵌入式隔离器（EC），这是一个全面且自动化的隔离工具链，适用于实时操作系统（RTOSs）和裸机固件。)\nEC提供了嵌入式隔离器编译器（ECC），可以自动将固件分区到不同的隔离区，并使用嵌入式隔离器内核（ECK）来强制执行它们之间的内存保护。(EC提供了嵌入式隔离器编译器（ECC），可以自动将固件分区到不同的隔离区，并使用嵌入式隔离器内核（ECK）来强制执行它们之间的内存保护。)\nECK是一个经过形式验证的微内核，实现了一种用于隔离固件的新型架构，通过内核内隔离实现。(ECK是一个经过形式验证的微内核，实现了一种用于隔离固件的新型架构，通过内核内隔离实现。)\n我们的评估显示，EC是一种高效的工具，可以在不引入显著运行时开销或对现有固件进行重大修改的情况下，为嵌入式系统提供有效的隔离保护。(我们的评估显示，EC是一种高效的工具，可以在不引入显著运行时开销或对现有固件进行重大修改的情况下，为嵌入式系统提供有效的隔离保护。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\Low-Cost Privilege Separation with Compile Time Compartmentalization for Embedded Systems.pdf": {
        "title": "Low-Cost Privilege Separation with Compile Time Compartmentalization for Embedded Systems",
        "abstract": "嵌入式系统是普遍存在的，广泛应用于我们周围的各个领域。这些系统运行在低功耗的微控制器上，具有实时约束。为了满足这些约束，开发人员通常会牺牲安全性，通过以相同权限运行整个软件栈来满足需求。现有工作利用隔离技术来缓解这种情况，但由于在系统中实现不同隔离区之间的隔离需要进行大量的运行时检查，导致开销很高，因此很少被采纳。在本文中，我们提出了一种称为Compartmentalized Real-Time C (CRT-C)的低成本编译时隔离机制，用于嵌入式系统中的特权分离，使用专用的编程语言方言在线性地址空间中实现。每种编程方言限制了程序的一部分的编程能力，形成了程序中的不同隔离区。CRT-C使用静态分析来识别固件中的各种隔离区，并通过实施隔离区特定策略来实现系统中的最低权限。我们设计和实现了一个新的编译器，将CRT-C编译成可以在常见嵌入式系统上运行的隔离固件。我们使用两个实时操作系统（RTOSs）FreeRTOS和Zephyr对CRT-C进行评估。评估结果显示，CRT-C可以为嵌入式系统提供隔离，以防止各种攻击，同时平均运行时开销为2.63%，内存开销为..."
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\SecureCells：A Secure Compartmentalized Architecture.pdf": {
        "title": "SecureCells：A Secure Compartmentalized Architecture",
        "abstract": "现代程序是整体的，将来自不同来源的代码结合在一起，没有隔离，同时在联网设备上运行。任何组件中的漏洞可能会危及所有其他组件的代码和数据。分区将程序分为具有有限策略定义权限的故障域，遵循最小权限原则，防止组件之间的任意交互。不幸的是，现有的分区机制针对弱攻击模型，产生高开销，或者过度拟合特定用例，因此无法被广泛采用。当务之急是提供一个安全、高性能和灵活的机制，使开发人员能够可靠地实现一套分区化的软件。\n\n我们提出了SecureCells，一种新颖的内地址空间分区架构。SecureCells通过强制实施每虚拟内存区域（VMA）权限来进行安全和可扩展的访问控制，并引入了新的用户空间指令，通过硬件强制调用门和零拷贝权限传输来进行安全和快速的分区切换。SecureCells为调用栈维护和寄存器上下文隔离提供了新颖的软件机制。在微基准测试中，SecureCells在一个5级顺序处理器上仅需8个周期来切换分区，与最先进的技术相比，成本降低了一个数量级。因此，SecureCells可以帮助保护高性能软件，如内存键值存储，开销可以忽略不计，低于3%。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\WaVe：a verifiably secure WebAssembly sandboxing runtime.pdf": {
        "title": "WaVe：a verifiably secure WebAssembly sandboxing runtime",
        "abstract": "I. 翻译：\n软件沙箱的承诺是灵活、快速和可移植的隔离；它捕捉了基于硬件的内存保护的好处，而不需要操作系统的参与。(软件沙箱的好处是能够在不需要操作系统参与的情况下，实现灵活、快速和可移植的隔离。这个承诺在WebAssembly(Wasm)中得到了实现，Wasm是一种流行的可移植字节码，其编译器会自动插入运行时检查来确保数据和控制流限制在一个内存段中。事实上，现代编译的Wasm实现已经发展到了这样一个地步，这些检查本身可以被验证，从而将编译器从可信计算基中移除。然而，由此产生的完整性属性只对严格在Wasm沙箱内执行的代码有效。与管理沙箱并暴露用于访问操作系统资源的WebAssembly系统接口(WASI)的运行时系统的任何交互都是在这个契约之外进行的。由此产生的困境是如何在保持Wasm的强隔离特性的同时，允许这些程序与外部世界(即文件系统、网络等)进行交互。我们的论文通过WaVe提出了解决这个问题的解决方案，它是一个经验证的安全运行时系统，实现了WAS。\n\nII. 解释：\n本文介绍了软件沙箱的概念和优势，它能够在不需要操作系统参与的情况下实现灵活、快速和可移植的隔离。这种优势在WebAssembly(Wasm)中得到了实现，Wasm是一种流行的可移植字节码。Wasm的编译器会自动插入运行时检查来确保数据和控制流限制在一个内存段中，这使得编译的Wasm实现能够验证这些检查，从而将编译器从可信计算基中移除。然而，这些完整性属性只对严格在Wasm沙箱内执行的代码有效，而与管理沙箱并暴露WebAssembly系统接口(WASI)的运行时系统的任何交互都是在这个契约之外进行的。因此，如何在保持Wasm的强隔离特性的同时允许程序与外部世界进行交互成为一个困境。论文提出了一个解决方案，通过一个经验证的安全运行时系统WaVe来实现WAS，从而解决这个问题。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\Blue's Clues：Practical Discovery of Non-Discoverable Bluetooth Devices.pdf": {
        "title": "Blue's Clues：Practical Discovery of Non-Discoverable Bluetooth Devices",
        "abstract": "蓝牙是个人区域网络的首选协议，蓝牙经典标准已连续使用了20多年。蓝牙设备通过使自己可发现来进行通信，但为了保护隐私的最佳实践是确保设备保持非可发现模式。本文证明了通过使设备处于非可发现状态来保护设备的无效性。我们介绍了“蓝色线索”攻击，这是第一种直接、非破坏性的方法，可以从处于非可发现模式的目标设备中完全提取出永久的、唯一的蓝牙MAC标识符。我们还证明了我们可以完全描述设备的能力并检索标识符，其中一些标识符通常包含有关设备所有者的身份信息。我们使用软件定义无线电并通过空中攻击我们自己的设备以及经过机构批准在公共建筑中进行蓝色线索攻击的演示。我们发现各种各样的蓝牙设备可以在平均不到10秒的时间内得到唯一识别，受影响的设备包括智能手机、耳机、加油站盗刷器和保姆摄像头，涵盖了所有蓝牙经典标准的版本。虽然我们提供了对抗攻击的潜在缓解措施，但蓝色线索迫使重新评估二十多年来保护设备免受发现的最佳实践。 (蓝牙作为个人区域网络的首选协议已经使用了20多年，本文介绍了一种攻击方法可以从处于非可发现模式的设备中提取蓝牙MAC标识符，并展示了该攻击可以适用于各种蓝牙设备，包括智能手机、耳机、加油站盗刷器和保姆摄像头。该攻击方法让人们重新评估保护设备免受发现的最佳实践。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\DeHiREC：Detecting Hidden Voice Recorders via ADC Electromagnetic Radiation.pdf": {
        "title": "DeHiREC：Detecting Hidden Voice Recorders via ADC Electromagnetic Radiation",
        "abstract": "——未经授权的秘密录音给对隐私敏感的场景带来了显著的威胁，例如机密会议和私人谈话。由于迷你化和伪装特性，隐藏的录音设备很难被周围人察觉。在本文中，我们提出了DeHiREC，这是第一个能够从电磁辐射（EMR）中检测到离线隐藏录音设备的概念验证系统。我们首先对发射的EMR信号的独特模式进行表征，然后定位EMR源，即嵌入在混合信号片上系统（MSoCs）中的模拟-数字转换器（ADC）模块。由于这些非故意的EMR信号可能非常嘈杂和微弱，准确地检测它们可能具有挑战性。为了应对这一挑战，我们首先设计了一种EMR催化方法来主动激发EMR信号，然后采用自适应折叠算法来提高感知到的EMR的信噪比（SNR）。一旦感知到的EMR变化与我们的主动刺激相对应，我们就可以确定存在隐藏的录音设备。我们在13种商用录音设备上评估了DeHiREC的性能，包括来自其他设备的干扰。实验结果表明，DeHiREC在检测所有13种录音设备方面表现出良好的效果，在0.2米的距离下，整体成功率为92.17%，召回率为86.14%。\n索引词——隐藏录音设备，电磁辐射（EMR），模拟-数字转换器（ADC）。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\LazyTAP：On-Demand Data Minimization for Trigger-Action Applications.pdf": {
        "title": "LazyTAP：On-Demand Data Minimization for Trigger-Action Applications",
        "abstract": "触发-动作平台（TAPs）赋予应用程序（应用）连接其他无法连接的设备和服务的能力。（当前的）TAPs，如IFTTT，需要触发服务将大量敏感数据推送到TAP，无论这些数据在应用中是否被使用，与数据最小化的原则相悖。（此外）现代TAPs的丰富功能，包括支持多个触发服务的IFTTT查询和应用程序的非确定性，已经超出了以往的数据最小化方法（如minTAP）的范围。本文提出了LazyTAP，一种新的细粒度按需数据最小化范例。LazyTAP摆脱了粗粒度数据过度逼近的传统“全部推送”的方法。相反，LazyTAP在应用程序执行访问数据时按需拉取输入数据。由于细粒度的特性，LazyTAP能够自然地支持通过查询来支持多个触发服务，并且对于应用程序的非确定性行为具有鲁棒性。我们通过利用惰性来推迟计算和代理对象来在后台加载必要的远程数据，从而实现了对第三方应用程序开发者的无缝支持。我们正式确立了LazyTAP的正确性以及对IFTTT和minTAP的最小化特性。我们在应用基准测试中实现和评估了LazyTAP，结果显示，平均而言，LazyTAP比IFTTT的最小化提高了95%，比minTAP提高了38%，同时性能开销可以容忍。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\One Key to Rule Them All：Secure Group Pairing for Heterogeneous IoT Devices.pdf": {
        "title": "One Key to Rule Them All：Secure Group Pairing for Heterogeneous IoT Devices",
        "abstract": "配对方案建立了用于安全通信的IoT设备之间的加密密钥。(依赖于可信的中央实体、人类交互或共享的同质化环境的现有配对方法容易出现单点故障，可用性有限，并且需要额外的传感器。最近的研究探索了由具有异构感知模式的设备观察到的事件时间作为去中心化配对的存在证明。然而，这种方法需要较长的配对时间，无法配对感知连续物理量的传感器，并且不支持组配对，因此对于许多IoT部署来说是不可行的。在本文中，我们设计和开发了一种名为IOTCUPID的安全组配对系统，用于具有异构感知模式的IoT设备，无需用户主动参与。IOTCUPID分为三个阶段操作：(a)使用一种新颖的基于窗口的导出技术检测由即时和连续传感器感知到的事件，(b)通过模糊聚类算法对事件进行分组，提取事件之间的时间关系，(c)通过分区组密码认证密钥交换方案在具有相同事件间时间的设备之间建立组密钥。我们在智能家居和办公环境中使用11个异构设备评估了IOTCUPID，并展示了它能够有效地使用仅2个组密钥对所有设备进行配对，并且配对开销很小。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\Optimistic Access Control for the Smart Home.pdf": {
        "title": "Optimistic Access Control for the Smart Home",
        "abstract": "智能家居用户最担心的隐私问题之一是如何限制家庭成员对设备和彼此数据的访问。虽然人们通常表达对复杂的访问控制策略的偏好，但在实践中他们常常接受不太安全的默认设置。作为一种替代方案，本文研究了“乐观访问控制”策略，允许用户在其他家庭成员的监督下，未经预先批准即可获得访问和数据。这种解决方案允许用户利用他们已经依赖的人际信任来建立与更复杂的访问控制方法相当的隐私界限，同时保留较不安全策略的便利性。为了评估这个概念，我们进行了一系列共计604人的调查，研究了这种方法的可接受性和认知。我们发现，一些受访者更喜欢乐观模式而不是现有的访问控制方法，并且对乐观访问的兴趣因设备类型和家庭特征而异。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\Protected or Porous：A Comparative Analysis of Threat Detection Capability of IoT Safeguards.pdf": {
        "title": "Protected or Porous：A Comparative Analysis of Threat Detection Capability of IoT Safeguards",
        "abstract": "消费者物联网（IoT）设备在家庭中越来越常见，从智能音箱到安全摄像头。随着它们的好处，也带来了潜在的隐私和安全威胁。为了限制这些威胁，一些商业服务已经变得可用（IoT安全保护措施）。这些保护措施声称能够提供保护，防范物联网的隐私风险和安全威胁。然而，这些保护措施的有效性和相关的隐私风险仍然是一个重要的未解决问题。在本文中，我们首次调查了物联网安全保护措施的威胁检测能力。我们开发并发布了一种用于自动化保护实验的方法，以揭示它们对常见安全威胁和隐私风险的响应。我们在一个大型物联网测试平台上使用流行的商业物联网安全保护措施进行了数千次自动化实验。我们的结果表明，这些设备不仅可能无法防止风险，而且它们的云交互和数据收集操作可能会给采用它们的家庭带来隐私风险。(个人备注: 物联网安全保护措施可能无法有效防范风险，并且可能会对家庭引入隐私风险。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\BLEDiff：Scalable and Property-Agnostic Noncompliance Checking for BLE Implementations.pdf": {
        "title": "BLEDiff：Scalable and Property-Agnostic Noncompliance Checking for BLE Implementations",
        "abstract": "在这项工作中，我们开发了一个自动化、可扩展、不受属性限制和黑盒的协议非合规检查框架，称为BLEDi，它可以分析和揭示蓝牙低功耗（BLE）协议实现中的非合规行为。（为了克服从庞大而复杂的BLE规范中提取BLE协议参考行为抽象和安全属性所需的巨大手动工作量，BLEDi利用了多个BLE设备的访问权限，并利用差分测试的概念自动识别异常的非合规行为。在这方面，BLEDi首先使用主动自动机学习方法自动提取BLE实现的协议状态机。为了改进大规模复杂BLE协议的主动自动机学习的可扩展性，BLEDi探索了使用分而治之的方法的思路。BLEDi基本上将BLE协议划分为多个子协议，识别它们的依赖关系并分别提取每个子协议的有限状态机，最后将它们组合起来创建大型协议有限状态机。然后对这些有限状态机进行成对测试，以自动识别各种偏离行为。我们使用25个不同的商用设备评估了BLEDi，并证明它可以揭示13种不同的偏离行为，其中包括10个可利用的攻击。）"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\From 5G Sniffing to Harvesting Leakages of Privacy-Preserving Messengers.pdf": {
        "title": "From 5G Sniffing to Harvesting Leakages of Privacy-Preserving Messengers",
        "abstract": "我们提出了第一个能够高效嗅探5G控制信道的开源工具5GSniffer，并展示了它对用户隐私进行攻击的潜力。5GSniffer基于我们对5G RAN控制信道的分析，揭示了侧信道泄露。我们注意到，与LTE相比，解码5G控制信道要困难得多，因为解码所需的部分信息是通过加密信道提供给用户终端设备的。我们设计了一组技术，实现了实时控制信道嗅探（比暴力破解快了三个数量级）。这使得我们能够在一个小区中获取所有用户的无线网络临时标识符（RNTIs）并进行流量分析。为了说明我们的嗅探器的潜力，我们分析了两个注重隐私的通信应用Signal和Telegram。我们发现了可以利用的隐私泄露漏洞，用来向目标用户生成隐秘的流量。当与5GSniffer结合使用时，它能够通过将手机号码与RNTI相关联，隐秘地暴露目标用户在特定位置的存在。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\IPvSeeYou：Exploiting Leaked Identifiers in IPv6 for Street-Level Geolocation.pdf": {
        "title": "IPvSeeYou：Exploiting Leaked Identifiers in IPv6 for Street-Level Geolocation",
        "abstract": "我们提出了IPvSeeYou，这是一种隐私攻击，允许远程和非特权的对手以街道级别的精度对许多住宅IPv6主机和网络进行物理地理定位。我们方法的关键在于：1）远程发现家庭路由器的广域网（WAN）硬件MAC地址；2）将这些MAC地址与其已知位置的WiFi BSSID对应起来；3）通过关联连接到共同次级提供者路由器的设备来扩展覆盖范围。\n\n我们首先通过高速网络探测获取嵌入在IPv6地址中的大量MAC地址。这些MAC地址在协议栈中被有效地泄露，并且主要表示住宅路由器的WAN接口，其中许多是一体化设备，还提供WiFi。我们开发了一种技术，可以统计地推断出不同制造商和设备之间路由器的WAN和WiFi MAC地址的映射，并进行大规模的数据融合攻击，将WAN MAC地址与在Wardriving（地理定位）数据库中可用的WiFi BSSID进行相关性对应。利用这些相关性，我们可以在146个国家和地区中对超过1200万个路由器的IPv6前缀进行地理定位。选择性验证确认了39米的中位数地理定位误差。然后，我们利用技术和部署限制，通过聚类和关联与共同次级提供者路由器连接的设备，将攻击扩展到更大范围的IPv6住宅路由器集合。尽管我们向几个制造商和提供商负责任地披露了我们的结果，但已部署的住宅电缆和DSL路由器的僵化生态系统表明我们的攻击将在可预见的未来仍然是一个隐私威胁。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\Man-in-the-Middle Attacks without Rogue AP：When WPAs Meet ICMP Redirects.pdf": {
        "title": "Man-in-the-Middle Attacks without Rogue AP：When WPAs Meet ICMP Redirects",
        "abstract": "现代Wi-Fi网络通常受到安全机制的保护，例如WPA、WPA2或WPA3，因此对于攻击者（恶意主动方）来说，很难通过中间人（MITM）的方式劫持其他主动方的流量。在传统的恶意双胞胎攻击中，攻击者可能会部署一个虚假的无线访问点（AP）来劫持受害者主动方的流量（例如窃取凭据）。在本文中，我们揭示了一种新的MITM攻击，可以通过伪造合法的AP向受害者主动方发送伪造的ICMP重定向消息，从而使攻击者能够悄悄地劫持受害者主动方的流量，而无需部署任何虚假的AP。其核心思想是利用WPAs和ICMP协议之间的跨层交互漏洞，完全回避WPAs强制实施的链路层安全机制。我们解决了成功发动攻击的两个要求。首先，当攻击者伪造合法的AP来构造ICMP重定向消息时，合法的AP无法识别和过滤掉这些伪造的ICMP重定向消息。我们揭示了AP路由器中网络处理单元（NPUs）的一个新漏洞（CVE-2022-25667），该漏洞限制了AP路由器阻止伪造的ICMP错误消息通过路由器的能力。我们测试了来自10个知名AP供应商的55个热门无线路由器，由于这个漏洞，这些路由器中没有一个能够阻止伪造的ICMP重定向消息。其次，我们开发了一种新方法，以确保伪造的ICMP重定向消息可以逃避受害者主动方的合法性检查，并毒化其路由表。我们对122个真实的Wi-Fi网络进行了广泛的测量研究，涵盖了所有流行的Wi-Fi安全模式。实验结果表明，122个评估的Wi-Fi网络中有109个（89%）易受我们攻击。除了向NPU制造商和AP供应商报告该漏洞外，我们还开发了两种对抗措施来限制该攻击。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\Mew：Enabling Large-Scale and Dynamic Link-Flooding Defenses on Programmable Switches.pdf": {
        "title": "Mew：Enabling Large-Scale and Dynamic Link-Flooding Defenses on Programmable Switches",
        "abstract": "链路洪水攻击（LFAs）可以切断对特定服务器目标的互联网连接，并且很难进行缓解，因为对手使用外观正常且低速的流量，并且可以动态调整攻击策略。传统的集中式防御系统无法在本地高效地抑制恶意流量。尽管新兴的可编程交换机为将防御系统靠近目标链接提供了机会，但它们的资源有限且缺乏对运行时重新配置的支持，限制了它们在链路洪水防御中的使用。\n\n我们提出了一种资源高效且运行时可适应的链路洪水防御系统Mew 1。Mew可以在大量流量集中在一个链接上或攻击策略快速变化时，对各种LFAs进行反制。我们设计了一种分布式存储机制和无丢包状态迁移机制，以减少可编程网络的存储瓶颈。我们开发了协同防御API，支持多粒度的共同检测和共同缓解，而不会带来过多的开销。Mew的动态防御机制可以不中断设备或中断其他运行功能的情况下，不断分析网络状况并激活相应的防御措施。我们使用真实世界的可编程交换机在五个城市开发了Mew的原型。我们的实验证明，这个真实世界的原型可以有效地防御大规模且动态的LFAs。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\PCSPOOF：Compromising the Safety of Time-Triggered Ethernet.pdf": {
        "title": "PCSPOOF：Compromising the Safety of Time-Triggered Ethernet",
        "abstract": "设计师越来越多地在嵌入式系统中使用混合关键性网络，以减小尺寸、重量、功耗和成本。其中最成功的技术可能是时间触发以太网（TTE），它允许关键时间触发（TT）流量和非关键尽力而为（BE）流量共享同一台交换机和电缆。TTE的一个关键方面是系统的TT部分与BE部分被隔离开来，因此BE设备无法干扰TTE设备的运行。这种隔离允许设计师：（1）使用不可信但低成本的BE硬件，（2）降低BE的安全要求，以及（3）在安全评审和认证程序中忽略BE设备。\n\n我们提出了PC SPOO F，这是第一个打破TTE隔离保证的攻击。PC SPOO F基于两个关键观察结果。首先，BE设备可以推断出有关网络的TT部分的私密信息，这些信息可以用来制造恶意的同步消息。其次，通过在以太网电缆上向TTE交换机注入电气噪声，BE设备可以欺骗交换机将这些恶意同步消息发送给其他TTE设备。我们的评估显示，成功的攻击可能在几秒钟内发生，并且每次成功的攻击可以导致TTE设备失去同步长达一秒，并丢失数十个TT消息，这两者都可能导致关键系统（如飞机或汽车）的故障。我们还展示了在模拟的航天任务中，PC SPOO F会导致无法控制的机动，威胁到安全和任务成功。我们向使用TTE的航空航天公司公开了PC SPOO F，并且几家公司正在实施本文中的缓解措施。\n\n关键词：时间触发以太网，封包中封包攻击，电磁干扰，嵌入式系统"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\DevFuzz：Automatic Device Model-Guided Device Driver Fuzzing.pdf": {
        "title": "DevFuzz：Automatic Device Model-Guided Device Driver Fuzzing",
        "abstract": "设备驱动程序的安全性对整个操作系统的可靠性至关重要。然而，验证设备驱动程序能否正确处理来自硬件设备的潜在恶意输入仍然非常具有挑战性。不幸的是，现有的基于符号执行的解决方案往往无法扩展，而模糊测试解决方案则需要真实的设备或手动设备模型，导致许多设备驱动程序未经充分测试而存在安全隐患。\n\n本文介绍了一种名为D EVFUZZ的新型模型引导设备驱动程序模糊测试框架，它不需要物理设备。D EVFUZZ利用符号执行自动生成探测模型，以指导模糊测试器正确初始化待测试的设备驱动程序。D EVFUZZ还利用静态和动态程序分析构建MMIO、PIO和DMA设备模型，进一步提高了模糊测试的效果。D EVFUZZ成功测试了来自不同操作系统（Linux、FreeBSD和Windows）的各种总线类型（PCI、USB、RapidIO、I2C）的191个设备驱动程序，并发现了72个漏洞，其中41个已经修补并合并到主流版本中。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\Pyfet：Forensically Equivalent Transformation for Python Binary Decompilation.pdf": {
        "title": "Pyfet：Forensically Equivalent Transformation for Python Binary Decompilation",
        "abstract": "反编译是法庭分析中至关重要的能力，它有助于分析未知二进制文件。最近Python恶意软件的兴起引起了对Python反编译器的关注，旨在从Python二进制文件获取源代码表示。然而，Python反编译器无法处理各种二进制文件，限制了它们在法庭分析中的能力。本文提出了一种新颖的解决方案，将导致反编译错误的Python二进制文件转化为可反编译的二进制文件。我们的核心思想是通过将输入二进制文件中导致错误的代码块转化为另一种形式来解决反编译错误。我们的方法的核心是法庭等价转换（FET）的概念，它允许在法庭分析的背景下进行非语义保留的转换。我们仔细定义了FET以最小化其不良后果，同时修复保留精确语义时难以解决的各种导致错误的指令。我们使用17,117个真实世界的Python恶意软件样本评估了我们方法的原型，在五个流行的反编译器中引起77,022个错误，并成功识别和修复了这些错误。我们的方法还处理了包括操作码重映射在内的反分析技术，并帮助将Python 3.9二进制文件迁移到3.8二进制文件。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\QueryX：Symbolic Query on Decompiled Code for Finding Bugs in COTS Binaries.pdf": {
        "title": "QueryX：Symbolic Query on Decompiled Code for Finding Bugs in COTS Binaries",
        "abstract": "可扩展的静态检查工具，如Sys和CodeQL，在源代码中成功发现了错误。这些工具允许分析人员编写特定于应用程序的规则，称为查询。这些查询可以利用分析人员的领域知识，从而使分析更准确和可扩展。然而，大多数这些工具不适用于仅二进制分析。一个例外是joern，它将二进制代码转换为反编译代码，并将反编译代码输入到普通的C代码分析器中。然而，这种方法对于符号分析来说不够精确，因为它忽视了反编译代码的独特特征。虽然二进制分析平台（如angr）支持符号分析，但分析人员必须了解它们的中间表示（IRs），尽管他们大多数时间都在使用反编译代码。在本文中，我们提出了一种精确和可扩展的符号分析方法，称为无畏符号分析，它使用直观的二进制代码查询，并在QUERY X中实现。为了使查询直观，QUERY X允许分析人员在反编译代码之上编写查询，而不是IRs。特别是，QUERY X支持对反编译代码的回调，使用这些回调可以控制符号分析以发现代码中的错误。为了进行精确的分析，我们将反编译代码转换为我们的IR（称为DNR），并在考虑反编译代码的特征的同时对DNR进行符号分析。值得注意的是，DNR仅在内部使用，这使得分析人员可以编写查询，而不管是否使用DNR。为了可扩展性，QUERY X使用回调自动减少控制流图，并对查询中指定的回调之间的依赖关系进行排序。我们将QUERY X应用于Windows内核、Windows系统服务和汽车二进制代码。结果发现了15个独特的错误，其中包括10个CVE，并从微软的漏洞赏金计划中获得了18万美元。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\SyzDescribe：Principled, Automated, Static Generation of Syscall Descriptions for Kernel Drivers.pdf": {
        "title": "SyzDescribe：Principled, Automated, Static Generation of Syscall Descriptions for Kernel Drivers",
        "abstract": "在近年来，模糊测试操作系统内核在总体上取得了很好的效果。例如，自2017年以来，syzkaller在Linux内核中发现了数千个错误。syzkaller的一个必要组成部分是一组系统调用描述，通常由人工专家提供。然而，据我们所知，当前的系统调用描述主要是手动编写的，这既耗时又容易出错。考虑到有许多内核驱动程序（用于新硬件设备及其他方面）在不断开发和演化，这尤其具有挑战性。在本文中，我们提出了一种基于原则的解决方案，用于生成Linux内核驱动程序的系统调用描述。在其核心部分，我们总结和建模了从核心内核与驱动程序之间的“契约”中提取的关键不变量或编程约定。这使我们能够以编程方式了解内核驱动程序的初始化过程以及其相关接口的构建方式。基于这一见解，我们开发了一个名为SyzDescribe的工具，已经在数百个内核驱动程序上进行了测试。我们展示了SyzDescribe生成的系统调用描述与手动编写的描述相竞争，并且比之前的工作（如DIFUZE和KSG）要好得多。最后，我们分析了我们的描述与实际情况之间的差距，并指出了未来的改进机会。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\ViDeZZo：Dependency-aware Virtual Device Fuzzing.pdf": {
        "title": "ViDeZZo：Dependency-aware Virtual Device Fuzzing",
        "abstract": "一台虚拟机通过虚拟设备与其主机环境进行交互，通过虚拟设备消息（例如I/O操作）来驱动。通过发出精心设计的消息，攻击者可以利用虚拟设备中的漏洞逃逸出虚拟机，获取主机访问权限。虽然已经发现了许多虚拟设备中的漏洞，但基于覆盖率的虚拟设备模糊测试工具很少考虑消息内部的依赖关系（一个虚拟设备消息中的某个字段可能依赖于另一个字段）和消息之间的依赖关系（一个消息可能依赖于之前发出的消息），因此导致可扩展性和效率受限。\n\n我们的新型虚拟设备模糊测试框架VIDEZZO通过使用轻量级语法对消息内部的依赖关系进行注释，并通过新的变异规则自学习消息之间的依赖关系，克服了现有虚拟设备模糊测试工具的限制。具体来说，VIDEZZO注释消息依赖关系并应用三类消息变异器。这种方法避免了大量手动分析规范的工作，并通过满足依赖关系加快了缓慢的探索过程，从而实现了可扩展和高效的模糊测试工具，提高了对虚拟设备中漏洞的发现。\n\n在我们的评估中，VIDEZZO覆盖了两种虚拟化软件、四种架构、五个设备类别和28个虚拟设备，并且更快地达到了具有竞争力的覆盖率。此外，VIDEZZO成功地发现了24个已知漏洞和28个新漏洞，涵盖了各种类型的漏洞。我们正在积极与社区互动，我们已经提交的7个补丁已经被接受。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12B：Election and device recycling security\\Adaptive Risk-Limiting Comparison Audits.pdf": {
        "title": "Adaptive Risk-Limiting Comparison Audits",
        "abstract": "风险限制审计（RLA）是一种严格的统计程序，旨在检测无效的选举结果。RLA通过检查选举期间投出的纸质选票，统计评估选票确定的获胜者与计票报告的获胜者之间存在分歧的可能性。RLA的设计必须在风险和效率之间取得平衡：“风险”是指审计未能在发生分歧时检测到的机会的上限；“效率”是指进行审计的总工作量。\n\n最高效的方法——以检查的选票数量为衡量——是通过“选票比较”进行的。然而，选票比较需要对每张投票选票的内容进行（不可信任的）声明，而不是简单的选票计数。然后，将这个“投票记录表”（CVR）与选票进行一致性抽查。在许多实际情况下，生成适当的CVR的成本超过了进行审计的成本，这阻碍了这些样本效率高的技术的广泛采用。\n\n我们引入了一种新的RLA程序：自适应选票比较审计。在这种审计中，不会生成全局CVR；相反，采用三阶段的过程进行迭代：1）选择一个批次，2）为该批次生成CVR，3）从该批次中随机抽样一张选票，由审计员检查并与CVR进行比较。我们证明了这样的审计可以实现与标准比较审计相当的风险，并且只生成部分CVR。我们提出了三个主要贡献：（1）对RLAs进行形式化的对抗模型；（2）定义和分析具有严格风险限制的自适应审计程序，并进行相关的正确性分析，考虑到典型审计中出现的偶然错误；（3）对效率进行分析。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12B：Election and device recycling security\\Blue Is the New Black (Market)：Privacy Leaks and Re-Victimization from Police-Auctioned Cellphones.pdf": {
        "title": "Blue Is the New Black (Market)：Privacy Leaks and Re-Victimization from Police-Auctioned Cellphones",
        "abstract": "在美国，如果警方没能找到失主，他们通常会将其拍卖。这包括通过民事资产没收、被盗或被送到失物招领处的手机。成千上万家美国警察局与一个名为PropertyRoom的网站合作，拍卖他们的物品。在几个月的时间里，我们从PropertyRoom购买了228部手机，以确定它们是否包含个人信息。我们的结果显示，即使对于没有取证专业知识的“低投入”对手，大量敏感的个人信息也很容易被获取到。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12B：Election and device recycling security\\How IoT Re-using Threatens Your Sensitive Data：Exploring the User-Data Disposal in Used IoT Devices.pdf": {
        "title": "How IoT Re-using Threatens Your Sensitive Data：Exploring the User-Data Disposal in Used IoT Devices",
        "abstract": "随着物联网（IoT）的快速技术进化和用户需求的增加，现如今物联网设备的再利用变得越来越常见。例如，超过30万台二手物联网设备正在Craigslist上销售。在物联网设备的再利用过程中，存储在这些设备中的敏感数据，如凭据和生物特征，如果用户未能正确处理这些数据，可能会面临泄露的风险。因此，一个关键的安全问题被提出：用户是否（或能否）正确处理二手物联网设备中的敏感数据？据我们所知，这仍然是一个尚未探索的问题，需要进行系统研究。\n\n在本文中，我们对二手物联网设备的用户数据处理进行了首次深入调查。我们的调查结合了多种研究方法，以探索二手物联网设备用户数据泄露的现状和根本原因。首先，我们进行了一项用户研究，调查用户对数据处理的意识和理解。然后，我们对4,749个物联网固件图像进行了大规模分析，以调查用户数据收集情况。最后，我们对33个物联网设备进行了全面的实证评估，以调查现有数据处理方法的有效性。\n\n通过系统调查，我们发现物联网设备收集的敏感数据比用户预期的要多。具体而言，我们在测试的固件中检测到了121,984个敏感数据收集。此外，用户通常不会或甚至无法正确处理敏感数据。更糟糕的是，由于存储芯片的固有特性，13.2%的调查固件执行“浅层”删除，这可能使对手在数据处理后获取敏感数据。鉴于大规模的物联网再利用，这种泄漏将造成广泛的影响。我们已向世界领先的公司报告了我们的发现。我们希望我们的发现能提高人们对物联网设备用户数据处理失败的意识，并促进物联网设备中用户敏感数据的保护。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12B：Election and device recycling security\\No Privacy in the Electronics Repair Industry.pdf": {
        "title": "No Privacy in the Electronics Repair Industry",
        "abstract": "电子设备维修和服务提供商为北美地区的计算设备所有者提供一系列服务，包括软件安装和硬件维修。设备所有者将设备和访问凭证交给技术人员，这引发了对个人数据的隐私问题。我们进行了一项全面的四部分研究，以评估电子设备维修行业的隐私状况。首先，通过与18家服务提供商进行实地研究，我们发现大多数服务提供商没有任何隐私政策或控制措施，无法保护设备所有者的个人数据免受技术人员的窥探。其次，我们在16家服务提供商处交付经过特制的设备进行维修，并收集到了技术人员普遍违反隐私的数据，包括窥探个人数据、复制设备上的数据和清除窥探活动的痕迹。第三，我们进行了一项在线调查（n=112），收集了顾客在维修设备过程中的经验数据。第四，我们邀请调查中的一部分受访者（n=30）进行半结构化面谈，以深入了解他们的经验，并找出减少技术人员隐私违规行为的潜在解决方案。我们利用研究结果讨论了各利益相关者和监管机构应采取的可能控制措施和行动，以改善维修行业的隐私状况。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\Low-effort VR Headset User Authentication Using Head-reverberated Sounds with Replay Resistance.pdf": {
        "title": "Low-effort VR Headset User Authentication Using Head-reverberated Sounds with Replay Resistance",
        "abstract": "尽管虚拟现实（VR）应用程序变得越来越普遍，但在授予个人访问权限之前有效验证VR设备用户仍然是一个挑战。现有的VR身份验证方法要求用户使用控制器输入PIN码或绘制图形密码。尽管输入是在虚拟空间中进行的，但它可能被附近的其他人观察到，并且存在严重的安全问题。此外，空中手部运动或基于手持控制器的身份验证需要用户积极参与，并且不具有时间效率。本文提出了一种基于独特的头骨回响声的低工作量VR设备身份验证系统，这些声音可以在用户戴上VR设备时获得。具体而言，当用户戴上VR设备或佩戴VR设备登录在线账户时，所提出的系统会主动发出超声波信号来启动身份验证会话。返回到VR设备的麦克风的信号已经被用户的头部回响，这是独特的，因为头部的大小、头骨形状和质量不同。因此，我们从接收到的信号中提取头部生物特征信息，用于不引人注目的VR设备身份验证。\n\n虽然主动声学感测广泛应用于移动设备，但以往的研究从未成功将此类技术应用于普通的VR设备。由于VR设备旨在为用户提供虚拟现实沉浸感，用于主动感测的回声声音是不需要的，并且会被严重抑制。在此过程之前的原始音频也无法在不进行内核/硬件修改的情况下访问。因此，我们的工作进一步解决了在回声消除下进行主动声学感测的挑战，以便在现成的VR设备上部署我们的系统。此外，我们还展示了回声消除机制在防止声学重放攻击方面的天然优势。\n\n所提出的系统基于自动编码器和卷积神经网络进行生物特征数据提取和识别。使用独立的和手机VR头盔进行的实验证明，我们的系统能够高效验证用户，并且对重放攻击具有抵抗能力。\n\n关键词：虚拟现实，身份验证，生物特征。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\MagBackdoor：Beware of Your Loudspeaker as A Backdoor For Magnetic Injection Attacks.pdf": {
        "title": "MagBackdoor：Beware of Your Loudspeaker as A Backdoor For Magnetic Injection Attacks",
        "abstract": "一个包含扬声器和麦克风的音频系统是语音启用设备的基本硬件，可以实现与移动应用和智能家居的语音交互。本文介绍了MagBackdoor，这是第一个通过基于扬声器的后门注入恶意命令的磁场攻击，从而破坏了连接的语音交互系统。MagBackdoor专注于扬声器上的磁场威胁，并暗中操纵其声音产生。因此，由于内部音频系统的紧密排列，麦克风将不可避免地捕捉到受攻击扬声器产生的恶意声音。为了证明MagBackdoor的可行性，我们进行了全面的模拟和实验。本研究进一步模拟了外部磁场如何激发扬声器的声音产生机制，为MagBackdoor提供了理论指导。针对真实世界场景中的隐蔽磁场攻击，我们自主设计了一个可以通过语音命令调制磁场的原型。我们实现了MagBackdoor，并在涉及16部智能手机、四台笔记本电脑、两台平板电脑和三个智能音箱的各种智能设备上进行评估，实现了平均95%的注入成功率，并且注入的声音质量很高。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\Privacy Leakage via Unrestricted Motion-Position Sensors in the Age of Virtual Reality：A Study of Snooping Typed Input on Virtual Keyboards.pdf": {
        "title": "Privacy Leakage via Unrestricted Motion-Position Sensors in the Age of Virtual Reality：A Study of Snooping Typed Input on Virtual Keyboards",
        "abstract": "虚拟现实（VR）在游戏、社交互动、购物和教育等众多领域都越来越受欢迎。本文通过一项全面研究，评估了嵌入式传感器在VR上的可信性，这些传感器嵌入了各种形式的敏感数据，可能会危及用户的隐私。我们发现，访问大多数VR SDK/API上的内置传感器（如运动、位置和按钮传感器），如OpenVR、Oculus Platform和WebXR，不需要安全权限，为攻击者窃取用户隐私提供了巨大的攻击面。我们通过开发恶意软件程序和恶意网站来验证这个漏洞，并特别探讨了在按键窃听情况下，它会暴露用户的信息到什么程度。为了考察其在实践中的实际威胁，被考虑的攻击模型的对手不拥有用户的任何标记数据，也不了解用户的VR设置。涉及两个主流VR系统和四个具有不同打字机制的键盘的广泛实验表明，我们的概念验证攻击可以以超过89.7%的准确率识别用户的虚拟打字。如果允许三次尝试，攻击可以以高达84.9%的准确率恢复用户的密码，并且对于段落推断，平均单词识别率为87.1%。我们希望这项研究能帮助社区认识到当前VR系统传感器管理中的漏洞，并为未来设计更全面和受限的传感器访问控制机制提供见解。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\Private Eye：On the Limits of Textual Screen Peeking via Eyeglass Reflections in Video Conferencing.pdf": {
        "title": "Private Eye：On the Limits of Textual Screen Peeking via Eyeglass Reflections in Video Conferencing",
        "abstract": "在COVID-19疫情导致面对面会议和电话通话转为视频会议以进行日常沟通和敏感业务后，个人视频会议已成为一种新的常态。视频会议泄漏参与者屏幕上的信息，因为眼镜和其他反射物无意中暴露了部分屏幕内容。通过数学建模和人体实验，本研究探索了新型网络摄像头可能通过捕捉眼镜反射而泄露可识别的文本和图形信息的程度。我们的工作的主要目标是在网络摄像头技术未来发展中测量、计算和预测识别因素、限制和阈值。我们的工作探索并描述了基于光学攻击的可行威胁模型，使用多帧超分辨率技术对视频帧序列进行处理。我们在受控实验室环境中的模型和实验结果显示，使用720p网络摄像头可以以超过75%的准确率重建和识别高度为10毫米的屏幕文本。我们进一步将此威胁模型应用于具有不同攻击者能力的网络文本内容，以找到文本变得可识别的阈值。我们对20名参与者进行的用户研究表明，现今的720p网络摄像头足以让对手重建大字体网站上的文本内容。我们的模型进一步显示，向4K摄像头的演进将使文本泄漏的阈值达到对流行网站上大多数标题文本进行重建。除了文本目标外，我们对使用720p网络摄像头识别Alexa前100个网站的闭环数据集的案例研究显示，即使不使用机器学习模型，最高识别准确率可达94%。我们的研究提出了近期的缓解措施，包括用户可以使用的软件原型来模糊视频流中眼镜区域。对于可能的长期防御，我们提倡采用个体反射测试程序来评估各种设置下的威胁，并证明在涉及隐私敏感场景中遵循最小特权原则的重要性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\Uncovering User Interactions on Smartphones via Contactless Wireless Charging Side Channels.pdf": {
        "title": "Uncovering User Interactions on Smartphones via Contactless Wireless Charging Side Channels",
        "abstract": "如今，支持无线充电的智能手机越来越多，利用电磁感应将电力从无线充电器传输到充电手机。在本文中，我们报道了一种新的无接触和上下文感知的无线充电侧信道攻击，该攻击利用在无线充电过程中产生的两个物理现象（即线圈嗡鸣声和磁场扰动），进一步推断充电手机上的用户交互。我们设计并实现了一个名为WISERS的三阶段攻击框架，以展示这个新的侧信道的实用性。WISERS首先捕获无线充电器发出的线圈嗡鸣声和磁场扰动，然后推断（i）界面之间的切换（例如从主屏幕切换到应用界面）和（ii）界面内的活动（例如应用内的键盘输入）来构建用户交互上下文，并进一步揭示敏感信息。我们对流行的智能手机和现成的无线充电器进行了广泛的WISERS效果评估。评估结果表明，WISERS可以以超过90.4％的准确率推断出敏感信息，例如解锁密码和应用程序启动。此外，我们的研究还表明，WISERS对一系列影响因素具有抵抗力。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1B：Blockchain 1\\Bitcoin-Enhanced Proof-of-Stake Security：Possibilities and Impossibilities.pdf": {
        "title": "Bitcoin-Enhanced Proof-of-Stake Security：Possibilities and Impossibilities",
        "abstract": "比特币是世界上最安全的区块链，得到了其工作量证明矿工的巨大算力支持。权益证明链具有节能的特点，具有快速确定性，但面临着几个安全问题：易受到不可抵消的远程安全攻击、低活性弹性和难以从低代币价值中引导。我们表明，这些安全问题在没有外部可信源的任何权益证明链中都是固有的，并提出了一个新的协议，巴比伦协议，其中一个现成的权益证明协议通过比特币进行检查点以解决这些问题。一项不可能性结果证明了巴比伦的最优性。巴比伦的一个应用案例是缩短股份提取延迟：我们的实验结果表明，使用巴比伦，这个延迟可以从现有的权益证明链的几周缩短到不到5个小时，每年在比特币上发布检查点的交易成本不到10,000美元。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1B：Blockchain 1\\SoK：Distributed Randomness Beacons.pdf": {
        "title": "SoK：Distributed Randomness Beacons",
        "abstract": "在区块链的出现下，许多新的协议被提出，以分布式且安全的方式生成可公开验证的随机数。这些协议在不同的设置和假设下工作，使用各种加密工具，并具有独特的权衡和特性。在本文中，我们系统地设计了分布式随机数信标（DRBs）以及它们所依赖的密码构建模块。我们评估了这些协议在两个关键安全属性，即无偏性和不可预测性方面的表现，并讨论了预测或偏倚信标输出的常见攻击向量以及协议采用的对策。我们还通过通信和计算效率比较了这些协议。最后，我们提供了关于不同协议在各种部署场景中适用性的见解，并强调了进一步研究的可能方向。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1B：Blockchain 1\\Three Birds with One Stone：Efficient Partitioning Attacks on Interdependent Cryptocurrency Networks.pdf": {
        "title": "Three Birds with One Stone：Efficient Partitioning Attacks on Interdependent Cryptocurrency Networks",
        "abstract": "加密货币节点的偏见分布跨越自治系统（ASes）增加了空间分区攻击的风险，允许对手通过劫持AS前缀来隔离节点。关于空间分区攻击的先前工作主要集中在比特币网络上，显示出通过BGP劫持来破坏物理拓扑可以使这一重要加密货币网络瘫痪。尽管BGP劫持的威胁仍然存在，比特币和其他加密货币并未经常受到攻击，可能是由于它们的受保护的覆盖拓扑，限制了物理网络异常的曝光。在本文中，我们通过考虑共享网络资源（网络相互依赖性）来研究加密货币网络的安全性，提出了一个新的视角。我们进行了超越比特币网络的测量，并分析了比特币、以太坊和瑞波节点托管模式的共同点。我们观察到，这三个网络都高度集中，主要共享相同的自治系统。我们还注意到，在这三种加密货币中，瑞波没有保护其覆盖拓扑，这可以被利用来了解物理网络异常。观察到的网络异常提供了可以同时针对这三种加密货币的实际攻击策略。我们通过调查对高知名度自治系统的最近BGP攻击，补充了我们的分析，并认识到需要应用层级的对策。我们提出了减少空间分区风险的攻击对策，尽管节点和网络相互依赖性的集中程度不断增加。\n\n索引词 - 分区攻击，分布式系统，加密货币"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1B：Blockchain 1\\WeRLman：To Tackle Whale (Transactions), Go Deep (RL).pdf": {
        "title": "WeRLman：To Tackle Whale (Transactions), Go Deep (RL)",
        "abstract": "-工作量证明区块链协议的安全性关键依赖于激励机制。这些被称为矿工的运营商通过创建包含用户生成交易的区块来获得奖励。每个区块都会以新铸造的代币和用户支付的交易费用来奖励其创建者。如果任何一个矿工的计算能力超过了阈值比例，协议的稳定性就会被破坏；然后她就会被激励去采取自私的挖矿行为，以增加她的奖励。\n\n以前对自私挖矿策略的分析假设奖励是恒定的。但根据运营系统的统计数据，我们证明了偶尔会出现异常高奖励的区块。对这种行为进行建模意味着状态空间会随参数呈指数级增长，对于现有的分析工具来说变得难以处理。\n\n我们提出了WeRLman框架来分析这种模型。WeRLman使用深度强化学习（RL），受到AlphaGo Zero算法的启发。直接将AlphaGo Zero扩展到随机模型会导致高采样噪声，这对学习过程是不利的。因此，WeRLman利用系统的循环性质和过渡概率的先验知识，采用了新颖的方差缩减技术。通过与我们可以准确解决的模型对WeRLman进行评估，我们证明它在区块链的深度强化学习中取得了前所未有的准确性。\n\n我们使用WeRLman来分析不同设置下理性矿工的激励，并对类似比特币的区块链的安全阈值进行了上界估计。我们首次展示了费用变异性与安全阈值之间的负相关关系。以前已知的阈值，基于恒定的奖励，为0.25 [2]。我们证明，在考虑到异常高奖励交易的情况下，这个阈值会显著降低。特别是，根据比特币的历史费用和其未来的铸币政策，它在10年内的偏离阈值将降至0.2，在20年内将降至0.17，在30年内将降至0.12。根据以太坊智能合约平台的最新费用，阈值降至0.17。这些数值低于大型矿工的普遍规模[3]。\n\n关键词-区块链、自私挖矿、比特币、以太坊、交易费用、异常高奖励交易、矿工可提取价值、深度强化学习、蒙特卡洛树搜索、深度Q网络"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1C：Cryptographic attacks\\DBREACH：Stealing from Databases Using Compression Side Channels.pdf": {
        "title": "DBREACH：Stealing from Databases Using Compression Side Channels",
        "abstract": "我们介绍了一种新的针对数据库存储引擎的压缩侧信道攻击，该攻击同时支持数据库页面的压缩和加密。在仅具有有限的、间接的对加密和压缩数据库表的访问权限时，我们的攻击可以高度准确地提取任意明文。我们展示了针对MariaDB和MySQL中的InnoDB存储引擎变体以及MongoDB中的WiredTiger存储引擎的准确且高效的攻击。\n\n我们的攻击克服了数据库环境中独特的障碍，这些障碍使得先前用于攻击TLS的技术无效。与Web环境不同，在Web环境中可以观察到压缩和加密消息的确切长度，而我们只利用从磁盘文件大小中获得的近似密文大小信息。我们放大这个噪声信号，并结合针对数据库环境量身定制的新攻击启发式方法，以提取秘密明文。\n\n我们的攻击可以以超过90%的准确度检测出一个随机字符串是否出现在表中，并可以以超过95%的成功率从加密表中提取10个字符的随机字符串。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1C：Cryptographic attacks\\MEGA：Malleable Encryption Goes Awry.pdf": {
        "title": "MEGA：Malleable Encryption Goes Awry",
        "abstract": "MEGA是一个领先的云存储平台，拥有超过2.5亿用户和1000 PB的存储数据。MEGA声称提供用户控制的端到端安全性。这是通过在MEGA客户端上进行所有数据加密和解密操作，并通过仅对这些客户端可用的密钥进行控制来实现的。这旨在保护MEGA用户免受MEGA本身或控制了MEGA基础设施的对手的攻击。\n\n我们对MEGA在恶意服务器环境下使用密码学的情况进行了详细分析。我们提出了针对MEGA的五种不同的攻击，这些攻击共同导致用户文件的机密性完全被破坏。此外，用户数据的完整性受到损害，以至于攻击者可以插入他们选择的恶意文件，并通过客户端的所有真实性检查。我们制作了所有攻击的概念验证版本。其中四种攻击是非常实用的。它们都已向MEGA负责披露，并正在进行修复。\n\n综合而言，我们的攻击突显了MEGA密码学架构的重大缺陷。我们提出了可立即部署的对策措施，以及长期的建议。我们还对在强威胁模型下大规模部署密码学的挑战进行了更广泛的讨论。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1C：Cryptographic attacks\\Weak Fiat-Shamir Attacks on Modern Proof Systems.pdf": {
        "title": "Weak Fiat-Shamir Attacks on Modern Proof Systems",
        "abstract": "研究人员和实践者之间的一系列激动人心的活动，产生了使用新颖技术思想构建的现代证明系统，并在加密货币领域得到迅速应用。这些现代证明系统中，大部分使用了Fiat-Shamir（F-S）转换，这是一种通过公共硬币验证者来消除协议交互的重要方法。一些先前的研究表明，错误应用F-S（即使用所谓的“弱”F-S转换）可能会导致破解像Schnorr的离散对数证明这样的经典协议；然而，我们对于错误应用F-S对于当今部署的现代证明系统的风险知之甚少。\n\n在本文中，我们通过对现代证明系统实现中F-S的广泛理论和实践研究来填补这一知识空白。我们对开源实现进行了调查，发现了30个影响12个不同证明系统的弱F-S实现。对于其中的四个系统——Bulletproofs、Plonk、Spartan和Wesolowski的VDF，我们开发了新颖的知识完备性攻击，并提供了其有效性的严格证明。我们对使用易受攻击实现的应用进行了案例研究，并证明弱F-S漏洞可能导致在私有智能合约平台上创建无限货币。最后，我们讨论了学术界和实践者可能采取的缓解措施和经验教训。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Attitudes towards Client-Side Scanning for CSAM, Terrorism, Drug Trafficking, Drug Use and Tax Evasion in Germany.pdf": {
        "title": "Attitudes towards Client-Side Scanning for CSAM, Terrorism, Drug Trafficking, Drug Use and Tax Evasion in Germany",
        "abstract": "近年来，有越来越多的立法努力和提议的技术措施旨在削弱保护隐私的技术，以应对儿童虐待等严重犯罪。其中一项提议的措施是客户端扫描（CSS）。CSS在苹果公司宣布其将在2021年部署该技术以及欧盟于2022年提出立法的背景下引起了激烈的争论。争论双方都声称自己是为了人民的最大利益而努力。为了阐明问题，我们对德国公民进行了一项调查。我们调查了德国公民对不同类型犯罪的CSS和基于云的扫描的普遍接受程度，并分析了他们对德国政府、谷歌和苹果等公司的信任如何影响参与者的观点。我们发现，总体而言，大多数参与者愿意接受CSS措施来打击儿童虐待或恐怖主义等严重犯罪，但对其他非法活动的支持显著下降。然而，大多数支持CSS的参与者也担心潜在的滥用，只有20%的人表示他们不担心。这些结果表明，我们的许多参与者愿意让他们的设备进行扫描，并接受一些风险，以便帮助执法部门。在我们的分析中，我们认为不能把这看作是引入CSS的无限制授权，而应该是信息安全和隐私保护社区行动的呼吁。需要进一步研究如何在减轻对隐私和社会的风险的同时实现人们防止严重网络犯罪的愿望。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Deep perceptual hashing algorithms with hidden dual purpose：when client-side scanning does facial recognition.pdf": {
        "title": "Deep perceptual hashing algorithms with hidden dual purpose：when client-side scanning does facial recognition",
        "abstract": "端到端加密（E2EE）为个人提供了强大的技术保护，防止干扰。然而，全球各国政府和执法机构也对E2EE表示担忧，认为其也会导致无法检测到的非法内容的共享。客户端扫描（CSS）使用感知哈希（PH）在共享之前检测已知的非法内容，被视为既能预防非法内容传播又能保持加密的有希望的解决方案。尽管这些提议引发了强烈的隐私担忧，但解决方案的支持者认为风险有限，因为该技术的范围有限，仅能检测已知的非法内容。在本文中，我们展示了现代感知哈希算法实际上是非常灵活的技术，这种灵活性可以被对手利用来给客户端扫描系统添加一个次要的隐藏功能。更具体地说，我们展示了对手提供的PH算法可以“隐藏”一个面部识别的次要目的，同时保持其主要目的的图像副本检测。我们首先提出了一种通过共同优化图像副本检测和目标面部识别任务来训练双重用途的深度感知哈希模型的过程。其次，我们广泛评估了我们的双重用途模型，并展示其能够可靠地识别目标个体的能力为67%，而不影响其检测非法内容的性能。我们还展示了我们的模型既不是一般的人脸检测模型也不是人脸识别模型，从而隐藏了其次要目的。最后，我们展示了通过向数据库添加一张非法外观的图像可以启用次要目的。综上所述，我们的结果引发了担忧，认为基于深度感知哈希的CSS系统可能将数十亿用户设备变成定位目标个体的工具。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Is Cryptographic Deniability Sufficientƒ Non-Expert Perceptions of Deniability in Secure Messaging.pdf": {
        "title": "Is Cryptographic Deniability Sufficientƒ Non-Expert Perceptions of Deniability in Secure Messaging",
        "abstract": "密码学家长期以来一直担心安全的消息协议会威胁到可否认性。许多消息协议包括现代电子邮件，都包含数字签名，可以明确地将作者与其消息联系起来。如果这些签名被盗或泄露，就无法否认作者身份。正如希拉里·克林顿2016年美国总统竞选期间泄露事件所表明的那样，这个担忧是有根据的。可否认的协议旨在避免这种情况发生，让政治家和持不同政见者都能够安全地否认自己的作品。尽管Signal和WhatsApp上的数十亿设备上都部署了这样的协议，但这种协议在说服人们方面的效果尚未得到研究。虽然在有效的否认中缺乏密码学证据显然是必要的，但是否足够呢？\n我们进行了一项调查研究（n = 1,200）以了解人们对加密消息协议的可否认性证据的认知。令人惊讶的是，在一个充斥着“假新闻”和Photoshop的世界中，我们发现仅凭简单的消息否认，在法庭环境中没有支持证据的情况下，是不起作用的。相反，那些获得了屏幕截图伪造工具或被告知该工具存在的参与者更有可能相信否认。同样地，虽然程度较小，但我们发现专家密码学家断言没有证据也是有效的。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Lambretta：Learning to Rank for Twitter Soft Moderation.pdf": {
        "title": "Lambretta：Learning to Rank for Twitter Soft Moderation",
        "abstract": "为了遏制虚假信息的问题，像推特这样的社交媒体平台开始在讨论被揭穿的叙述内容上添加警告标签，目的是为观众提供更多背景信息。不幸的是，这些标签并没有得到统一应用，导致大量虚假内容未经审查。本文介绍了一种名为LAMBRETTA的系统，它使用学习排序（LTR）自动识别可能需要软性审查的推文候选项。我们在推特数据上运行LAMBRETTA来审查与2020年美国选举有关的虚假主张，并发现它标记的推文数量是推特的20倍以上，仅有3.93％的误报和18.81％的漏报，超过了基于关键词提取和语义搜索的其他最新方法。总的来说，LAMBRETTA协助人工审查员在社交媒体上识别和标记虚假信息。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\On the Evolution of (Hateful) Memes by Means of Multimodal Contrastive Learning.pdf": {
        "title": "On the Evolution of (Hateful) Memes by Means of Multimodal Contrastive Learning",
        "abstract": "在社交媒体平台和现实世界中，令人讨厌的恶搞图片的传播对社会产生了不利影响。检测令人讨厌的恶搞图片是具有挑战性的，其中一个原因是恶搞图片的进化性质；通过将恶意含义与其他文化观念或符号融合，新的恶搞图片可能会出现。在本文中，我们提出了一个框架，利用多模态对比学习模型，特别是OpenAI的CLIP，来识别恶意内容的目标，并系统地研究恶搞图片的演变。我们发现，CLIP生成的嵌入中存在语义规律，描述了同一模态（图像）或跨模态（图像和文本）之间的语义关系。利用这个特性，我们研究了如何通过组合多个图像的视觉元素或将文本信息与恶搞图片融合来创建恶搞图片。我们通过关注反犹太恶搞图片，特别是快乐商人恶搞图片，展示了我们的框架分析恶搞图片演变的能力。在从4chan提取的数据集上使用我们的框架，我们找到了3.3K个快乐商人恶搞图片的变体，其中一些与特定国家、个人或组织有关。我们预计我们的框架可以帮助人工审核员通过标记新的恶搞图片变体，以便审核员可以手动验证它们并减轻网络上恶意内容的问题。1\n免责声明。本文包含未经审查的令人讨厌的内容，例如反犹太主义的图像，这些图像具有极高的冒犯性，可能会扰乱读者的情绪。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Public Verification for Private Hash Matching.pdf": {
        "title": "Public Verification for Private Hash Matching",
        "abstract": "端到端加密（E2EE）防止在线服务访问用户内容。这个重要的安全特性也是涉及内容分析的内容审核方法的障碍。E2EE与打击儿童色情虐待材料（CSAM）之间的紧张关系已成为加密政策中的全球焦点，因为检测有害内容的主要方法——基于服务器端明文图像的感知哈希匹配——不可用。最近的应用密码学进展实现了私有哈希匹配（PHM），其中一个服务可以在不向用户透露哈希集的情况下将用户内容与已知的CSAM图像集进行匹配，也不会将不匹配的内容透露给服务。这些设计，尤其是2021年提出的在苹果的iCloud照片服务中识别CSAM的方案，因为对安全、隐私和言论自由造成风险而受到广泛批评。在这项工作中，我们旨在通过为公众贡献新的密码学方法来推进PHM的学术研究和对话。我们从动机开始，描述了使用PHM检测CSAM的理由以及其部署中存在的严重社会和技术问题。验证可以部分解决PHM的缺点，我们将批评分为两个审计领域：对哈希集的信任和对实现的信任。我们解释了虽然这两个问题不能完全通过技术解决，但可能存在密码学信任改进的可能性。本文的核心贡献是能够实现PHM系统的三种公共验证类型的新型密码协议：（1）外部组织批准哈希集的认证，（2）证明特定合法内容不在哈希集中，以及（3）向用户报告误报匹配。我们描述的协议是实用、高效且与现有的PHM构建兼容的。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\Accuracy-Privacy Trade-off in Deep Ensemble：A Membership Inference Perspective.pdf": {
        "title": "Accuracy-Privacy Trade-off in Deep Ensemble：A Membership Inference Perspective",
        "abstract": "深度集成学习已被证明通过训练多个神经网络并对它们的输出进行平均，提高了准确性。集成学习也被提出用于防御损害隐私的成员推断攻击。在本文中，我们通过实证分析展示了准确性和隐私（以成员推断攻击为衡量标准）之间的权衡，即在深度集成中存在这两个目标之间的权衡。通过使用各种数据集和模型架构，我们展示了当集成提高准确性时，成员推断攻击的有效性会增加。我们分析了深度集成中各种因素的影响，并展示了这种权衡的根本原因。然后，我们评估了基于正则化和差分隐私的常见成员推断攻击防御方法。我们展示了虽然这些防御方法可以减轻成员推断攻击的有效性，但同时会降低集成的准确性。我们还展示了在更先进和最新的集成技术中，如快照集成和多样化集成网络中存在类似的权衡。最后，我们提出了一种简单而有效的深度集成防御方法，以打破这种权衡，从而同时提高准确性和隐私。\n\n关键词：成员推断、集成学习、深度集成"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\Analyzing Leakage of Personally Identifiable Information in Language Models.pdf": {
        "title": "Analyzing Leakage of Personally Identifiable Information in Language Models",
        "abstract": "语言模型（Language Models，LMs）已被证明会通过句子级成员推理和重构攻击泄露有关训练数据的信息。对于LMs泄露个人可识别信息（Personally Identifiable Information，PII）的风险的理解受到较少关注，这可以归因于错误的假设，即通过数据集处理技术（如清洗）就足以防止PII泄露。清洗技术可以减少但无法完全防止PII泄露的风险：在实践中，清洗是不完美的，并且必须在最小化泄露和保留数据集效用之间权衡。另一方面，还不清楚设计用于保证句子或用户级隐私的差分隐私等算法防御在多大程度上可以防止PII披露。在这项工作中，我们通过仅使用LM的API访问，引入了基于严格博弈的定义，用于描述通过黑盒提取、推理和重构攻击泄露三种类型的PII。我们在三个领域（案例法、医疗保健和电子邮件）中对使用和不使用防御的GPT-2模型进行了实证评估。我们的主要贡献是：（i）新颖的攻击可以提取多达10倍的PII序列，超过现有攻击；（ii）显示句子级差分隐私降低了PII披露的风险，但仍会泄露约3%的PII序列；（iii）记录级成员推理和PII重构之间的微妙联系。可以在https://github.com/microsoft/analysing-piileakage 上获取重现论文中所有实验的代码。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\D-DAE：Defense-Penetrating Model Extraction Attacks.pdf": {
        "title": "D-DAE：Defense-Penetrating Model Extraction Attacks",
        "abstract": "最近的研究表明，机器学习模型容易受到模型提取攻击的威胁，攻击者通过查询受害模型来构建一个替代模型，该替代模型几乎可以达到与黑盒受害模型相同的性能。为了防御此类攻击，已经提出了一系列方法，在返回查询结果给潜在攻击者之前干扰查询结果，大大降低了现有模型提取攻击的性能。\n\n在本文中，我们首次尝试开发一种名为D-DAE的防御渗透模型提取攻击框架，旨在破解基于干扰的防御。D-DAE的关键是设计了两个模块，即干扰检测和干扰恢复，可以与通用的模型提取攻击集成。具体而言，在从受害模型获取查询结果后，干扰检测模块推断出防御者采用的防御机制。我们设计了一种基于元学习的干扰检测算法，用于学习干扰和未干扰查询结果分布之间的基本差异。即使我们无法访问受害模型的原始训练数据集，该算法也具有良好的泛化性能。鉴于检测到的防御机制，干扰恢复模块试图使用设计良好的生成模型从干扰的查询结果中恢复出干净的查询结果。\n\n我们在MNIST、FashionMNIST、CIFAR-10、GTSRB和ImageNette数据集上进行了广泛的评估，结果表明，在面对4种最先进的防御和多种防御组合时，D-DAE可以将现有模型提取攻击的替代模型准确率提高高达82.24%。我们还验证了D-DAE在渗透微软Azure和Face++托管的真实世界API的未知防御中的有效性。\n\n关键词：模型提取攻击，基于干扰的防御，元学习。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\On the (In)security of Peer-to-Peer Decentralized Machine Learning.pdf": {
        "title": "On the (In)security of Peer-to-Peer Decentralized Machine Learning",
        "abstract": "在这项工作中，我们进行了第一次深入的隐私分析，研究了分散式学习——一种旨在解决联邦学习主要限制的协作机器学习框架。我们提出了一套新颖的攻击方法，针对被动和主动的分散式对手。我们证明，与分散式学习提出者所声称的相反，分散式学习并不比联邦学习提供任何安全优势。相反，它增加了攻击面，使系统中的任何用户都能进行隐私攻击，如梯度反演，甚至完全控制诚实用户的本地模型。我们还表明，就目前的保护状态而言，隐私保护配置的分散式学习需要完全连接的网络，失去了与联邦设置相比的任何实际优势，从而完全挫败了分散式方法的目标。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\SNAP：Efficient Extraction of Private Properties with Poisoning.pdf": {
        "title": "SNAP：Efficient Extraction of Private Properties with Poisoning",
        "abstract": "财产推断攻击允许敌对方从机器学习模型中提取训练数据集的全局属性。这种攻击对于共享数据集以训练机器学习模型的数据所有者来说具有隐私影响。已经提出了几种针对深度神经网络的财产推断攻击方法[1]–[3]，但它们都依赖于攻击者训练大量的影子模型，这会导致大量的计算开销。\n\n在本文中，我们考虑了财产推断攻击的设置，其中攻击者可以操纵训练数据集的一个子集，并查询训练后的目标模型。受到我们对操纵下的模型置信度的理论分析的启发，我们设计了一种高效的财产推断攻击方法SNAP，其攻击成功率更高，需要更少的操纵量，相比Mahloujifar等人提出的基于操纵的财产推断攻击方法[3]。例如，在Census数据集上，SNAP的成功率比[3]高34%，同时速度快56.5倍。我们还扩展了我们的攻击方法，以有效地推断在训练期间某个属性是否存在，并估计感兴趣属性的确切比例。我们在四个数据集上评估了我们的攻击方法，并展示了SNAP的普适性和有效性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\SoK：Let the Privacy Games Begin. A Unified Treatment of Data Inference Privacy in Machine Learning.pdf": {
        "title": "SoK：Let the Privacy Games Begin. A Unified Treatment of Data Inference Privacy in Machine Learning",
        "abstract": "- 在生产环境中部署机器学习模型可能会让对手推断出关于训练数据的敏感信息。有大量的文献对不同类型的推断风险进行了分析，包括成员推断和重构攻击。受到在密码学中研究安全性属性的游戏（即概率实验）的成功启发，一些作者用类似的基于游戏的方式描述了机器学习中的隐私推断风险。然而，对手的能力和目标在不同的介绍中往往以微妙的不同方式陈述，这使得难以关联和组合结果。在本文中，我们提出了一个基于游戏的框架，以系统化地总结机器学习中的隐私推断风险的知识体系。我们使用这个框架来（1）为推断风险的定义提供一个统一的结构，（2）形式上建立已知的定义之间的关系，以及（3）发现此前难以发现的关系，否则很难发现。\n\n- 关键词：隐私、机器学习、差分隐私、成员推断、属性推断、属性推断"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2C：SMC\\Bicoptor：Two-round Secure Three-party Non-linear Computation without Preprocessing for Privacy-preserving Machine Learning.pdf": {
        "title": "Bicoptor：Two-round Secure Three-party Non-linear Computation without Preprocessing for Privacy-preserving Machine Learning",
        "abstract": "非线性函数的开销主导了基于隐私保护机器学习（PPML）的安全多方计算（MPC）的性能。本文介绍了一系列新颖的安全三方计算（3PC）协议，名为Bicoptor，它提高了评估非线性函数的效率。Bicoptor的基础是一种新的符号确定协议，它依赖于SecureML（S&P 2017）中提出的截断协议的巧妙运用。我们的3PC符号确定协议只需要两个通信回合，不涉及任何预处理。这种符号确定协议非常适合于在PPML中计算非线性函数，如激活函数ReLU、Maxpool及其变体。我们为这些非线性函数开发了适合的协议，形成了一系列适用于GPU的协议Bicoptor。所有的Bicoptor协议只需两个通信回合，无需预处理。我们在公共云上的三方局域网环境下评估了Bicoptor，并实现了每秒超过370,000个DReLU/ReLU或41,000个Maxpool（找到九个输入的最大值）操作。在相同的设置和环境下，我们的ReLU协议相比于最先进的作品Falcon（PETS 2021）或Edabits（CRYPTO 2020），在没有批处理的情况下，性能提升了一个甚至两个数量级。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2C：SMC\\Flamingo：Multi-Round Single-Server Secure Aggregation with Applications to Private Federated Learning.pdf": {
        "title": "Flamingo：Multi-Round Single-Server Secure Aggregation with Applications to Private Federated Learning",
        "abstract": "本文介绍了Flamingo，一种用于在大量客户端之间安全聚合数据的系统。在安全聚合中，服务器对客户端的私有输入进行求和，获得结果，同时不了解除最终求和之外的任何关于个别输入的信息。Flamingo专注于联邦学习中的多轮设置，其中执行多个连续的模型权重求和（平均值）以得到一个良好的模型。之前的协议，如Bell等人的（CCS '20），是为单轮设计的，并通过多次重复协议来适应联邦学习环境。Flamingo消除了以前协议每轮设置的需要，并引入了一种新的轻量级的丢弃韧性协议，以确保在客户端在求和过程中离开时，服务器仍然可以获得有意义的结果。此外，Flamingo引入了一种新的本地方式来选择Bell等人所介绍的所谓的客户端邻域。这些技术有助于Flamingo减少客户端与服务器之间的交互次数，从而大大减少了整个训练过程的运行时间。\n\n我们实现并评估了Flamingo，并展示了它可以在（扩展的）MNIST和CIFAR-100数据集上安全地训练神经网络，与非私有联邦学习系统相比，模型收敛而不损失准确性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2C：SMC\\FLUTE：Fast and Secure Lookup Table Evaluations.pdf": {
        "title": "FLUTE：Fast and Secure Lookup Table Evaluations",
        "abstract": "使用查找表（Lookup Tables，LUTs）而不是布尔电路的概念是众所周知的，并且已经广泛应用于各种应用领域，包括可编程逻辑器件（FPGAs）、图像处理和数据库管理系统。在密码学中，使用这种LUTs而不是传统的AND和XOR门可以得到更紧凑的电路，并且已经证明在安全多方计算评估中可以显著提高在线性能。最近几项关于安全浮点计算和隐私保护机器学习推断的研究工作都严重依赖现有的LUT技术。然而，它们要么在设置阶段有很大的开销，要么在线性能不佳。\n\n我们提出了一种名为FLUTE的新型安全LUT评估协议，具有良好的设置和在线性能。在双方设置中，我们展示了FLUTE与所有以前方法相比具有相同甚至更好的在线性能，同时在整体性能方面与最佳的以前LUT协议相竞争。此外，我们提供了使用Rust编程语言编写的FLUTE的开源实现，以及ABY2.0和silent OT的布尔安全双方计算协议的实现。我们发现FLUTE在在线阶段的性能比现有技术提高了两个数量级，同时保持了类似的总体通信。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2C：SMC\\RoFL：Robustness of Secure Federated Learning.pdf": {
        "title": "RoFL：Robustness of Secure Federated Learning",
        "abstract": "虽然近年来已经发生了许多揭示联邦学习中严重漏洞的攻击，但对于这些攻击的原理以及如何有效地减轻这些攻击的理解仍然不足。在这项工作中，我们揭示了现有（有针对性的）攻击的内部工作原理。我们对为什么这些攻击可能发生以及为什么联邦学习的鲁棒性问题难以解决提供了新的见解。我们展示了机器学习算法需要记忆尾数据对于联邦学习的完整性具有重大影响。这一现象主要在隐私的背景下进行了研究；我们的分析阐明了它对机器学习完整性的影响。我们展示了通过强制约束，如对客户端更新的范数限制，可以有效地减轻某些类别的严重攻击。我们研究了如何在单服务器环境中将这些约束有效地纳入安全的联邦学习协议中。基于此，我们提出了RoFL，一种新的安全联邦学习系统，它通过保护隐私的输入验证来扩展安全聚合。具体而言，RoFL可以对高维度加密模型更新施加L2和L∞上界等约束。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2C：SMC\\SoK：Cryptographic Neural-Network Computation.pdf": {
        "title": "SoK：Cryptographic Neural-Network Computation",
        "abstract": "我们在2016年至2022年期间研究了53篇基于密码学的隐私保护神经网络论文（不包括可信处理器或差分隐私），其中有16篇只使用同态加密，19篇使用安全计算进行推理，18篇使用非勾结服务器（其中12篇支持训练），解决了各种研究问题。我们剖析了它们的密码技术并探讨了它们与机器学习的“爱恨关系”，并通过一个家谱突出了值得注意的发展。我们还重新评估了WAN环境下的最新技术水平。我们希望这可以作为一个指南，连接相关领域的不同专家。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2C：SMC\\Vectorized Batch Private Information Retrieval.pdf": {
        "title": "Vectorized Batch Private Information Retrieval",
        "abstract": "本文研究了批量私有信息检索（Batch Private Information Retrieval，BatchPIR），这是私有信息检索（PIR）的一种变体，其中客户端希望一次从服务器检索多个条目。BatchPIR适用于许多实际应用场景，并且在每次查询的摊销成本方面具有大幅度的效率改进潜力。现有的BatchPIR方案在计算效率上取得了不错的成果，但在通信效率方面却没有得到任何改进。通过使用向量化同态加密，我们提出了一种在多种数据库配置下既高效又高效的BatchPIR协议。具体而言，对于一个包含一百万条每个条目为256字节的数据库，从中检索256个条目的批量数据，我们的方案的通信成本比现有的解决方案要好7.5倍到98.5倍。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3A：Authentication\\'In Eighty Percent of the Cases, I Select the Password for Them'：Security and Privacy Challenges, Advice, and Opportunities at Cybercafes in Kenya.pdf": {
        "title": "'In Eighty Percent of the Cases, I Select the Password for Them'：Security and Privacy Challenges, Advice, and Opportunities at Cybercafes in Kenya",
        "abstract": "在发展中国家，网络咖啡馆仍然是访问互联网的一种受欢迎的方式，因为很多用户仍然没有个人电脑。随着政府服务的数字化，例如在肯尼亚，很多用户转向网络咖啡馆来访问必要的服务。许多这些用户可能从未使用过计算机，并且在网络咖啡馆面临着重大的安全和隐私问题。然而，这些挑战以及提供的建议仍然很少被探索。我们通过36个半结构化访谈（其中14个是与网络咖啡馆经理的访谈，22个是与顾客的访谈）调查了肯尼亚网络咖啡馆经营者提供的安全建议和支持，以及面临的挑战。我们发现，网络咖啡馆通过提供打印和政府服务，在肯尼亚发挥着至关重要的作用。然而，大多数顾客在使用计算机方面面临着挑战，同时在账户创建和密码管理方面也存在安全性和可用性问题。为了解决这个问题，顾客通常依赖网络咖啡馆经理的支持和建议，他们通常指导顾客使用易记的密码，例如仅使用他们的身份证号码或姓名。一些经理直接管理顾客的密码，甚至有一个经理为所有顾客使用相同的密码。这些结果表明，有必要提高关于基于手机的密码管理器的意识，以及在这些用户中进行计算机培训和安全意识。还需要探索超越西方外围的安全和隐私建议，以支持更广泛的人群。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3A：Authentication\\Confident Monte Carlo：Rigorous Analysis of Guessing Curves for Probabilistic Password Models.pdf": {
        "title": "Confident Monte Carlo：Rigorous Analysis of Guessing Curves for Probabilistic Password Models",
        "abstract": "在密码安全中，防御者希望识别和警告使用弱密码的用户。同样，防御者可能还希望预测在攻击者的猜测预算B从小（在线攻击者）变化到大（离线攻击者）时，有多少密码会被破解。为了实现这些目标，防御者希望快速估计每个用户密码的猜测次数，假设攻击者使用密码破解模型M，即在攻击者破解每个用户密码之前，他/她将检查多少个密码猜测。由于当猜测次数非常大时，朴素的穷举法可能会非常昂贵，Dell'Amico和Filippone [1]开发了一种高效的蒙特卡罗算法来估计给定密码的猜测次数。尽管Dell'Amico和Filippone证明了他们的估计值是无偏的，但并不能保证蒙特卡罗估计的准确性，也不能提供对估计的猜测次数的置信区间，甚至不能指示是否/何时存在更高程度的不确定性。\n\n我们的贡献如下：首先，我们识别出理论上的例子，其中蒙特卡罗强度估计很可能产生高度不准确的个体猜测数以及整个猜测曲线的估计。其次，我们引入了可靠的蒙特卡罗强度估计，作为Dell'Amico和Filippone [1]的扩展。给定一个密码，我们的估计器生成一个上界和一个下界，并保证除了概率δ之外，真正的猜测次数在给定的置信区间内。我们的技术还可以用于描述攻击者的猜测曲线。特别是，给定一个概率性密码破解模型M，我们可以生成对攻击者将破解的密码比例的高置信上界和下界，而猜测预算B则会变化。\n\n关键词 - 蒙特卡罗估计，密码破解模型，集中度边界"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3A：Authentication\\Investigating the Password Policy Practices of Website Administrators.pdf": {
        "title": "Investigating the Password Policy Practices of Website Administrators",
        "abstract": "密码是当前在线身份验证的事实标准，并且在可预见的未来可能会保持这种地位。因此，安全社区已经广泛研究了用户在使用密码时的行为，提出了促进密码安全和用户可用性的密码政策建议。然而，网站管理员必须采纳这些建议来实施改进在线身份验证的措施。至今为止，对于网站管理员如何管理其网站的密码政策的调查有限。为了在规模上改善在线身份验证，我们必须了解这个特定人群的行为和决策背后的因素，以及如何帮助管理员部署更安全的密码政策。\n\n在本文中，我们探讨了网站管理员确定所采用的密码政策的方法，哪些考虑因素会影响政策的演变，以及管理员在管理网站政策时遇到的挑战。为此，我们进行了一个在线调查，并对11名有直接管理网站密码政策经验的美国网站管理员进行了深入的半结构化访谈。通过我们的定性研究，我们确定了一小部分关键因素，这些因素在大多数密码政策决策中起到了推动作用，以及阻碍管理员执行更符合现代指南的政策的障碍。展望未来，我们提出了未来研究和社区行动的方向，可以帮助管理员更有效地管理密码政策。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3A：Authentication\\Not Yet Another Digital ID：Privacy-Preserving Humanitarian Aid Distribution.pdf": {
        "title": "Not Yet Another Digital ID：Privacy-Preserving Humanitarian Aid Distribution",
        "abstract": "人道主义援助分发计划有助于将物资送到需要的人们手中。传统的纸质解决方案无法适应大规模人口，并且难以确保安全。现有的数字解决方案虽然解决了这些问题，但需要收集大量的个人信息。这种缺乏隐私可能会危及受援者的安全并损害他们的尊严。我们与国际红十字会合作，构建了一个安全的数字援助分发系统。我们首先系统化地概述了这样一个系统应该满足的要求。然后，我们提出了一个基于代币的分散解决方案，满足人道组织的需求。它具有可扩展性和强大的问责制，并通过设计保证了受援者的隐私。我们提供了我们设计的两个实例，在智能卡和智能手机上。我们对这些解决方案的安全性和隐私性进行了形式化证明，并通过实证结果表明它们可以在大规模运行。\n索引词-隐私保护技术，隐私工程，人道主义援助分发"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3A：Authentication\\Towards a Rigorous Statistical Analysis of Empirical Password Datasets.pdf": {
        "title": "Towards a Rigorous Statistical Analysis of Empirical Password Datasets",
        "abstract": "密码安全中的一个核心挑战是描述攻击者的猜测曲线，即攻击者在前G次猜测中破解一个随机用户密码的概率是多少。一个关键的挑战是，猜测曲线取决于攻击者的猜测策略和用户密码的分布，而这两者对我们来说都是未知的。在这项工作中，我们旨在遵循Kerckhoffs的原则，并分析一个知道密码分布的最优攻击者的性能。设λG表示这样一个攻击者能够在G次猜测中破解一个随机用户密码的概率。我们开发了几种统计严格的技术，通过从未知密码分布P中获取N个独立样本来上下界λG。我们证明了我们对λG的上下界具有高置信度，并应用我们的技术来分析八个大型密码数据集。我们的实证分析表明，即使是最先进的密码破解模型在猜测效率上也往往明显低于一个可以根据它对密码分布的（部分）了解来优化攻击的攻击者。我们还应用我们的统计工具重新检验了密码分布的不同模型，即经验密码分布和Zipf定律。我们发现，当猜测数G不太大时，经验分布与我们对λG的上下界非常接近，即G≪N。然而，对于较大的G值，我们的实证分析严格证明了经验分布（或Zipf定律）高估了攻击者的成功率。我们应用我们的统计技术来上下界密码节流机制（键拉伸）的有效性，该机制用于减少攻击者的猜测数G。最后，如果我们愿意对用户对密码限制的响应方式做出额外的假设，我们可以使用我们的统计技术来评估各种限制用户选择密码的密码组成策略的有效性。\n关键词：密码分布，密码破解，密码数据集，理论界限，统计分析，密码策略"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3B：Machine learning backdoors\\AI-Guardian：Defeating Adversarial Attacks using Backdoors.pdf": {
        "title": "AI-Guardian：Defeating Adversarial Attacks using Backdoors",
        "abstract": "深度神经网络（DNN）由于其日益提高的准确性，在许多领域被广泛使用。然而，它们也容易受到对抗性攻击的影响，对自动驾驶、远程诊断等安全关键应用构成严重威胁。现有的解决方案在检测/防止此类攻击方面存在限制，并且还会影响原始任务的性能。在本文中，我们提出了一种新颖的方法来对抗对抗性攻击，该方法利用有意嵌入的后门来防止对抗性扰动并保持原始主任务的性能。我们广泛评估了AI-Guardian，使用了五种常用的对抗性示例生成方法，并实验结果证明了其在对抗性攻击方面的有效性。具体而言，AI-Guardian将攻击成功率从97.3%降低到3.2%，超过了现有最先进的作品30.9%，仅在清洁数据准确性上下降了0.9%。此外，AI-Guardian对模型预测时间仅引入了0.36%的额外开销，在大多数情况下几乎可以忽略不计。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3B：Machine learning backdoors\\BayBFed：Bayesian Backdoor Defense for Federated Learning.pdf": {
        "title": "BayBFed：Bayesian Backdoor Defense for Federated Learning",
        "abstract": "联邦学习（FL）是一种新兴的技术，它允许参与者在不与他人共享私人数据的情况下共同训练机器学习模型。然而，FL容易受到后门攻击等污染攻击的影响。因此，最近提出了各种防御方法，主要利用全局模型的中间状态（即logits）或本地模型与全局模型的距离（即L2范数）来检测FL中的恶意后门。然而，由于这些方法直接操作客户端更新（或权重），它们的有效性取决于客户端数据分布或对手的攻击策略等因素。在本文中，我们引入了一种新颖且更通用的后门防御框架，称为BayBFed，它提出利用客户端更新的概率分布来检测FL中的恶意更新：BayBFed计算客户端更新的概率度量，以跟踪更新中的任何调整，并使用一种新颖的检测算法，可以利用这个概率度量高效地检测和过滤恶意更新。因此，它克服了以前方法的缺点，这些缺点是由于直接使用客户端更新而引起的；然而，我们的概率度量将包括本地客户端训练策略的所有方面。BayBFed利用了两种贝叶斯非参数（BNP）扩展：（i）层次贝塔伯努利过程，用于根据客户端更新生成概率度量，以及（ii）中文餐馆过程（CRP）的改进，我们称之为CRP-Jensen，它利用这个概率度量来检测和过滤恶意更新。我们在五个基准数据集上对我们的防御方法进行了广泛评估：CIFAR10，Reddit，物联网入侵检测，MNIST和FMNIST，并展示了它可以有效地检测和消除FL中的恶意更新，同时不影响全局模型的良好性能。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3B：Machine learning backdoors\\Disguising Attacks with Explanation-Aware Backdoors.pdf": {
        "title": "Disguising Attacks with Explanation-Aware Backdoors",
        "abstract": "可解释的机器学习具有分析和理解基于学习的系统的巨大潜力。然而，这些方法可以被操纵以呈现不忠实的解释，从而产生强大而隐秘的对手。在本文中，我们展示了如何完全伪装机器学习模型的对手操作。类似于神经后门，我们改变了模型对触发器存在的预测，但同时欺骗了后期应用于分析的解释方法。这使得对手能够隐藏触发器的存在或将解释指向输入的完全不同部分，从而引入一个误导。我们在图像领域分析了这些解释感知后门的不同表现形式，包括基于梯度和传播的解释方法，然后继续进行了针对恶意软件分类的误导攻击。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3B：Machine learning backdoors\\Jigsaw Puzzle：Selective Backdoor Attack to Subvert Malware Classifiers.pdf": {
        "title": "Jigsaw Puzzle：Selective Backdoor Attack to Subvert Malware Classifiers",
        "abstract": "恶意软件分类器在训练时容易受到攻击，因为需要定期重新训练，使用从野外收集的样本。最近的研究表明，对恶意软件分类器进行后门攻击是可行的，但这种攻击的隐蔽性还不太清楚。本文重点研究Android恶意软件分类器，并在清洗标签设置下进行后门攻击的调查（即攻击者对训练过程或污染数据的标记没有完全控制）。从实证上看，我们展示了现有的对恶意软件分类器的后门攻击仍然可以被最新的防御技术（如MNTD）检测到。为了提高隐蔽性，我们提出了一种新的攻击方法，Jigsaw Puzzle（JP），基于这样一个关键观察：恶意软件作者几乎没有动机去保护其他作者的恶意软件。因此，Jigsaw Puzzle学习一个触发器来补充恶意软件作者样本中的潜在模式，并且只有当触发器和潜在模式在一个样本中拼接在一起时才激活后门。我们进一步研究了问题空间（例如软件代码）中可实现的触发器，使用从良性软件中广泛收集的字节码工具。我们的评估确认了Jigsaw Puzzle作为一个后门的有效性，它对最先进的防御技术仍然具有隐蔽性，并且在与仅考虑特征空间攻击的现实设置中构成威胁。最后，我们探讨了改进后门防御的有希望的方法。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3B：Machine learning backdoors\\Redeem Myself：Purifying Backdoors in Deep Learning Models using Self Attention Distillation.pdf": {
        "title": "Redeem Myself：Purifying Backdoors in Deep Learning Models using Self Attention Distillation",
        "abstract": "最近的研究揭示了深度神经网络对后门攻击的脆弱性，其中一个带有后门的模型在触发器激活时进行有针对性或无针对性的错误分类。一系列净化方法（例如，精修剪、神经注意力转移、MCR [69]）已经被提出来消除模型中的后门。然而，它们要么无法降低更先进的后门攻击的成功率，要么会大幅降低模型对干净样本的预测能力。在本文中，我们提出了一个新的净化防御框架，名为SAGE，它利用自注意力提炼来清除模型中的后门。与传统的注意力转移机制需要一个教师模型监督提炼过程不同，SAGE可以通过少量的干净样本实现自净化。为了增强防御性能，我们进一步提出了一种动态学习率调整策略，通过精确追踪干净样本的预测准确度来指导学习率的调整。我们将SAGE与6种最先进的防御方法在4个数据集上对抗8种后门攻击的防御性能进行比较。结果表明，SAGE可以将攻击成功率降低多达90%，而对于干净样本的预测准确度仅下降不到3%。我们将在发表后开源我们的代码。\n\n索引词 —后门攻击，后门防御，自注意力提炼，深度神经网络。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3C：Cryptographic protocols\\MPCAuth：Multi-factor Authentication for Distributed-trust Systems.pdf": {
        "title": "MPCAuth：Multi-factor Authentication for Distributed-trust Systems",
        "abstract": "基于分布式信任的系统引起了越来越多的研究关注，并得到了越来越多的行业采用。在这些系统中，关键的秘密被分布在N个服务器上，并且使用安全多方计算（SMPC）进行私密计算。这些分布式信任系统面临着两个挑战。第一个挑战是易用性。也就是说，一个认证协议如何在不牺牲安全性的情况下保持用户体验？为了避免中心攻击点，客户端需要分别对每个服务器进行身份验证。然而，这将需要客户端对每个认证因素进行N次身份验证，这严重影响了可用性。第二个挑战是隐私性，因为客户端的敏感配置文件现在暴露给了所有N个服务器，这为配置文件数据创建了N倍的攻击面。我们提出了MPCAuth，这是一个用于分布式信任应用的多因素认证系统，可以解决这两个挑战。我们的系统使得客户端只需要进行一次认证就可以独立地对N个服务器进行身份验证。此外，我们的系统具有配置文件隐藏功能，这意味着除非所有服务器都被攻破，否则不会透露客户端的认证配置文件，如电子邮件用户名、电话号码、密码和生物特征。我们提出了安全且实用的协议，用于一系列广泛采用的认证因素，包括电子邮件密码、短信验证码、U2F、安全问题/密码和生物特征。我们的系统在加密货币托管和协作机器学习领域有实际应用，并将有益于未来分布式信任应用的采用。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3C：Cryptographic protocols\\Private Access Control for Function Secret Sharing.pdf": {
        "title": "Private Access Control for Function Secret Sharing",
        "abstract": "函数秘密共享（FSS; Eurocrypt 2015）允许一个经销商与两个或更多的评估者共享一个函数f。给定函数f的秘密共享，评估者可以在本地计算任何输入x的f(x)的秘密共享，而不会在过程中了解有关f的信息。\n\n在本文中，我们开始研究FSS的访问控制。给定f的共享，评估者可以确保经销商有权共享所提供的函数。对于一个函数族F和一个定义在该族上的访问控制列表，接收f∈ F的共享的评估者可以有效地检查经销商是否知道f的访问密钥。这个模型使得FSS能够有新的应用，比如：（1）在多方环境中的匿名认证，（2）私有数据库中的访问控制，以及（3）匿名通信系统中的身份验证和垃圾邮件预防。\n\n我们的定义和构造抽象并改进了几个最近实现临时机制对FSS进行访问控制的具体效率。我们提高效率的主要构建模块是一个离散对数零知识证明，证明了对于秘密共享元素的知识，这可能是一个独立的研究兴趣。\n\n我们评估我们的构造，并展示了与在匿名通信中使用的现有访问控制技术相比，计算开销的50-70倍减少。在其他应用中，比如私有数据库，引入访问控制的处理成本只有...（原文未给出具体数值）。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3C：Cryptographic protocols\\Silph：A Framework for Scalable and Accurate Generation of Hybrid MPC Protocols.pdf": {
        "title": "Silph：A Framework for Scalable and Accurate Generation of Hybrid MPC Protocols",
        "abstract": "-金融和医疗保健领域的许多应用需要访问来自多个组织的数据。尽管这些组织可以通过对共同数据集进行计算来获益，但由于监管限制和商业竞争，它们通常无法彼此共享数据。不相信对方的各方可以通过使用安全多方计算（MPC）在不明文共享数据的情况下进行合作。然而，MPC的性能对于缺乏高级加密专业知识的用户来说是一个严重的障碍。在本文中，我们提出了Silph，一个可以自动将高级语言编写的程序编译成优化的混合MPC协议的框架，该框架可以安全而高效地混合多个MPC原语。与以前的工作相比，我们的编译速度提高了多达30000倍。在各种数据库分析和机器学习工作负载上，由Silph生成的MPC协议与以前的工作相匹配或优于以前的工作多达3.6倍。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3C：Cryptographic protocols\\Threshold BBS+ Signatures for Distributed Anonymous Credential Issuance.pdf": {
        "title": "Threshold BBS+ Signatures for Distributed Anonymous Credential Issuance",
        "abstract": "我们提出了一种安全的多方签名协议，适用于BBS+签名方案；换句话说，这是一个具有阈值签发的匿名凭证方案。我们证明，由于BBS+签名的结构，仅仅验证由一个半诚实的协议产生的签名就足以实现对恶意对手的组合安全。因此，我们的协议非常简单和高效：它包括客户端（需要签名）向签名方发出的一个请求，签名方之间进行两次消息交换，最后向客户端发送响应；在某些部署场景中，具体的成本瓶颈可能是客户端对接收到的签名进行本地验证。此外，我们的协议可以扩展支持最强形式的盲签名，并用作Dodis-Yampolskiy Oblivious VRF的分布式评估协议。我们通过实施和基准测试我们的协议来验证我们的高效性声明。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 3C：Cryptographic protocols\\zk-creds：Flexible Anonymous Credentials from zkSNARKs and Existing Identity Infrastructure.pdf": {
        "title": "zk-creds：Flexible Anonymous Credentials from zkSNARKs and Existing Identity Infrastructure",
        "abstract": "经常情况下，网络用户需要证明自己不是机器人，已经达到访问年龄限制视频的年龄，或者有资格在本地公共图书馆下载电子书而不被追踪。匿名凭证被开发出来以解决这些问题。然而，现有的方案无法处理实际部署的实际情况或复杂的现实身份问题。相反，它们隐含地假设存在一个匿名凭证的发行机构，而对于实际应用来说，这需要当地的交通部门发行复杂的加密令牌来证明用户已经年满18岁。实际上，一个给定身份属性有多个信任来源，它们的凭证具有明显不同的格式，并且许多甚至全部发行者不愿意采用新的协议。\n\n我们介绍并构建了zk-creds，这是一个使用通用零知识证明的协议，通过以下方式解决了问题：1) 消除了凭证发行机构持有签名密钥的需要：凭证可以发行给作为透明日志、拜占庭系统甚至区块链的公告板；2) 将现有身份文件转化为匿名凭证，而无需修改文件或与发行机构协调；3) 允许在多个凭证上进行灵活、可组合和复杂的身份声明。具体而言，使用zk-creds的身份断言在使用护照匿名访问年龄限制视频的实际场景中只需不到150毫秒。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4A：Biometric security\\Breaking Security-Critical Voice Authentication.pdf": {
        "title": "Breaking Security-Critical Voice Authentication",
        "abstract": "语音验证（V A）最近已成为许多安全关键操作的重要组成部分，例如银行交易和呼叫中心对话。自动说话者验证系统（ASVs）对欺骗攻击的脆弱性促使了对策（CMs）的开发，其任务是区分真实和伪造的语音。ASVs和CMs共同构成了当今的V A系统，并被宣传为一种坚不可摧的访问控制机制。我们开发了对欺骗对策的第一个实用攻击，并演示了恶意行为者如何有效地针对这些防御手段来制作音频样本。以前针对V A的对抗攻击主要是针对白盒场景设计的，即假设了对系统内部的了解，或者需要大量的查询和时间预算来发动特定目标的攻击。然而，这些假设在攻击安全关键系统时并不成立。相反，我们的攻击针对所有欺骗对策共同存在的失败点，使其成为实时、模型不可知、完全黑盒的攻击，无需与目标交互来制作攻击样本。我们的工作的关键信息是，CMs错误地学习了根据容易识别和伪造的线索来区分伪造和真实音频。我们的攻击效果足够微妙，以确保这些对抗样本仍然可以绕过ASV并保留其原始文本内容。这些属性的结合使得这种强大的攻击可以绕过最严格形式的安全关键V A，仅需6次尝试即可达到高达99%的成功率。最后，我们进行了对CMs的第一个针对电信网络的定向攻击，绕过了几个已知的挑战，为各种潜在威胁提供了可能性，考虑到呼叫中心中声音生物特征的增加使用。我们的结果对现代V A系统的安全性提出了质疑，并敦促用户在面对攻击者绕过这些措施获取他们最宝贵资源的真实威胁时重新思考他们对这些系统的信任。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4A：Biometric security\\DepthFake：Spoofing 3D Face Authentication with a 2D Photo.pdf": {
        "title": "DepthFake：Spoofing 3D Face Authentication with a 2D Photo",
        "abstract": "人脸认证已经广泛应用于门禁控制，最新的3D人脸认证系统采用3D活体检测技术来应对照片重放攻击，即攻击者使用2D照片绕过认证。本文分析了利用结构光深度相机的3D活体检测系统的安全性，并发现了一种新的针对3D人脸认证系统的攻击方法。我们提出了DepthFake攻击，可以仅使用一张2D照片欺骗3D人脸认证。为了实现这个目标，DepthFake首先从目标受害者的2D照片中估计出其脸部的3D深度信息。然后，DepthFake将嵌入有脸部深度信息的精心制作的散射图案投影出来，以赋予2D照片具有3D认证属性。我们克服了一系列实际挑战，例如来自2D照片的深度估计误差，基于结构光的深度图像伪造，面部的RGB图像和深度图像的对齐，并在实验室环境中实施了DepthFake。我们在3个商业人脸认证系统（腾讯云、百度云和3DiVi）和一个商业门禁设备上验证了DepthFake。50名用户的结果表明，DepthFake在真实世界中的总体深度攻击成功率为79.4％，RGB-D攻击成功率为59.4％。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4A：Biometric security\\ImU：Physical Impersonating Attack for Face Recognition System with Natural Style Changes.pdf": {
        "title": "ImU：Physical Impersonating Attack for Face Recognition System with Natural Style Changes",
        "abstract": "本文介绍了一种新颖的物理冒充攻击方法，针对面部识别系统。该攻击旨在在不同条件和姿势下生成攻击者多张照片之间的一致风格变化。此外，这些风格变化需要通过化妆在物理上实现，并引发预期的误分类。为了实现这一目标，我们开发了新的技术，将同一物理人的多张照片嵌入到StyleGAN的潜在空间向量中，使得嵌入的潜在向量具有一些隐含的相关性，以便于搜索一致的风格变化。我们的数字和物理评估结果表明，我们的方法可以使外部攻击者成功冒充内部人员，并实现一致且自然的变化。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4A：Biometric security\\SoK：Anti-Facial Recognition Technology.pdf": {
        "title": "SoK：Anti-Facial Recognition Technology",
        "abstract": "近年来，政府和商业实体对面部识别（FR）技术的快速采用引发了对公民自由和隐私的担忧。作为回应，一系列所谓的“反面部识别”（AFR）工具已经被开发出来，以帮助用户避免不必要的面部识别。近几年提出的AFR工具集涉及范围广泛，发展迅速，需要退一步考虑AFR系统的更广泛设计空间和长期挑战。本文旨在填补这一空白，并提供对AFR研究领域的首次全面分析。以面部识别系统的运行阶段为起点，我们创建了一个系统的框架，以分析不同AFR方法的利益和权衡。然后，我们考虑了AFR工具面临的技术和社会挑战，并提出了未来研究的方向。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4A：Biometric security\\Spoofing Real-world Face Authentication Systems through Optical Synthesis.pdf": {
        "title": "Spoofing Real-world Face Authentication Systems through Optical Synthesis",
        "abstract": "面部信息已被用于身份验证目的。最近的面部认证系统利用多模式相机来防止欺骗攻击。多模式相机能够同时从多个物理方面观察目标人员，例如可见光、红外和深度领域。已知的欺骗攻击无法有效规避检测，因为它们无法同时模拟多个模态。\n\n本文介绍了一种新的针对多模式面部认证系统的欺骗攻击。其主要思想是伪造每一种模态，然后将它们组合在一起呈现给相机。该攻击是通过一种特殊的显示设备Hua-pi显示器实现的。它的成本低于500美元，并且集成了专用场景生成器，以光学方式复制经授权用户的多模式场景，然后通过光学合成器将场景合成在相机的视点上，以愚弄面部认证系统。我们通过系统地对该攻击针对该领域主要供应商的最新商业面部认证产品进行测试来评估该攻击的风险。结果不仅展示了80%的成功绕过率，还描述了影响因素及其可行区域，揭示了该领域的新的现实威胁。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4A：Biometric security\\Understanding the (In)Security of Cross-side Face Verification Systems in Mobile Apps：A System Perspective.pdf": {
        "title": "Understanding the (In)Security of Cross-side Face Verification Systems in Mobile Apps：A System Perspective",
        "abstract": "面部验证系统（FVSes）越来越多地被实际的移动应用程序（应用）用于验证用户的身份。一种流行的FVSes类型被称为跨侧FVS（XFVS），它将FVS功能分为两个方面：一个在手机上拍照或录制视频，另一个在可信服务器上进行验证。以往的研究从机器学习的角度研究了XFVSes的安全性，即XFVSes所使用的学习模型是否对敌对攻击具有鲁棒性。然而，XFVSes的其他部分，特别是XFVSes所使用的验证程序的设计和实施，尚未得到很好的理解。在本文中，我们从系统的角度对流行移动应用程序中使用的真实XFVSes的安全性进行了首次的测量研究。具体而言，我们设计和实施了一个名为XFVS检查器（XFVSCHECKER）的半自动化系统，以检测移动应用程序中的XFVSes并检查它们是否符合四个安全属性。我们的评估结果显示，大多数现有的XFVS应用程序，包括那些拥有数十亿下载量的应用程序，都容易受到四种类型攻击中的至少一种攻击。这些攻击只需要易于获取的攻击前提条件之一，例如受害者的一张照片，就可以造成重大的安全风险，包括完全接管账户、身份欺诈和财务损失。我们的发现导致了14个中国国家漏洞数据库（CNVD）ID，并且其中一个ID，特别是CNVD-2021-86899，被评为2021年CNVD报告的所有漏洞中最有价值的漏洞。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4B：Web security\\Fashion Faux Pas：Implicit Stylistic Fingerprints for Bypassing Browsers' Anti-Fingerprinting Defenses.pdf": {
        "title": "Fashion Faux Pas：Implicit Stylistic Fingerprints for Bypassing Browsers' Anti-Fingerprinting Defenses",
        "abstract": "浏览器指纹识别对于研究界和浏览器生态系统仍然是一个特别感兴趣的话题，之前的研究或浏览器已经提出了各种反指纹识别的对策。虽然防止指纹识别是一项具有挑战性的任务，但现代指纹识别技术严重依赖JavaScript API，这创造了一个可以被对策针对的瓶颈。在本文中，我们探讨了如何在不使用任何JavaScript API的情况下生成浏览器指纹。为此，我们开发了StylisticFP，一种新颖的指纹识别系统，它完全依赖于CSS功能并通过精心构建和排列的HTML元素隐含地推断系统特征，包括支持的字体列表等高级指纹识别属性。我们通过实证研究证明了我们的系统对于注重隐私的浏览器（例如Safari，Firefox，Brave，Tor）和流行的隐私保护扩展的有效性。我们还在一个研究机构进行了一项试点研究，发现我们的系统在区分设备方面与最先进的基于JavaScript的指纹识别库相当，同时在应对具有反指纹识别防御的浏览器方面表现出色。我们的工作突显了浏览器指纹识别所带来的显著挑战的另一个维度，并重申了需要更强大的检测系统和对策的需求。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4B：Web security\\It's (DOM) Clobbering Time：Attack Techniques, Prevalence, and Defenses.pdf": {
        "title": "It's (DOM) Clobbering Time：Attack Techniques, Prevalence, and Defenses",
        "abstract": "种不同的攻击技术。我们还发现了导致DOM Clobbering的浏览器行为和易受攻击的代码模式。这种攻击方式还没有得到深入研究，本文是对Web平台上DOM Clobbering状态的首次评估之一。我们首先对现有文献进行了全面调研，然后对19种不同的移动和桌面浏览器进行了动态分析，系统化地总结了DOM Clobbering攻击，揭示了其中的3种不同攻击技术。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4B：Web security\\Only Pay for What You Leak：Leveraging Sandboxes for a Minimally Invasive Browser Fingerprinting Defense.pdf": {
        "title": "Only Pay for What You Leak：Leveraging Sandboxes for a Minimally Invasive Browser Fingerprinting Defense",
        "abstract": "我们提出了一种基于熵的浏览器指纹识别防御系统Sandcastle，旨在最大程度减少其对合法网络应用的干扰。Sandcastle允许开发人员将操作可识别信息的代码分区到沙盒中，以向浏览器证明该信息不会被发送到任何网络请求中。与此同时，沙盒可以充分利用客户端可识别信息，包括写入文档对象模型的专用区域。对于该策略过于严格的应用程序，Sandcastle提供了一个灵活的收银员，可以精确控制泄露到网络中的数据的粒度。这些功能使Sandcastle能够消除Chrome隐私预算框架（熵为基础的指纹识别防御的最新技术）对可识别API输出添加的大部分或全部噪音。通过允许无限制地在客户端使用可识别信息，可以在指纹识别防御下运行更全面的一系列网络应用，例如3D游戏和视频流媒体，并提供了一种扩展可以引入到网络生态系统中的API空间的机制，而无需牺牲隐私保护。关键词：浏览器指纹识别、信息熵、沙盒、k-匿名"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4B：Web security\\Robust Multi-tab Website Fingerprinting Attacks in the Wild.pdf": {
        "title": "Robust Multi-tab Website Fingerprinting Attacks in the Wild",
        "abstract": "网站指纹识别使得窃听者可以确定用户在加密连接上访问的网站。最先进的网站指纹识别（WF）攻击甚至已经证明了对Tor保护的网络流量的有效性。然而，现有的WF攻击在准确识别多标签浏览会话中的网站方面存在重要限制，其中个别网站的整体模式不再被保留，并且客户端打开的标签数是未知的。在本文中，我们提出了一种新颖的多标签WF框架ARES，专门设计用于多标签WF攻击。ARES将多标签攻击构建为一个多标签分类问题，并使用多分类器框架来解决。每个分类器都基于一种新颖的变压器模型设计，利用从多个流量段提取的本地模式来识别特定的网站。我们实现了ARES的原型，并通过我们在多个月内收集的大规模数据集进行了广泛评估（迄今为止在学术论文中研究的最大的多标签WF数据集）。实验结果表明，ARES有效地实现了最佳F1分数为0.907的多标签WF攻击。此外，ARES甚至可以抵御各种WF防御措施的攻击。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10A：Fuzzing\\Finding Specification Blind Spots via Fuzz Testing.pdf": {
        "title": "Finding Specification Blind Spots via Fuzz Testing",
        "abstract": "一份经过正式验证的程序的正确性取决于其规格（SPEC）的准确性。但是如何确保SPEC是完整且没有漏洞的呢？本文提出了FAST（Fuzzing-Assisted Specification Testing）作为一个潜在的答案。关键的洞见是利用和协同利用正式验证程序中的“冗余”和“多样性”进行交叉检查。具体而言，在同一代码库中，SPEC、实现（CODE）和测试套件都是从同一组业务需求中派生出来的。因此，如果在CODE和测试用例中捕捉到某些意图，但在SPEC中没有捕捉到，这就是SPEC存在盲点的强有力指示。\n\nFAST以自动化方式检查SPEC的不完整性问题：它首先通过突变测试来定位SPEC的缺口，即通过检查CODE的变体是否符合原始SPEC来确定。如果是这样，FAST进一步利用测试套件来推断缺口是由意图引入还是由错误引入的。根据代码库的大小，FAST可以选择以枚举或进化的方式生成CODE的变体。\n\nFAST应用于两个具有形式验证特性的开源代码库，并帮助确认它们各自的SPEC中分别存在13个和21个盲点。这凸显了现实世界应用中SPEC不完整性的普遍存在。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10A：Fuzzing\\ODDFuzz：Discovering Java Deserialization Vulnerabilities via Structure-Aware Directed Greybox Fuzzing.pdf": {
        "title": "ODDFuzz：Discovering Java Deserialization Vulnerabilities via Structure-Aware Directed Greybox Fuzzing",
        "abstract": "Java反序列化漏洞是一种实际中严重的威胁。研究人员提出了静态分析解决方案来定位候选漏洞，以及模糊解决方案来生成触发其漏洞的概念验证（PoC）序列化对象。然而，现有解决方案的效果和效率有限。在本文中，我们提出了一种新颖的混合解决方案ODDF UZZ，以有效地发现Java反序列化漏洞。首先，ODDF UZZ执行轻量级静态污点分析来识别可能导致反序列化漏洞的候选gadget链。在这一步骤中，ODDF UZZ尝试定位所有候选对象并避免误报。然后，ODDF UZZ执行定向灰盒模糊测试（DGF）来探索这些候选对象并生成PoC测试用例以减少误报。具体而言，ODDF UZZ采用结构感知的种子生成方法来保证测试用例的有效性，并采用一种新颖的混合反馈和向前策略来指导定向模糊测试。我们实现了ODDF UZZ的原型，并在流行的Java反序列化存储库ysoserial上进行了评估。结果显示，ODDF UZZ可以发现34个已知gadget链中的16个，而两个最先进的基线只能识别其中三个。此外，我们还在包括Oracle WebLogic Server、Apache Dubbo、Sonatype Nexus和protostuff在内的实际应用程序上评估了ODDF UZZ，并发现了六个以前未报告的可利用的gadget链，其中五个已被分配CVE编号。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10A：Fuzzing\\SelectFuzz：Efficient Directed Fuzzing with Selective Path Exploration.pdf": {
        "title": "SelectFuzz：Efficient Directed Fuzzing with Selective Path Exploration",
        "abstract": "定向灰盒模糊测试器专门用于测试特定的目标代码。它们已被应用于许多安全应用程序，如重现已知崩溃和检测由不完整的补丁引起的漏洞。然而，现有的定向模糊测试器倾向于发现新代码，而不管新发现的代码与目标代码是否相关。因此，模糊测试器会大量探索不相关的代码，并且效率低下。\n\n在本文中，我们区分了目标程序中的相关代码和不相关代码，后者不会触发目标代码中的漏洞。我们提出了一种新的定向模糊测试器SELECT FUZZ，它选择性地探索相关程序路径，以实现高效的崩溃重现和漏洞检测。它识别了两种类型的相关代码——路径分叉代码和数据依赖代码，分别捕捉了与目标代码的控制和数据依赖关系。然后，它选择性地对相关代码块进行仪器化和探索。我们还提出了一种新的距离度量标准，准确地衡量了不同程序路径和输入的到达概率。\n\n我们使用各种程序集中的真实漏洞评估了SELECT FUZZ。SELECT FUZZ的性能比基准定向模糊测试器提高了高达46.31倍，并在Google Fuzzer测试套件中表现最好。我们的实验证明SELECT FUZZ和现有的技术（如路径修剪）是互补的。最后，通过SELECT FUZZ，我们在经过充分测试的真实软件中发现了14个以前未知的漏洞，其中包括6个新的CVE ID。我们的报告导致了对11个漏洞的修复。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10A：Fuzzing\\Toss a Fault to Your Witcher：Applying Grey-box Coverage-Guided Mutational Fuzzing to Detect SQL and Command Injection Vulnerabilities.pdf": {
        "title": "Toss a Fault to Your Witcher：Applying Grey-box Coverage-Guided Mutational Fuzzing to Detect SQL and Command Injection Vulnerabilities",
        "abstract": "- 黑盒式网络应用程序漏洞扫描器旨在在没有访问源代码的情况下自动识别网络应用程序中的漏洞。然而，它们通过使用手动策划的漏洞诱导输入列表来实现这一目标，这显著降低了黑盒扫描器对网络应用程序输入空间的探索能力，并可能导致误报漏洞。此外，黑盒扫描器必须试图推断是否触发了漏洞，这会导致误报漏洞。\n为了克服这些限制，我们提出了一种新颖的Web漏洞发现框架Witcher，其受到灰盒式覆盖引导模糊测试的启发。Witcher实现了故障升级的概念，以检测SQL和命令注入漏洞。此外，Witcher捕获覆盖信息并创建输出导向的输入指导，以便集中输入生成，从而增加了对Web应用程序的状态空间探索。在一个包含18个使用PHP、Python、Node.js、Java、Ruby和C编写的Web应用程序的数据集上，其中13个已知存在漏洞，Witcher能够发现36个已知漏洞中的23个（64%），并且还发现了67个以前未知的漏洞，其中4个获得了CVE编号。在我们的实验中，Witcher在发现漏洞数量和覆盖网络应用程序方面均优于现有技术的扫描器。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10A：Fuzzing\\UTopia：Automatic Generation of Fuzz Driver using Unit Tests.pdf": {
        "title": "UTopia：Automatic Generation of Fuzz Driver using Unit Tests",
        "abstract": "——Fuzzing可以说是在软件中检测安全漏洞最实用的方法，但采用此方法需要付出相当大的努力。为了有效实施fuzzing，首先需要制定高质量的fuzz驱动程序，其中包含可以详尽探索程序状态的适当API序列。为了减轻这一负担，现有解决方案尝试通过推断消费者代码（即API的实际使用）中的有效API序列或直接从示例执行中提取API序列来生成fuzz驱动程序。然而，所有现有方法都存在一个共同问题：观察到的API序列，无论是静态推断还是动态监测，都与自定义应用逻辑混在一起。然而，我们观察到，单元测试是由API的实际设计者精心编写的，用于验证其正确使用，并且在开发过程中编写单元测试是一种常见做法（例如，超过70％的热门GitHub项目）。\n\n在本文中，我们提出了一个名为UTOPIA的开源工具和分析算法，可以从现有的单元测试中自动合成有效的fuzz驱动程序，几乎不需要人工参与。为了证明其有效性，我们将UTOPIA应用于55个开源项目库，包括Tizen和Node.js，并从8K个符合条件的单元测试中自动生成了5K个fuzz驱动程序。此外，我们在每个核心上执行了大约500万小时的生成的fuzzers，并发现了123个bug。更重要的是，其中2.4K个生成的fuzz驱动程序被采用到了Tizen项目的持续集成过程中，这表明了合成的fuzz驱动程序的质量。所提出的工具和结果已公开提供并进行维护，以便在研究人员和实践者中得到更广泛的采用。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4B：Web security\\Scaling JavaScript Abstract Interpretation to Detect and Exploit Node.js Taint-style Vulnerability.pdf": {
        "title": "Scaling JavaScript Abstract Interpretation to Detect and Exploit Node.js Taint-style Vulnerability",
        "abstract": "解释检测和利用Node.js漏洞的方法\n\n摘要-污点样式漏洞，如操作系统命令注入和路径遍历，是常见且严重的软件弱点。在检测此类漏洞时，存在分析可扩展性和准确性之间的固有权衡。一方面，现有的基于语法的方法通常在动态特性（如括号语法）的分析准确性上做出妥协。另一方面，现有的抽象解释方法往往在抽象域中面临状态爆炸问题，从而导致可扩展性问题。\n\n在本文中，我们提出了一种新颖的方法，称为FAST，通过一种基于两种新技术的抽象解释方法，即自下而上和自上而下的抽象解释，来扩展JavaScript包的漏洞发现。前者基于作用域而不是调用序列来抽象解释函数，以构建动态调用边缘。然后，后者遵循特定的控制流路径，并修剪程序以跳过与漏洞源无关的语句。如果找到完整的数据流路径，FAST会查询路径上约束的可满足性并验证其可利用性，以减少人力投入。\n\n我们实现了FAST的原型，并针对真实的Node.js包进行评估。我们展示了FAST能够在NPM中发现242个零日漏洞，并分配了21个CVE标识符。我们的评估还显示，FAST可以应用于真实的应用程序，如NodeBB和流行的框架total.js和strapi，以发现之前没有任何工作能够发现的遗留漏洞。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4B：Web security\\SoK：A Critical Evaluation of Efficient Website Fingerprinting Defenses.pdf": {
        "title": "SoK：A Critical Evaluation of Efficient Website Fingerprinting Defenses",
        "abstract": "最近的网站指纹攻击已经显示出对通过Tor的流量具有非常高的性能。这些攻击允许敌对方通过简单地窃听加密通信来推断Tor用户所访问的网站。这从而促使了许多通过添加虚假数据包和/或延迟来混淆流量的防御策略的发展。然而，这些最新提议的有效性和实用性尚未详细审查。在本研究中，我们重新评估了九个最近的防御提议，它们声称使用最新的基于深度学习的攻击提供了足够的安全性和低开销。此外，我们评估了在Tor当前限制下实施这些防御的可行性。为此，我们还提供了DynaFlow防御的首个网络内实施，以更好地评估其在实际应用中的效用。\n关键词-网站指纹识别；防御；隐私；匿名系统；深度学习；"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4C：Cryptographic proof techniques\\AUC：Accountable Universal Composability.pdf": {
        "title": "AUC：Accountable Universal Composability",
        "abstract": "责任制是一个既成且广泛使用的安全概念，可以通过获取不可否认的加密证据来激励诚实行为。已经存在几个通用的账户制度框架用于形式化基于游戏的安全分析。不幸的是，这些基于游戏的框架不支持模块化的安全分析，而这是处理现代协议复杂性的重要工具。\n\n通用可组合性（UC）模型为模块化分析提供了本地支持，包括安全结果的重用和组合。到目前为止，责任制主要在UC模型中针对MPC协议的特殊情况进行建模和分析，但还缺乏一个通用的UC责任制框架。也就是说，需要一个框架来支持任意协议、广泛的责任制属性、处理和混合可追究和不可追究的安全属性，并对可追究协议进行模块化分析。\n\n为了填补这一空白，我们提出了AUC，这是第一个通用的UC模型责任制框架，基于几个新概念来支持上述所有内容。我们通过三个现有研究未涉及的案例研究来说明AUC的应用。特别是，AUC将现有的UC责任制方法统一到一个框架中。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4C：Cryptographic proof techniques\\High-Order Masking of Lattice Signatures in Quasilinear Time.pdf": {
        "title": "High-Order Masking of Lattice Signatures in Quasilinear Time",
        "abstract": "近年来，基于格的签名方案已经成为最突出的后量子解决方案，如NIST对Falcon和Dilithium的选择所示。这两种方案都具有良好的性能特征。然而，在存在侧信道保护的情况下，它们的效率会下降，特别是掩码技术——可能是最强大的通用侧信道对策。d-1阶掩码需要将所有敏感的中间变量随机分成d份。在现有方案中，签名生成的复杂性随着份额数量的增加而呈二次增长，使高阶掩码变得过于缓慢。\n\n本文将问题颠倒过来：我们设计了一种专门用于抵抗侧信道攻击的基于格的签名方案，并优化了其掩码效率与份额数量之间的关系。我们的设计避免了昂贵的操作，如算术和布尔编码之间的转换（A2B/B2A），掩码拒绝抽样，并且不需要掩码SHAKE实现或其他对称原语。得到的方案被称为Raccoon，属于Fiat-Shamir中止型基于格的签名家族。Raccoon是第一个密钥生成和签名运行时间只有O(d log(d))开销的基于格的签名方案，其中d是份额数量。\n\n我们的C语言参考实现证实了Raccoon的性能与其他最先进的签名方案相当，唯一不同的是份额数量的增加对其延迟具有接近线性的影响。我们还提供了FPGA实现，并进行了物理泄露评估以验证其基本安全性质。\n\n索引词——后量子密码学，侧信道安全，掩码对策，Raccoon签名。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4C：Cryptographic proof techniques\\Less is more：refinement proofs for probabilistic proofs.pdf": {
        "title": "Less is more：refinement proofs for probabilistic proofs",
        "abstract": "在过去的十年中，对概率证明（IPs、SNARKs、PCPs等）的实现引起了极大的关注：这些协议可以使一个不受信任的参与方向验证者证明一个给定的计算被正确执行，可能是以零知识的方式。然而，尽管如此，这些实现仍然无法扩展到大规模的计算。一个主要的开销来源是前端：将抽象的计算转换为一组等效的算术约束。本文介绍了一个通用的框架，称为Distiller，其中用户将抽象规范转换为约束，而不是原始计算。Distiller是该领域中第一个以可以被证明安全的方式进行这种转换的工具。此外，通过将“在约束中编码一个检查”的思想推向极致，Distiller揭示了许多新的约束减少的机会，从而降低了基准计算的成本。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4C：Cryptographic proof techniques\\Owl：Compositional Verification of Security Protocols via an Information-Flow Type System.pdf": {
        "title": "Owl：Compositional Verification of Security Protocols via an Information-Flow Type System",
        "abstract": "计算上可靠的协议验证工具承诺为安全协议提供强大的加密证明。不幸的是，当前的工具要么缺乏模块化，要么缺乏自动化。我们提出了一种基于信息流和细化类型的新方法，用于进行可靠的加密证明。我们的框架O WL允许基于类型的模块化安全协议描述，其中可以单独编程和自动证明安全的不相交子协议。我们通过支持对称和非对称基元、Difﬁe-Hellman操作以及通过随机预言机进行哈希的核心语言对O WL进行了形式化安全证明。我们还为O WL实现了类型检查器和Rust的原型提取机制，并在包括（简化形式的）SSH密钥交换和Kerberos在内的14个案例研究中进行了评估。\n\n1 引言\n加密协议（例如Kerberos、TLS、QUIC或Signal）得到了广泛应用，但其脆弱性令人担忧。它们的普及意味着当像TLS这样的核心组件出现问题时，其负面影响是普遍的，如FREAK [17]和Logjam [2]所示。\n\n理论上，形式化协议验证可以排除此类攻击，事实上，学术界已经为此目的开发了许多工具[10,24,33]。然而，现有的计算机辅助安全证明方法很难处理现代协议（如TLS或QUIC）的复杂性和面临的威胁。我们认为（§2），这是因为没有工具能够同时实现模块化、自动化和计算安全。\n\n模块化验证。传统的纸上加密证明通常使用游戏跳跃或基于模拟器的技术考虑整个协议。可能是作为结果，许多自动化加密证明工具也采用了整体推理[7,23,25,59]，这意味着协议的安全证明不能由子协议的较小证明构建而成。不幸的是，这种方法无法随着现代协议的复杂性而扩展，因为使用这种工具验证P与Q的组合通常比验证P和Q分别要花费更多的工作。此外，即使成功，整体验证工作也会损害证明的重用性和可理解性，阻止后续验证工作从之前的工作中受益。\n\n证明自动化。另一方面，支持协议模块化验证的工具[11,31,57]提供了如此多的通用性，以至于很难自动化，需要在加密和验证领域都是专家的人手动编写执行加密缩减步骤所需的各种加密模拟器。虽然对于简化的纸上模型可能可行，但现实的协议有许多不同的部分 - 并非所有都是加密性质的 - 因此需要自动化才能使验证变得可行。\n\n实际上，像TLS这样的安全协议并不是以加密缩减步骤为目标设计的；相反，它们的设计是基于假设底层的加密机制是安全的来保护机密性和完整性的。验证工具应该与此直觉相匹配，并在可能的情况下将低级加密论证对用户隐藏起来。\n\n计算安全。理想情况下，加密协议应该在“黄金标准”计算模型中进行验证（在纸上密码学中广泛使用），因为这种模型对可能的对手做出了最弱的假设，从而提供了最强的保证。不幸的是，这种对表达能力和真实性的关注通常会阻碍自动化和可扩展性。\n\n因此，为了增加自动化，大量的工作在符号攻击者的存在下验证协议[15,18,19,35,53]。这些结果提供了一定的保证，但纸上证明容易出现细微错误[51]，简化的攻击者模型可能会抽象掉协议设计中的关键方面，使其容易受到攻击。实际上，已经成功攻击了“经过验证”的TLS [53]和SSH [15]，这是由于证明中使用的模型的局限性。\n\n我们的方法。我们引入了O WL，这是第一种在计算模型中实现协议自动化模块化证明的语言和形式化工具。O WL的模块化性意味着更高级的协议（例如创建和使用安全通道的协议）可以安全地假设较低级别规范的安全实现（例如密钥交换），这些规范可以通过不同的方式实例化（例如通过预共享密钥或PKI）。在O WL中编写的协议在计算模型中进行验证，该模型将所有值视为二进制串，将所有加密基元视为其上的算法，将攻击者视为任意多项式时间概率算法。\n\n自动化计算推理具有挑战性，因为计算困难性假设 - 例如IND-CPA和INT-CTXT用于认证加密，以及EUF-CMA用于数字签名 - 通常表示为安全游戏的对。这种表示需要从手头的协议到（安全游戏的实例化）的缩减。由于安全游戏通常被指定为一对一般问题的对。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4C：Cryptographic proof techniques\\Sound Verification of Security Protocols：From Design to Interoperable Implementations.pdf": {
        "title": "Sound Verification of Security Protocols：From Design to Interoperable Implementations",
        "abstract": "我们提供了一个框架，包括工具和元理论，用于对安全协议进行端到端的验证，弥合了自动协议验证和代码级证明之间的差距。我们将Tamarin协议模型自动转换为一组以分离逻辑表示的I/O规范。每个规范描述了协议角色的预期I/O行为，对此行为进行了验证。我们的完备性结果保证了经验证的实现继承了Tamarin模型中证明的所有安全（跟踪）属性。因此，我们的框架使我们能够利用Tamarin中大量的先前验证工作来验证新的和现有的实现。使用任何分离逻辑代码验证器可以提供关于目标语言的灵活性。为了验证我们的方法并展示其在现实世界协议中的可扩展性，我们验证了WireGuard VPN密钥交换协议的官方Go实现的大部分内容。关键词：协议验证，符号安全，自动验证，Tamarin，分离逻辑，实现。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 4C：Cryptographic proof techniques\\Typing High-Speed Cryptography against Spectre v1.pdf": {
        "title": "Typing High-Speed Cryptography against Spectre v1",
        "abstract": "1型攻击的时间窃取漏洞。我们提出、分析、实施并评估一种编写高效的加密实现的方法，该方法能够防止Spectre v1攻击。我们的方法确保了推测式恒定时间，这是一种信息流属性，可以保证程序免受Spectre 1型攻击的保护。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5A：Software security\\Half&Half：Demystifying Intel's Directional Branch Predictors for Fast, Secure Partitioned Execution.pdf": {
        "title": "Half&Half：Demystifying Intel's Directional Branch Predictors for Fast, Secure Partitioned Execution",
        "abstract": "本文介绍了一种新颖的软件防御方法Half&Half，用于抵御基于分支的侧信道攻击。Half&Half通过隔离不同保护域对现代Intel处理器中的条件分支预测器（CBPs）的影响。本研究首次对现代条件分支预测结构进行了全面分析，并首次揭示了一种未知机会，即通过共享预测器在两个域之间进行物理分区并完全防止泄漏。Half&Half是一种仅依赖软件的分支预测器隔离解决方案，不需要对硬件或ISA进行任何更改，只需要对现有编译器进行轻微修改即可支持。我们在LLVM和WebAssembly编译器中实现了Half&Half，并且证明相比于目前最先进的基于分支的侧信道防御，它的开销降低了一个数量级。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5A：Software security\\Improving Developers' Understanding of Regex Denial of Service Tools through Anti-Patterns and Fix Strategies.pdf": {
        "title": "Improving Developers' Understanding of Regex Denial of Service Tools through Anti-Patterns and Fix Strategies",
        "abstract": "正则表达式被用于各种目的，包括输入验证和防火墙。不幸的是，它们也可能导致一种名为ReDoS（正则表达式拒绝服务）的安全漏洞，该漏洞由于在正则表达式匹配过程中的超线性最坏情况执行时间而引起。由于ReDoS的严重性和普遍性，过去的研究提出了自动工具来检测和修复正则表达式。尽管这些工具在自动实验中进行了评估，但它们的可用性尚未被研究过；可用性并不是之前工作的重点。我们的洞察力是，如果我们将现有的检测和修复正则表达式的工具与易受攻击的正则表达式的反模式和修复策略相结合，那么现有工具的可用性将得到改善。\n我们为易受攻击的正则表达式开发了新颖的反模式，并提供了一系列修复策略来修复它们。我们从正则表达式无限模糊性的新理论中推导出了我们的反模式和修复策略，这是正则表达式易受ReDoS攻击的必要条件。我们证明了我们理论的完备性和正确性。我们评估了我们的反模式的有效性，既在自动实验中，也在手动应用中。然后，我们评估了我们的反模式和修复策略对开发人员理解检测和修复工具结果的改进程度。我们的评估发现，我们的反模式在一个大型正则表达式数据集（N=209,188）上非常有效：100％的精确度和99％的召回率，相比之下，现有技术的精确度为50％，召回率为87％。当手动应用时，我们的反模式也比现有技术更有效（N=20）：100％的开发人员有效应用它们，而现有技术为50％。最后，我们的反模式和修复策略提高了开发人员使用自动工具的理解程度（N=9）：在检测漏洞时，从“非常弱”中位数提高到“强烈”中位数；在修复漏洞时，从“非常弱”中位数提高到“非常强烈”中位数。\n关键词：正则表达式拒绝服务，可用性"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5A：Software security\\Practical Program Modularization with Type-Based Dependence Analysis.pdf": {
        "title": "Practical Program Modularization with Type-Based Dependence Analysis",
        "abstract": "—现今的软件程序越来越庞大且变得异常复杂。由于程序内部通常没有模块间的隔离，一个漏洞可能被利用来破坏内存并控制整个程序。因此，程序模块化是一种有前景的安全机制，将复杂的程序分割成较小的模块，以便约束内存访问指令对无关模块的破坏。实现程序模块化的一种常见方法是依赖分析，它确定一条指令是否独立于特定的代码或数据；如果是，则可以进行模块化。不幸的是，由于数据流分析中的问题，如未知的间接调用目标、指针别名和路径爆炸，复杂程序中的依赖分析通常被认为是不可行的。因此，我们还没有看到基于依赖分析的实用自动化程序模块化。\n\n本文提出了一种突破性的方法——面向类型的程序模块化的类型依赖分析（TyPM）。它的目标是确定程序中的哪些模块永远不会将某种类型的对象（包括引用）传递给内存访问指令；因此，由这些模块创建的该类型的对象永远不会成为指令的有效目标。其思想是首先使用基于类型的分析确定两个模块之间可能发生的数据流类型，然后根据具体的类型，传递地解析内存访问指令的所有依赖模块。这种方法避免了数据流分析，因此是实际可行的。我们基于TyPM开发了两个重要的安全应用：细化间接调用目标和保护关键数据结构。\n\n我们对TyPM进行了广泛的评估，包括操作系统内核、虚拟机监视器、UEFI固件和浏览器等各种系统软件。结果显示，TyPM平均额外细化了现有技术产生的间接调用目标的31%至91%。TyPM还可以删除99.9%的模块，以防止内存写入指令破坏Linux内核的关键数据结构。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5A：Software security\\Practical Timing Side-Channel Attacks on Memory Compression.pdf": {
        "title": "Practical Timing Side-Channel Attacks on Memory Compression",
        "abstract": "压缩算法由于其数据相关操作而产生了副通道。到目前为止，只有压缩比例副通道，例如压缩数据大小，被利用。在本文中，我们提出了Decomp+Time，这是第一个利用压缩算法中时间副通道的内存压缩攻击。与之前的工作相比，Decomp+Time影响的应用范围更广泛。一个关键的挑战是精确地制作攻击者控制的压缩有效负载，以实现足够的分辨率进行攻击。我们的进化模糊器Comprezzor找到了有效的Decomp+Time有效负载，优化了延迟差异，使得解压缩时间甚至可以在远程攻击中被利用。Decomp+Time在本地的容量为9.73kB/s，通过互联网为10.72bit/min（经过14个跳跃）。使用Comprezzor，我们开发了四个不同案例研究中的按字节泄露数据的攻击：首先，在远程PHP脚本上从Memcached中泄露1.50bit/min。其次，在互联网上从Python-Flask应用程序中的PostgreSQL泄露数据库记录，泄露率为2.69bit/min。第三，在Linux上从ZRAM压缩页面泄露本地的49.14bit/min的密钥。第四，在使用ZRAM的系统上，在Google Chrome浏览器中从V8引擎中泄露内部堆指针。因此，即使应用程序只能通过远程接口访问，重新评估在敏感数据上使用压缩的重要性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5A：Software security\\TEEzz：Fuzzing Trusted Applications on COTS Android Devices.pdf": {
        "title": "TEEzz：Fuzzing Trusted Applications on COTS Android Devices",
        "abstract": "安全和隐私敏感的智能手机应用程序使用可信执行环境（TEE）来保护敏感操作免受恶意代码的攻击。按设计，TEE具有对整个系统的特权访问，但对其内部工作几乎没有公开。此外，现实世界中的TEE在与可信应用程序（TA）通信时强制执行严格的格式和协议交互，这禁止了有效的自动化测试。\n\nTEEzz是第一个能够在生产智能手机上实时有效地对TA进行fuzzing的TEE感知fuzzing框架，即TA在经过加密和保护的TEE中运行，fuzzer只能观察与TA的交互，但无法控制TA的代码或数据。与传统的fuzzing技术不同，传统的fuzzing技术监视被fuzzing的程序的执行并在崩溃后查看其内存，而TEEzz只需要对目标的有限视图。TEEzz通过自动尝试推断TA API的字段类型和消息依赖关系，设计状态和类型感知的fuzzing mutators，并创建一个在设备上实时的fuzzer，克服了TEE fuzzing的关键限制（例如，对执行的TA缺乏可见性、专有交换格式和交互的值依赖）。\n\n由于商用Android设备上关于TA的系统fuzzing研究的可用性有限，我们广泛研究了现有的解决方案，探索了它们的局限性，并展示了TEEzz如何改进现有技术水平。首先，我们证明了通用内核驱动程序fuzzer对于fuzzing TA是无效的。然后，我们通过一个真实实验建立了fuzzing TA的基准。我们展示了TEEzz超越其他黑盒fuzzer，在TAs源代码可用的情况下可以改进灰盒方法，甚至对于有状态目标也优于灰盒方法。我们在最新版本的OPTEE TAs中发现了13个以前未知的漏洞，其中TEEzz是唯一触发了三个漏洞的fuzzer。我们还在流行的手机上运行了TEEzz，并发现了40个独特的漏洞，其中一个已经分配了CVE编号。\n\n关键词 - Fuzzing，Android，TEE，ARM TrustZone"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5A：Software security\\WarpAttack：Bypassing CFI through Compiler-Introduced Double-Fetches.pdf": {
        "title": "WarpAttack：Bypassing CFI through Compiler-Introduced Double-Fetches",
        "abstract": "——代码重用攻击是一种危险的威胁，多年来引起了安全社区的关注。这些攻击旨在损坏重要的控制流转移，以在不注入代码的情况下控制进程。如今，多个缓解措施的组合（例如ASLR、DEP和CFI）大大减少了这种攻击的可能性，使得运行代码重用的攻击更具挑战性。\n不幸的是，安全缓解措施与编译器优化相结合，编译器无法区分安全相关的代码和应用程序代码。盲目地在代码重用缓解措施上部署代码优化可能会削弱它们的安全保证。例如，编译器可能引入双重获取漏洞，导致并发问题，如时间检查与使用（TOCTTOU）攻击。\n在这项工作中，我们提出了一种新的攻击向量，称为WarpAttack，利用编译器引入的双重获取优化来进行TOCTTOU攻击，并绕过代码重用缓解措施。我们研究了这种攻击的机制，并提出了一个针对最新版本的Firefox的实际概念验证攻击。此外，我们提出了一种轻量级分析方法，用于定位易受攻击的双重获取代码（误报率为3%），并对六个流行应用程序、五个操作系统和四种架构（32位和64位）进行研究，以研究这种威胁的扩散情况。此外，我们研究了我们的攻击对六种CFI实现的影响。最后，我们调查了解决这种威胁的可能研究方向，并提出了在现有项目中部署的实际解决方案。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5B：Machine learning assurance\\FedRecover：Recovering from Poisoning Attacks in Federated Learning using Historical Information.pdf": {
        "title": "FedRecover：Recovering from Poisoning Attacks in Federated Learning using Historical Information",
        "abstract": "联邦学习容易受到中毒攻击的威胁，恶意客户端可以通过向服务器发送恶意模型更新来中毒全局模型。现有的防御方法侧重于通过强大的联邦学习方法防止少数恶意客户端中毒全局模型，并在存在大量恶意客户端时检测它们。然而，一旦检测到恶意客户端，如何从中毒攻击中恢复全局模型仍然是一个未解决的挑战。一种简单的解决方案是移除检测到的恶意客户端，并使用剩余的客户端从头开始训练一个新的全局模型。然而，这种从头开始的恢复方法会产生巨大的计算和通信成本，对于资源受限的客户端，如智能手机和物联网设备来说，这可能是无法接受的。\n\n在这项工作中，我们提出了一种名为FedRecover的方法，可以以较小的计算和通信成本为客户端从中毒攻击中恢复一个准确的全局模型。我们的关键思想是，在恢复过程中，服务器估计客户端的模型更新，而不是要求客户端计算和传输它们。具体而言，服务器在训练被中毒的全局模型之前，存储历史信息，包括每轮的全局模型和客户端的模型更新。在恢复过程中，服务器使用存储的历史信息估计每轮中客户端的模型更新。此外，我们进一步优化了FedRecover，通过预热、周期性校正、异常修复和最终调整策略来恢复一个更准确的全局模型，其中服务器要求客户端计算和传输精确的模型更新。理论上，我们证明了FedRecover恢复的全局模型在某些假设下接近或与从头开始训练的模型相同。实证上，我们对四个数据集、三种联邦学习方法以及无目标和有目标的中毒攻击（例如后门攻击）进行了评估，结果表明FedRecover既准确又高效。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5B：Machine learning assurance\\ObjectSeeker：Certifiably Robust Object Detection against Patch Hiding Attacks via Patch-agnostic Masking.pdf": {
        "title": "ObjectSeeker：Certifiably Robust Object Detection against Patch Hiding Attacks via Patch-agnostic Masking",
        "abstract": "物体检测器广泛应用于诸如自动驾驶汽车等安全关键系统中，但已发现其容易受到遮挡攻击的威胁。攻击者可以使用一个可行的对抗性修补程序，使物体检测器无法检测到目标物体，并破坏物体检测应用的功能。本文中，我们提出了一种用于抵御遮挡攻击的具有认证鲁棒性的物体检测方法\"ObjectSeeker\"。ObjectSeeker的关键在于遮挡不可知性：我们旨在遮挡整个对抗性修补程序，而不需要知道修补程序的形状、大小和位置。这种遮挡操作能够抵消对抗效果，使得任何基本的物体检测器能够安全地在遮挡图像上检测物体。值得注意的是，我们可以以可证明的方式评估ObjectSeeker的鲁棒性：我们开发了一个认证过程，以正式确定ObjectSeeker是否能够对抗威胁模型中的任何白盒自适应攻击来检测特定的物体，从而达到可证明的鲁棒性。我们的实验表明，相对于之前的工作，ObjectSeeker的可证明鲁棒性有显著提升（约10%-40%的绝对值和约2-6倍的相对值），同时具有较高的干净性能（与未防御模型相比，仅下降约1%）。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5B：Machine learning assurance\\On The Empirical Effectiveness of Unrealistic Adversarial Hardening Against Realistic Adversarial Attacks.pdf": {
        "title": "On The Empirical Effectiveness of Unrealistic Adversarial Hardening Against Realistic Adversarial Attacks",
        "abstract": "尽管关于机器学习（ML）系统的安全攻击和防御的文献主要集中在不切实际的对抗性示例上，但最近的研究引起了对现实对抗性攻击领域的关注，以及它们对实际系统的鲁棒性的影响。我们的论文为更好地理解对抗性鲁棒性与现实攻击之间的关系铺平了道路，并做出了两个重要贡献。首先，我们对三个现实世界的应用案例（文本分类、僵尸网络检测、恶意软件检测）和七个数据集进行研究，以评估不切实际的对抗性示例是否能够用于保护模型免受现实示例的攻击。我们的结果揭示了使用案例之间的差异，不切实际的示例既可以像现实示例一样有效，也可能只有有限的改进。其次，为了解释这些结果，我们分析了使用现实和不切实际攻击生成的对抗性示例的潜在表示。我们揭示了区分哪些不切实际的示例可以用于有效强化的模式。我们发布了我们的代码、数据集和模型，以支持未来研究探索如何缩小不切实际和现实对抗性攻击之间的差距。\n\n索引词 - 对抗性攻击、受限特征空间、问题空间、强化"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5B：Machine learning assurance\\PublicCheck：Public Integrity Verification for Services of Run-time Deep Models.pdf": {
        "title": "PublicCheck：Public Integrity Verification for Services of Run-time Deep Models",
        "abstract": "现有的深度模型完整性验证方法是为私有验证设计的（即假设服务提供商是诚实的，可以对模型参数进行白盒访问）。然而，私有验证方法不允许模型用户在运行时验证模型。相反，他们必须信任服务提供商，而服务提供商可能会篡改验证结果。相比之下，考虑到不诚实的服务提供商可能性的公共验证方法可以使更广泛的用户受益。在本文中，我们提出了PublicCheck，一种实用的公共完整性验证解决方案，用于运行时深度模型的服务。PublicCheck考虑到了不诚实的服务提供商，并克服了公共验证的轻量级、提供防伪保护和具有平滑外观的指纹样本等挑战。为了捕捉和指纹化运行时模型的固有预测行为，PublicCheck生成平滑转换和增强的包围模型决策边界的囊性样本，同时确保验证查询与正常查询不可区分。PublicCheck在目标模型知识受限（例如，不了解梯度或模型参数）的情况下也适用。对PublicCheck进行了全面评估，证明了其对各种模型完整性攻击和模型压缩攻击的强大检测能力（在少于10个黑盒API查询的情况下，检测准确率达到100%）。PublicCheck还展示了生成大量囊样本进行指纹化的平滑外观、可行性和效率。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5B：Machine learning assurance\\RAB：Provable Robustness Against Backdoor Attacks.pdf": {
        "title": "RAB：Provable Robustness Against Backdoor Attacks",
        "abstract": "最近的研究表明，深度神经网络（DNNs）容易受到对抗性攻击的影响，包括规避攻击和后门（毒化）攻击。在防御方面，人们一直在努力提高对规避攻击的经验和可证明的鲁棒性，然而对于后门攻击的可证明鲁棒性仍然很少被研究。本文重点研究机器学习模型对一般威胁模型（尤其是后门攻击）的鲁棒性认证。我们首先通过随机平滑技术提供了一个统一的框架，并展示了如何实现对规避和后门攻击的鲁棒性认证。然后，我们提出了第一个鲁棒训练过程RAB，对训练模型进行平滑处理，并证明了其对后门攻击的鲁棒性。我们在理论上证明了使用RAB训练的机器学习模型的鲁棒性界限，并证明了我们的鲁棒性界限是紧致的。此外，我们在理论上表明，对于简单模型（如K最近邻分类器），可以高效地训练鲁棒性平滑模型，并提出了一种精确平滑训练算法，消除了对噪声分布进行采样的需求。在实证方面，我们对不同的机器学习（ML）模型（如DNNs，支持向量机和K-NN模型）在MNIST，CIFAR-10和ImageNette数据集上进行了全面的实验，并提供了第一个针对后门攻击的认证鲁棒性基准。此外，我们还在一个tabular数据集上评估了K-NN模型，以展示提出的精确算法的优点。理论分析和对多样化的ML模型和数据集的全面评估为进一步对抗训练时间攻击的鲁棒学习策略提供了启示。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5B：Machine learning assurance\\SoK：Certified Robustness for Deep Neural Networks.pdf": {
        "title": "SoK：Certified Robustness for Deep Neural Networks",
        "abstract": "深度神经网络（DNNs）的巨大进步使其在各种任务上达到了最先进的性能。然而，最近的研究表明DNNs容易受到对抗攻击，这在部署到关键安全应用（如自动驾驶）时引起了极大的关注。针对对抗攻击提出了不同的防御方法，包括：a）经验防御，通常可以被适应性攻击再次攻破而无法提供鲁棒性证明；和b）可证明鲁棒方法，包括在某些条件下提供对任何攻击的鲁棒准确性下界和相应的鲁棒训练方法。在本文中，我们系统地总结了可证明的鲁棒方法及其相关的实际和理论影响和发现。我们还在不同的数据集上提供了现有鲁棒性验证和训练方法的首个全面基准。具体而言，我们：1）提供了鲁棒性验证和训练方法的分类法，并总结了代表性算法的方法论；2）揭示了这些方法的特点、优势、局限性和基本联系；3）讨论了当前的研究进展、理论障碍、主要挑战和深度神经网络可证明鲁棒方法的未来方向；4）提供了一个开源的统一平台，用于评估20多种代表性的可证明鲁棒方法。\n\n关键词-可证明鲁棒性、神经网络、验证"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5C：Applied cryptography\\FIDO2, CTAP 2.1, and WebAuthn 2：Provable Security and Post-Quantum Instantiation.pdf": {
        "title": "FIDO2, CTAP 2.1, and WebAuthn 2：Provable Security and Post-Quantum Instantiation",
        "abstract": "FIDO2协议是一种全球通用的无密码认证标准，基于在线认证领域的主要参与者联盟。尽管已广泛部署，但该标准仍在积极开发中。自版本2.1的CTAP子协议以来，FIDO2可以潜在地使用后量子安全原语。我们提供了FIDO2与CTAP 2.1和WebAuthn 2子协议的第一个正式安全分析。我们的安全模型基于Barbosa等人对FIDO2与CTAP 2.0和WebAuthn 1的分析，我们在多个方面进行扩展。首先，我们提供了一个更细粒度的安全模型，使我们能够证明更相关的协议属性，如令牌绑定协议一致性、无证书模式和用户验证的保证。其次，在某些条件和轻微的协议扩展下，我们可以证明FIDO2的后量子安全性。最后，我们展示了对于某些威胁模型，FIDO2的降级抗性可以得到改进，并展示了如何通过简单的修改实现这一点。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5C：Applied cryptography\\Private Collaborative Data Cleaning via Non-Equi PSI.pdf": {
        "title": "Private Collaborative Data Cleaning via Non-Equi PSI",
        "abstract": "我们介绍并研究了隐私保护版本的协作数据清洗。在协作数据清洗中，两方希望调和他们的数据集，以过滤出分类错误、错误分类的数据项。在隐私保护（私有）数据清洗中，额外的安全目标是各方只能了解到自己的错误分类数据项，而不能得知对方数据集的其他任何信息。隐私数据清洗问题本质上是私有集合交集（PSI）的变体，可以利用最近的电路-PSI技术来计算具有隐私保护的错误分类。然而，我们设计、分析和实现了三个针对私有数据清洗特定情况的新协议，其性能优于基于电路-PSI的方法。在第一个协议中，我们利用了一个小的额外泄漏（数据项交集的差分隐私大小）的思想，从而降低了复杂性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5C：Applied cryptography\\Rethinking Searchable Symmetric Encryption.pdf": {
        "title": "Rethinking Searchable Symmetric Encryption",
        "abstract": "对称可搜索加密（Symmetric Searchable Encryption，SSE）方案可以在加密文档上进行关键词搜索。为了提高效率，SSE方案会产生一定的信息泄露。大部分关于SSE的文献只考虑了整个SSE系统中一个组件的信息泄露，即加密搜索索引。该组件用于识别哪些文档应作为关键词查询的响应返回。实际获取文档则留给另一个组件，通常在文献中没有具体说明，但通常被设想为一个简单的存储系统，将文档标识符与加密文档匹配。这就引发了一个问题：从系统整体的角度来看，SSE方案是否真正保护了数据和查询的安全性？我们对这个问题的回答是否定的。为了回答这个问题，我们引入了一种新的推理攻击，可以针对端到端SSE系统实现实际高效、高度可扩展、准确的查询重构。特别是，即使使用了现代技术（即，体积隐藏的加密多重映射）构建SSE方案，以抑制信息泄露并保护免受先前一代攻击，我们的攻击依然有效。\n\n第二个问题是，是否可以将现代的信息泄露抑制技术应用于整个系统，以保护加密搜索索引和加密文档存储，从而产生高效的SSE系统？我们对这个问题也给出了否定的答案。为了回答这个问题，我们使用了这些现代的信息泄露抑制方法来实现SSE系统，并评估了它们的性能。我们发现，与原始基准系统相比，存储开销范围从100倍到800倍，带宽开销范围从20倍到100倍。我们的结果促使我们设计新的SSE系统，从一开始就考虑系统整体安全性。在这方面，我们还展示了陈等人（IEEE INFOCOM 2018）提出的一种SSE系统，具有基于差分隐私的可证明安全性保证，但仍然容易受到我们的新攻击。\n\n总的来说，我们的结果迫使我们重新评估如何构建既安全又高效的端到端SSE系统。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5C：Applied cryptography\\SPHINCS+C：Compressing SPHINCS+ With (Almost) No Cost.pdf": {
        "title": "SPHINCS+C：Compressing SPHINCS+ With (Almost) No Cost",
        "abstract": "——SPHINCS+ [CCS ’19]是NIST后量子标准化过程中选择的后量子数字签名方案之一。该方案是基于哈希的签名，被认为是最安全和最稳健的提案之一。该提案包括每个安全级别的快速（但较大）变体和小型（但较慢）变体。可能阻碍其采用的主要问题是其较大的签名大小。尽管SPHINCS+支持在签名大小和签名的计算成本之间进行权衡，但进一步减小签名大小（低于小型变体）会导致签名者的计算成本过高。\n\n本文提出了几种新方法，以进一步压缩签名大小，同时对签名者的计算成本要求几乎可以忽略不计，并进一步减少验证时间。此外，我们的方法使得签名大小和签名者的计算成本之间的权衡曲线更加高效。在许多参数设置中，我们同时实现了小型签名和更快的运行时间。例如，对于128位（经典）安全性，SPHINCS+的小型签名变体长度为7856字节，而我们的变体只有6304字节：压缩约20%，同时仍然减少了签名者的运行时间。然而，其他注重验证速度等的权衡也是可能的。\n\n我们方案的主要见解是存在预定义的特定消息子集，其中WOTS+和FORS签名（SPHINCS+使用的）可以被压缩，并且可以加快生成速度，同时保持相同的安全性保证。虽然大多数消息不会来自这些子集，但我们可以搜索适合签名的散列值。我们对消息的哈希值进行签名，该哈希值与被选择为哈希值在子集中的计数器连接。生成的签名既更小又更快速进行签名和验证。\n\n我们的方案易于描述和实施。我们提供了实现，速度和安全性的理论分析，以及基准结果。\n\n关键词：SPHINCS+；基于哈希的签名；后量子安全"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5C：Applied cryptography\\Threshold Signatures in the Multiverse.pdf": {
        "title": "Threshold Signatures in the Multiverse",
        "abstract": "我们引入了一个新的多宇宙门限签名（MTS）的概念。在一个MTS方案中，可以存在多个宇宙，每个宇宙由一组（可能重叠的）签名者、他们的权重和一个特定的安全门限定义。通过非交互式异步设置，可以（自适应地）创建一个宇宙。至关重要的是，多宇宙中的每个参与方持有固定大小的密钥，并发布大小和计算时间都与宇宙数量无关的紧凑签名。在特定宇宙的成员提供足够的消息的部分签名后，聚合器可以生成相对于该宇宙的短聚合签名。\n\n我们构建了一个基于BLS签名的MTS方案。我们的方案是实用的，可以用于减少分散式预言机网络中的带宽复杂性和计算成本。举一个例子，考虑一个包含2000个节点和100个宇宙的多宇宙（参数受Chainlink在实际使用中的启发），每个宇宙都包含任意大的节点子集和任意门限。每个节点计算并输出1个群组元素作为其部分签名；聚合器对每个聚合签名执行不到0.7秒的工作，最终大小为192字节的签名需要6.4毫秒（或198K EVM气体单位）来验证。对于这种情况，先前的方法在构建MTS时存在以下缺点之一：（i）部分签名大48倍，（ii）聚合时间差311倍，或者（iii）签名大小大39倍且验证气体成本大3.38倍。我们还提供了开源实现和详细评估。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 5C：Applied cryptography\\Token meets Wallet：Formalizing Privacy and Revocation for FIDO2.pdf": {
        "title": "Token meets Wallet：Formalizing Privacy and Revocation for FIDO2",
        "abstract": "FIDO2标准是一种广泛使用的挑战-响应型协议类，允许使用硬件令牌对在线服务进行身份验证。Barbosa等人（CRYPTO '21）为FIDO2标准提供了第一个正式的安全模型和分析。然而，他们的模型存在两个不足之处：（1）它不包括隐私，而FIDO2声称是其中的一个关键特性。（2）它仅涵盖本地存储所有秘密密钥的令牌。相反，由于内存有限，大多数现有的FIDO2令牌要么从公共种子派生所有秘密密钥，要么将密钥存储在服务器上（后一种方法也称为密钥包装）。\n\n在本文中，我们重新审视了实际实现中的FIDO2的WebAuthn组件的安全性。我们的贡献如下：（1）我们调整了Barbosa等人的模型，以捕捉使用密钥派生或密钥包装的身份验证令牌。（2）我们首次对FIDO2的WebAuthn组件提供了正式的隐私定义。我们随后证明了在常见的FIDO2令牌实现中，如果选择适当的基础构件，则该组件可以保护隐私。（3）我们解决了FIDO2中全局密钥吊销的未解决问题。为此，我们引入并分析了一种简单的吊销程序，该程序基于加密货币钱包中广受欢迎的BIP32标准，并且可以在现有的FIDO2服务器上高效地实现。\n\n索引词 - FIDO2; BIP32; 不可链接性; 吊销;"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6A：Software supply chains\\'Always Contribute Back'：A Qualitative Study on Security Challenges of the Open Source Supply Chain.pdf": {
        "title": "'Always Contribute Back'：A Qualitative Study on Security Challenges of the Open Source Supply Chain",
        "abstract": "开源组件在公司的设置、流程和软件中无处不在。利用这些外部组件作为构建块使公司能够利用开源软件的好处，从而将精力集中在功能和更快的交付上，而不是编写自己的组件。但是，通过将这些组件引入他们的软件堆栈中，公司会继承独特的安全挑战和攻击面，包括来自潜在未经审查的贡献者的代码和评估和缓解外部组件中漏洞影响的义务。\n\n通过与行业项目中的软件开发人员、架构师和工程师进行25次深入、半结构化的访谈，我们研究了他们项目中的流程、决策和考虑因素，与外部开源代码的背景相结合。我们发现，在许多参与者的项目中，开源组件发挥着重要作用，大多数项目都有一些形式的公司政策或至少最佳实践来包含外部代码，并且许多开发人员希望有更多的开发人员时间、专门的团队或工具来更好地审计包含的组件。\n\n基于我们的发现，我们讨论了对公司利益相关者和开源软件生态系统的影响。总的来说，我们呼吁公司不要将开源生态系统视为一个免费的（软件）供应链，而是要为他们受益并参与其中的整个软件生态系统的健康和安全做出贡献。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6A：Software supply chains\\Continuous Intrusion：Characterizing the Security of Continuous Integration Services.pdf": {
        "title": "Continuous Intrusion：Characterizing the Security of Continuous Integration Services",
        "abstract": "- 持续集成（CI）是一种广泛采用的软件开发实践，用于自动化代码集成。典型的CI工作流涉及多个独立的利益相关者，包括代码托管平台（CHPs）、CI平台（CPs）和第三方服务。尽管CI能够显著提高开发效率，但不幸的是，它也暴露了新的攻击面。由于CI任务执行的代码可能来自一个不太可信的用户，配置不当的CI以及弱隔离机制可能使攻击者能够通过触发CI任务将恶意代码注入受害者软件。此外，一个不安全的利益相关者还有可能影响整个过程。在本文中，我们系统地研究了在考虑到多个利益相关者和主要的CP组件的CI工作流中可能存在的安全威胁。我们设计和开发了一个分析工具CInspector，用于调查与三个主流CHPs集成时七个流行CPs中的潜在漏洞。我们发现所有的CPs都存在由于资源共享和隔离不当而导致的令牌泄露风险，并且其中许多使用了权限过高的令牌和不正确的有效期。我们进一步揭示了四个新的攻击向量，允许攻击者通过执行CI任务中的一段代码来提升权限并秘密注入恶意代码。为了了解潜在影响，我们对三个主流的CHPs进行了大规模测量，详细审查了超过...（缺省部分由于字数限制无法翻译完整）"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6A：Software supply chains\\Investigating Package Related Security Threats in Software Registries.pdf": {
        "title": "Investigating Package Related Security Threats in Software Registries",
        "abstract": "软件包注册表托管可重用的代码资产，使开发人员能够轻松共享和重用软件包，从而加快软件开发过程。当前的软件注册表生态系统涉及多个独立的利益相关者进行软件包管理。不幸的是，异常行为和信息不一致不可避免地存在，使得攻击者能够以最小的努力秘密进行恶意活动。在本文中，我们调查了六个流行的软件注册表生态系统中存在的潜在安全漏洞。通过对官方注册表、相应的注册表镜像和注册表客户端的系统分析，我们识别出了十二个潜在的攻击向量，其中六个是首次披露的，可以被利用来偷偷分发恶意代码。基于这些安全问题，我们构建了一个分析框架RScouter，用于持续监控和发现注册表生态系统中的漏洞。然后，我们利用RScouter在六个注册表和十七个流行的镜像上进行了为期一年的测量研究，审查了5300万个软件包版本中的400万个软件包。我们的定量分析表明，在每个生态系统中存在多个威胁，并且一些已经被攻击者利用。我们已经向相关利益相关者报告了发现的漏洞，并收到了积极的回应。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6A：Software supply chains\\It's like flossing your teeth：On the Importance and Challenges of Reproducible Builds for Software Supply Chain Security.pdf": {
        "title": "It's like flossing your teeth：On the Importance and Challenges of Reproducible Builds for Software Supply Chain Security",
        "abstract": "- 2020年的Solarwinds攻击是一个转折点，引发了对软件供应链安全的高度关注，特别是对构建系统所放置的大量信任。可再现构建（R-Bs）为针对构建系统的任意攻击提供了坚实的基础，通过确保在给定相同的源代码、构建环境和构建指令的情况下创建完全相同的构建成果。不幸的是，许多软件行业认为R-Bs对大多数项目来说太过遥远。本文的目标是帮助确定R-Bs成为普遍属性的路径。\n- 为此，我们进行了一系列24个半结构化的专家访谈，与Reproducible-Builds.org项目的参与者进行了交流，发现自我效能工作和与上游项目的协作沟通是R-Bs的关键因素。我们确定了一系列鼓励开源开发者追求R-Bs的动机，包括质量指标、安全利益和更高效的构建成果缓存。我们还确定了有助于和阻碍采用的经验，其中往往围绕与上游项目的沟通展开。最后，我们提出了如何更好地将R-Bs与开源和自由软件社区的努力相结合的建议。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6A：Software supply chains\\SoK：Taxonomy of Attacks on Open-Source Software Supply Chains.pdf": {
        "title": "SoK：Taxonomy of Attacks on Open-Source Software Supply Chains",
        "abstract": "广泛依赖开源软件使其成为恶意行为者的有效目标，这一点通过反复发生的攻击得到了证明。当今开源供应链的复杂性导致了一个显著的攻击面，使攻击者有很多机会将恶意代码注入到开源构件中，然后被受害者下载和执行。\n\n本研究提出了一个针对开源供应链攻击的通用分类方法，不依赖于具体的编程语言或生态系统，并覆盖了从代码贡献到软件包分发的所有供应链阶段。以攻击树的形式呈现，它涵盖了107个独特的攻击向量，与94个真实世界事件相关联，并映射到33个缓解措施。\n\n通过与17个领域专家和134名软件开发人员进行的用户调查，对分类法的正确性、全面性和可理解性进行了积极验证，以及其适用于各种用例的合适性。调查参与者还评估了已确定的保护措施的效用和成本，以及它们是否被使用。\n\n索引词 - 开源，安全，软件供应链，恶意软件，攻击"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6B：ML attacks\\Deepfake Text Detection：Limitations and Opportunities.pdf": {
        "title": "Deepfake Text Detection：Limitations and Opportunities",
        "abstract": "最近生成模型在语言方面的进展使得能够创造出令人信服的合成文本或者深度伪造文本。以前的研究已经展示了深度伪造文本被滥用以误导内容消费者的潜力。因此，深度伪造文本检测，即区分人类生成文本和机器生成文本的任务，变得越来越重要。已经提出了几种用于深度伪造文本检测的防御方法。然而，我们对它们在现实世界中的适用性缺乏全面的了解。在本文中，我们收集了来自4个基于Transformer工具的在线服务的深度伪造文本，以评估这些防御方法在真实环境中的泛化能力。我们开发了几种低成本的对抗攻击，并研究了现有防御方法对于适应性攻击的鲁棒性。我们发现，与原始声称的性能相比，许多防御方法在我们的评估场景中表现出显著的性能下降。我们的评估结果表明，利用文本内容中的语义信息是提高深度伪造文本检测方案的鲁棒性和泛化性能的一种有希望的方法。\n\n关键词：深度伪造文本，深度伪造检测"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6B：ML attacks\\GeeSolver：A Generic, Efficient, and Effortless Solver with Self-Supervised Learning for Breaking Text Captchas.pdf": {
        "title": "GeeSolver：A Generic, Efficient, and Effortless Solver with Self-Supervised Learning for Breaking Text Captchas",
        "abstract": "尽管文本验证码作为区分人类用户和机器人的机制面临着许多攻击方法，但它仍然是一种广泛使用的安全机制，并被一些网站采用。一些基于深度学习的文本验证码解决方案已经展示出了出色的结果，但是劳动密集型和耗时的标记过程严重限制了它们的可行性。先前的研究试图使用一组有限的标记数据创建易于使用的解决方案。然而，由于低效的预处理过程和无法识别具有复杂安全特性的验证码，它们受到了阻碍。\n\n在本文中，我们提出了一种名为 G EESOLVER 的通用、高效、轻松的基于自监督学习的文本验证码破解器。我们的见解是，许多“损坏”标准字符字体的难以攻击的验证码方案类似于图像掩码。我们可以利用掩码自动编码器（MAE）改进验证码解决器，从验证码图像的“未掩码”部分学习潜在表示。具体而言，我们的模型由一个 ViT 编码器作为潜在表示提取器和一个经过精心设计的验证码识别解码器组成。我们应用 MAE 范式来训练我们的编码器，使编码器能够从本地信息（即没有掩码的部分）中提取潜在表示，以推断出相应的字符。此外，我们冻结编码器的参数，并利用少量标记的验证码和大量未标记的验证码使用半监督学习来训练我们的验证码解码器。\n\n我们对真实世界的验证码方案进行的实验证明，相比于少量标记的验证码，G EESOLVER 在性能上大幅超越了最先进的方法。我们还展示了 G EESOLVER 的高效性，它可以在使用桌面 CPU 时在25毫秒内解决一个验证码，在使用桌面 GPU 时在9毫秒内解决一个验证码。此外，由于潜在表示的提取，我们成功破解了难以攻击的验证码方案，证明了我们解决方案的通用性。我们希望我们的工作能够帮助安全专家重新审视基于文本的验证码的设计和可用性。代码可在https://github.com/NSSL-SJTU/GeeSolver 上获取。\n\n§平等贡献。∗通讯作者。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6B：ML attacks\\ShadowNet：A Secure and Efficient On-device Model Inference System for Convolutional Neural Networks.pdf": {
        "title": "ShadowNet：A Secure and Efficient On-device Model Inference System for Convolutional Neural Networks",
        "abstract": "随着移动和边缘设备上AI加速器的广泛使用，设备上的机器学习（ML）越来越受欢迎。数以千计的专有ML模型正在部署到数十亿个不受信任的设备上。这引发了对模型隐私的严重安全担忧。然而，在不失去对不受信任的AI加速器的访问权的情况下保护模型隐私是一个具有挑战性的问题。在本文中，我们提出了一种新颖的设备上模型推理系统，ShadowNet。ShadowNet利用可信执行环境（TEE）保护模型隐私，同时将模型的重型线性层安全地外包给不受信任的硬件加速器。ShadowNet通过在外包之前转换线性层的权重，并在TEE内恢复结果来实现这一目标。非线性层也被安全地保留在TEE内。ShadowNet的设计确保了权重的高效转换和结果的后续恢复。我们基于TensorFlow Lite构建了一个ShadowNet原型，并在五个流行的CNN（MobileNet，ResNet-44，MiniVGG，ResNet-404和YOLOv4-tiny）上进行了评估。我们的评估结果显示，ShadowNet在合理的性能下实现了强大的安全保障，为安全的设备上模型推理提供了实用的解决方案。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6B：ML attacks\\StyleFool：Fooling Video Classification Systems via Style Transfer.pdf": {
        "title": "StyleFool：Fooling Video Classification Systems via Style Transfer",
        "abstract": "视频分类系统容易受到对抗性攻击的影响，这可能会在视频验证中引发严重的安全问题。目前的黑盒攻击需要大量的查询才能成功，导致攻击过程中的计算开销很高。另一方面，对抗性扰动受限的攻击对去噪或对抗性训练等防御措施无效。本文关注无限制扰动，并提出了StyleFool，一种通过样式转换的黑盒视频对抗攻击方法，以欺骗视频分类系统。StyleFool首先利用颜色主题的相似性选择最佳样式图像，这有助于避免样式化视频中的不自然细节。同时，在有目标的攻击中，还会额外考虑目标类别的置信度，通过将样式化视频靠近甚至越过决策边界来影响分类器的输出分布。然后，采用无梯度的方法进一步优化对抗性扰动。我们在两个标准数据集UCF-101和HMDB-5上进行了广泛的实验来评估StyleFool的性能。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6B：ML attacks\\TrojanModel：A Practical Trojan Attack against Automatic Speech Recognition Systems.pdf": {
        "title": "TrojanModel：A Practical Trojan Attack against Automatic Speech Recognition Systems",
        "abstract": "尽管深度学习技术在现代数字产品中取得了巨大成功，研究人员已经表明深度学习模型容易受到特洛伊攻击。在特洛伊攻击中，对手偷偷修改深度学习模型，使得当输入中存在特定触发器时，模型将输出预定义的标签。在本文中，我们提出了一种名为TrojanModel的实用特洛伊攻击方法，针对自动语音识别（ASR）系统。ASR系统旨在将语音输入转录为文本，以便后续的下游应用更容易进行处理。我们考虑了一种实际的攻击场景，即对手向目标ASR系统的声学模型中插入一个特洛伊。与现有工作使用类似噪音的触发器容易引起用户怀疑不同，本文的重点是使用不引起怀疑的声音作为触发器，例如背景中播放的一段音乐。此外，TrojanModel不需要对目标模型进行重新训练。实验结果表明，TrojanModel能够以极低的影响目标模型性能的方式实现高攻击成功率。我们还证明了该攻击在无线攻击场景中的有效性，其中音频通过物理扬声器播放并被麦克风接收。关键词：对抗机器学习，自动语音识别，后门，深度学习，特洛伊"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6C：Rowhammer and spectre\\CSI：Rowhammer - Cryptographic Security and Integrity against Rowhammer.pdf": {
        "title": "CSI：Rowhammer - Cryptographic Security and Integrity against Rowhammer",
        "abstract": "在这篇论文中，我们介绍了CSI:Rowhammer，一种基于硬件和软件共同设计的Rowhammer缓解方案，具有加密安全性和完整性保证，不依赖于Rowhammer的任何特定属性。我们设计了一种基于低延迟加密MAC和异常机制的新型内存错误检测机制，该异常处理程序使用一种新颖的指令集扩展来进行错误修复，并在之后恢复执行。与常规的ECC-DRAM不同，如果翻转超过2个位，CSI:Rowhammer可以保持加密MAC的安全级别。我们在gem5的概念验证实现中评估了CSI:Rowhammer。在正常条件下，我们看到延迟开销低于0.75％，与现成的ECC-DRAM相比没有内存开销。虽然修复单个位翻转的平均延迟低于20纳秒（与最先进的ECC内存相比，延迟范围从几纳秒到几毫秒），但CSI:Rowhammer可以以极高的概率检测到任意数量的位翻转，并在实际时间限制内纠正至少8个位翻转。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6C：Rowhammer and spectre\\Hide and Seek with Spectres：Efficient discovery of speculative information leaks with random testing.pdf": {
        "title": "Hide and Seek with Spectres：Efficient discovery of speculative information leaks with random testing",
        "abstract": "攻击如Spectre滥用了现代CPU的关键性能优化之一，即预测执行。最近，出现了几种测试工具，可以自动检测商业（黑盒）CPU中的预测泄漏。然而，测试过程仍然很慢，这妨碍了深入测试活动，并且到目前为止阻止了对新类泄漏的发现。\n\n在本文中，我们确定了现有方法性能限制的根本原因，并提出了克服这些限制的技术。利用这些技术，我们将测试速度提高了比现有技术先进的水平高出两个数量级。\n\n这些改进使我们能够在Intel和AMD CPU上进行前所未有的深度测试活动。作为亮点，我们发现了两种以前未知的预测泄漏类型（影响字符串比较和除法），这些泄漏在以前的手动和自动分析中被忽视。\n\n关键词：Spectre、侧信道攻击、预测执行、随机测试、约束随机验证"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6C：Rowhammer and spectre\\Jolt：Recovering TLS Signing Keys via Rowhammer Faults.pdf": {
        "title": "Jolt：Recovering TLS Signing Keys via Rowhammer Faults",
        "abstract": "数字签名方案，如DSA、ECDSA和RSA，广泛应用于保护TLS、SSH和IPSec等安全协议的完整性。例如，在TLS中，RSA和(EC)DSA用于在握手阶段对协议参数的状态进行签名。自然地，RSA和(EC)DSA的实现成为了许多攻击的目标，包括强大的侧信道攻击。因此，加密库多年来一直被重复修补。\n\n在这里，我们介绍了一种名为Jolt的新型攻击，针对数字签名方案的实现。我们的攻击利用在签名生成过程中注入错误导致的错误签名。通过使用签名验证原语，我们纠正错误的签名，并在这个过程中推断出一些秘密签名密钥的位。与最近利用随机数中的单个位偏差的攻击相比，我们的攻击只需要不到一千个有错误的签名就可以对256位的(EC)DSA进行攻击。性能的提升是因为我们的攻击针对的是秘密签名密钥，在签名会话之间不会改变。我们还展示了所提出的攻击对Schnorr和RSA签名也可以进行轻微修改后适用。\n\n我们通过针对常用的加密库，如WolfSSL、OpenSSL、Microsoft SymCrypt、LibreSSL和Amazon s2n，运行针对TLS握手的实验来证明Jolt的可行性。在我们的目标平台上，在线阶段只需要不到2小时就可以恢复256位ECDSA密钥的192位，这足以完全恢复密钥。我们注意到，尽管RSA签名在流行的加密库中受到保护，但OpenSSL仍然容易受到双重错误注入的攻击。我们还审查了它们的联邦信息处理标准（FIPS）加固版本，虽然效率稍低，但仍然容易受到我们的攻击。我们发现，(EC)DSA签名仍然在纯软件故障方面存在较大的漏洞，对于TLS等实际部署以及潜在的其他安全协议，如SSH和IPSec，构成了威胁。这突显了对安全协议实现进行彻底审查和故障检查的必要性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6C：Rowhammer and spectre\\REGA：Scalable Rowhammer Mitigation with Refresh-Generating Activations.pdf": {
        "title": "REGA：Scalable Rowhammer Mitigation with Refresh-Generating Activations",
        "abstract": "缓解Rowhammer攻击需要在位翻转之前对DRAM行执行额外的刷新操作。这些刷新操作是稀缺的，并且只能周期性地进行，这妨碍了设计有效缓解措施，因为新的DRAM基板对Rowhammer更加容易受攻击，并且单个“侵略者”行会影响更多“受害者”行。\n\n我们引入了REGA，这是第一个能够在每次激活行时产生额外刷新操作的in-DRAM机制。由于行激活是引起Rowhammer的唯一原因，这些额外的刷新操作将在DRAM设备面对引发Rowhammer的行激活时立即可用。传统上，刷新操作是使用感应放大器执行的。然而，感应放大器还负责处理读写操作。因此，在数据传输期间无法使用感应放大器对行进行刷新。为了实现在数据传输期间并行进行刷新操作，REGA使用额外的低开销缓冲感应放大器专门用于数据传输。然后，REGA可以使用原始的感应放大器在行激活期间对其他行进行并行刷新操作。\n\nREGA产生的刷新操作使得能够设计简单且可扩展的in-DRAM缓解措施，并提供强大的安全保证。例如，我们构建了REGA M，这是第一个确定性的in-DRAM缓解措施，可以适应较小的Rowhammer阈值，同时对于每个侵略者的受害者数量是不确定的。REGA M的面积开销仅为2.1％，并且可以保护具有较小Rowhammer阈值的DDR5设备，例如261、517和1029，其保护率为23.9％，1"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 6C：Rowhammer and spectre\\Spectre Declassified：Reading from the Right Place at the Wrong Time.pdf": {
        "title": "Spectre Declassified：Reading from the Right Place at the Wrong Time",
        "abstract": "-实际的信息流编程语言通常通过一个解密构造允许受控泄漏-程序员可以使用这个构造来声明意图泄漏。例如，由私钥计算得到的加密签名和密文被信息流分析视为秘密。加密库可以使用解密来使这些数据变为公开的，因为它们不再敏感。\n在本文中，我们研究了推测执行和解密之间的相互作用。我们展示了推测执行导致解密点的意外泄漏。具体而言，我们提出了一个从AES实现中恢复密钥的PoC。我们的PoC是Spectre攻击的一个实例，即使程序使用了推测加载加强（SLH）进行编译，它仍然有效，SLH是一种广泛使用的基于编译器的Spectre对策。我们开发了对这些攻击的正式对策，包括我们称之为选择性推测加载加强（selSLH）的SLH的显著改进。这些对策可可靠地强制执行相对非干扰性（RNI）：非正式地说，受保护程序的推测泄漏仅限于原始程序的现有顺序泄漏。我们在FaCT语言和编译器中实现了最简单的对策-这个语言和编译器专门用于高保证性的密码学-我们发现性能开销最多为10%。最后，虽然我们没有直接实现selSLH，但我们的初步评估表明，与传统的SLH相比，密码学函数的性能成本显著降低。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7A：Physical channel attacks\\Inducing Wireless Chargers to Voice Out for Inaudible Command Attacks.pdf": {
        "title": "Inducing Wireless Chargers to Voice Out for Inaudible Command Attacks",
        "abstract": "最近的研究表明，恶意语音命令可以通过不可听见的媒介（如超声波、激光和电磁干扰）注入到语音识别系统或语音助手中，从而对其进行操纵。在这项工作中，我们探索了一种通过无线充电引起的磁干扰进行的一种新型不可听见的语音攻击。基本上，我们展示了当智能设备进行无线充电时，其麦克风组件会受到严重的磁干扰，这是因为在低频（100 kHz或以下）处缺乏有效的电磁干扰保护。利用这个漏洞，我们设计了两种不可听见的语音攻击，HeartwormAttack和ParasiteAttack，目的是将恶意语音命令注入到正在进行无线充电的智能设备中。它们分别利用被篡改的无线充电器或附件设备（称为寄生物）来注入语音。我们对17个受害设备（iPhone、华为、三星等）和6种语音助手（Siri、Google STT、Bixby等）进行了大量实验。评估结果证明了两种提出的攻击在商业充电设置下的可行性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7A：Physical channel attacks\\mmEcho：A mmWave-based Acoustic Eavesdropping Method.pdf": {
        "title": "mmEcho：A mmWave-based Acoustic Eavesdropping Method",
        "abstract": "—针对私人或机密空间的声学窃听是最严重的隐私威胁之一。隔音室可以减少此类风险，但无法阻止近年来出现的复杂窃听，这是一种新兴的研究趋势。研究人员通过传感器启用的侧信道调查了这种声学窃听攻击。然而，这些攻击要么基于不切实际的假设，要么有相当大的限制。本文介绍了mmEcho，一种声学窃听系统，它使用毫米波无线电信号准确测量声波引起的物体微米级振动。与以前的工作相比，我们的窃听方法非常准确，并且不需要对受害者有任何先验知识。我们在广泛的实际环境和场景下评估了mmEcho的性能。我们的结果表明，mmEcho可以准确地重建不同距离、方向、反射物、隔音材料、说话语言和音量的移动音源的音频。\n索引词-毫米波雷达、音频窃听、振动、信号处理"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7A：Physical channel attacks\\mmSpoof：Resilient Spoofing of Automotive Millimeter-wave Radars using Reflect Array.pdf": {
        "title": "mmSpoof：Resilient Spoofing of Automotive Millimeter-wave Radars using Reflect Array",
        "abstract": "FMCW雷达是汽车驾驶中不可或缺的一部分，用于可靠和抗恶劣天气的周围物体感知。然而，这些雷达容易受到欺骗攻击的影响，可能导致传感器故障并潜在地引发事故。先前尝试使用攻击设备欺骗FMCW雷达并不十分有效，因为需要攻击者与受害者之间的同步。我们提出了一种名为mmSpoof的新型欺骗机制，它不需要同步，并且对受害雷达的各种安全特性和对策具有弹性。我们的欺骗机制使用基于“反射阵列”的攻击设备，通过适当调制反射雷达信号来欺骗受害者的雷达。我们提供了洞察和机制，可以通过mmSpoof的反射阵列以独特的频率偏移灵活地欺骗受害者雷达上的任意距离和速度。我们设计了一种新型算法，可以估计这个频率偏移，而不需要先前关于受害者雷达的信息。我们通过在现实的汽车驾驶场景中使用商用雷达和商用配件的紧凑移动设置展示了我们的欺骗的有效性。关键词-毫米波、FMCW雷达、反射阵列、自动驾驶车辆、无线、感知、欺骗。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7A：Physical channel attacks\\PLA-LiDAR：Physical Laser Attacks against LiDAR-based 3D Object Detection in Autonomous Vehicle.pdf": {
        "title": "PLA-LiDAR：Physical Laser Attacks against LiDAR-based 3D Object Detection in Autonomous Vehicle",
        "abstract": "自动驾驶车辆和机器人越来越多地利用基于激光雷达（LiDAR）的三维物体检测系统来探测环境中的障碍物。正确的检测和分类对于确保安全驾驶至关重要。虽然现有的研究已经证明了通过操纵点云来欺骗三维物体检测器的可行性，但其中大部分尝试都是在数字环境下进行的。在本文中，我们调查了使用激光注入对抗性点云来物理欺骗基于LiDAR的三维物体检测的可能性。首先，我们开发了一个激光收发器，可以注入多达4200个点，比之前的工作多20倍，并且可以测量受害者LiDAR的扫描周期以安排欺骗性激光信号。通过设计一个控制信号方法，将点云的坐标转换为控制信号，以及具有LiDAR物理约束和攻击能力的对抗性点云优化方法，我们成功地将所需的点云形状注入到受害者LiDAR中。我们可以发动四种类型的攻击，即简单隐藏、基于记录的生成、基于优化的隐藏和基于优化的生成。大量实验证明了我们的攻击对两种商用LiDAR和三种检测器的有效性。我们还讨论了传感器和AV系统级别的防御策略。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7A：Physical channel attacks\\Side Eye：Characterizing the Limits of POV Acoustic Eavesdropping from Smartphone Cameras with Rolling Shutters and Movable Lenses.pdf": {
        "title": "Side Eye：Characterizing the Limits of POV Acoustic Eavesdropping from Smartphone Cameras with Rolling Shutters and Movable Lenses",
        "abstract": "我们的研究发现了智能手机摄像头普遍存在的卷帘快门和可移动镜头结构如何将结构传导声音调制到相机图像上，从而创建了一个视角（POV）光学声学侧信道，用于窃听声音。智能手机摄像头硬件的移动泄露了声学信息，因为图像无意中调制了环境声音，作为不可察觉的失真。我们的实验发现，互补金属氧化物半导体（CMOS）卷帘快门和可移动镜头，如光学图像稳定（OIS）和自动对焦（AF）等固有行为进一步放大了这个侧信道。我们的论文描述了干扰智能手机相机POV的结构传导声音导致的声学信息泄漏的限制。与传统的对振动物体进行光学声学窃听不同，这个侧信道不需要视线和相机视野内的物体（天花板的图像就足够了）。我们的实验使用一种新的信号处理流程测试了这个侧信道的限制，该流程提取并识别了泄漏的声学信息。我们在一个口述数字数据集上使用10部智能手机进行评估，报道了80.66%的准确率。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7A：Physical channel attacks\\Volttack：Control IoT Devices by Manipulating Power Supply Voltage.pdf": {
        "title": "Volttack：Control IoT Devices by Manipulating Power Supply Voltage",
        "abstract": "本文从感知和执行的角度分析了物联网设备的安全性。特别地，我们发现了电源模块中的一个漏洞，并提出了Volttack攻击。为了发动Volttack攻击，攻击者可能会破坏电源并通过电源模块注入恶意信号，而电源模块在大多数设备中是不可或缺的。最终，Volttack攻击可能导致传感器测量与现实无关，或者以无视期望命令的方式操纵执行器。为了理解Volttack，我们系统地分析了影响电子元件的电源信号的基本原理，这些电子元件是构成传感器或执行器模块的基本组成部分。基于这些发现，我们在现成产品上实施和验证了Volttack：6个传感器和3个执行器，这些传感器和执行器用于从汽车制动系统、工业过程控制到机械臂的各种应用中。操纵传感器测量或执行的后果包括车辆制动距离加倍和天然气泄漏。这种漏洞的根本原因在于人们普遍认为电力线上的噪声是无意的，我们的工作旨在呼吁加强电源模块的安全性并采取措施以减轻这些攻击。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7B：ML Security and Privacy\\3DFed：Adaptive and Extensible Framework for Covert Backdoor Attack in Federated Learning.pdf": {
        "title": "3DFed：Adaptive and Extensible Framework for Covert Backdoor Attack in Federated Learning",
        "abstract": "联邦学习（FL）是一种实际的分布式机器学习范例，它在各个设备上本地训练数据集。然而，FL容易受到后门模型污染攻击的威胁。攻击者通过入侵或冒充这些设备，可以上传经过精心制作的恶意模型更新，以在攻击者指定的触发条件下操纵全局模型表现出后门行为。然而，现有的后门攻击需要对受害者FL系统的更多信息，超出了实际情况下的黑盒设置。此外，它们通常专门针对单一目标进行优化，而现代FL系统往往采用深度防御，从不同角度检测后门模型，这使得这些攻击变得无效。基于这些问题，本文提出了3DFed，一个自适应、可扩展和多层次的框架，可以在黑盒设置下发动隐蔽的FL后门攻击。3DFed拥有三个干扰模块来伪装后门模型：受限损失的后门训练、噪声掩码和诱饵模型。通过将指示器植入后门模型中，3DFed可以从全局模型中获取上一轮的攻击反馈，并动态调整这些后门干扰模块的超参数。通过广泛的实验结果，我们展示了当所有组件协同工作时，3DFed可以逃避所有最先进的FL后门防御，包括Deepsight、Foolsgold、FLAME、FL-Detector和RFLBAT。未来还可以在3DFed中加入新的干扰模块，因为它是一个可扩展的框架。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7B：ML Security and Privacy\\ELSA：Secure Aggregation for Federated Learning with Malicious Actors.pdf": {
        "title": "ELSA：Secure Aggregation for Federated Learning with Malicious Actors",
        "abstract": "联邦学习（FL）是一种在训练数据集高度分布的情况下越来越受欢迎的机器学习（ML）方法。客户端在其数据集上进行本地训练，然后将更新聚合到全局模型中。现有的聚合协议要么效率低下，要么不考虑系统中的恶意行为者的情况。这是使FL成为隐私敏感的ML应用的理想解决方案的主要障碍。我们提出了一种名为ELSA的安全聚合协议，它突破了这个障碍-它在设计的核心处处理了恶意行为者的存在，并且高效。与之前的Prio和Prio+的工作类似，ELSA提供了一种新颖的安全聚合协议，通过两个服务器之间的分布式信任构建，只要一个服务器是诚实的，就可以保持个体客户端更新的隐私，防御恶意客户端，并且具有高效的端到端性能。与以前的工作相比，ELSA的区别在于服务器不是交互式生成密码学相关性，而是客户端充当这些相关性的不受信任的发牌人，而不会影响协议的安全性。这导致了一个更快的协议，同时在效率上实现了更强的安全性。我们引入了新的技术，在一个服务器恶意的情况下仍然保持隐私，增加了7-25%的运行时间成本，而通信增加可以忽略不计，相对于半诚实服务器的情况。我们的工作大大提高了与类似安全保证的先前工作的端到端运行时间 - 对于我们考虑的模型，单一聚合RoFL提高了305倍，分布式信任Prio提高了8倍。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7B：ML Security and Privacy\\Private, Efficient, and Accurate：Protecting Models Trained by Multi-party Learning with Differential Privacy.pdf": {
        "title": "Private, Efficient, and Accurate：Protecting Models Trained by Multi-party Learning with Differential Privacy",
        "abstract": "基于安全多方计算的机器学习，简称多方学习（MPL），已经成为利用多方数据并保护隐私的重要技术。虽然MPL为计算过程提供了严格的安全保证，但通过访问模型的攻击仍然会使MPL训练的模型易受攻击。差分隐私可以帮助抵御此类攻击。然而，差分隐私带来的准确性损失以及安全多方计算协议的巨大通信开销使得在隐私、效率和准确性之间平衡的三方面具有极大的挑战。\n\n在本文中，我们提出了一种名为PEA（私密的、高效的、准确的）的解决方案，旨在解决上述问题，它由一个安全的差分隐私随机梯度下降（DPSGD）协议和两种优化方法组成。首先，我们提出了一种安全的DPSGD协议，以在基于秘密共享的MPL框架中实施DPSGD，DPSGD是一种常用的差分隐私机器学习算法。其次，为了减少差分隐私噪声带来的准确性损失和MPL的巨大通信开销，我们提出了两种优化方法用于MPL的训练过程：（1）基于数据无关的特征提取方法，旨在简化训练模型的结构；（2）基于本地数据的全局模型初始化方法，旨在加快模型训练的收敛速度。我们在两个开源的MPL框架TF-Encrypted和Queqiao中实现了PEA。各种数据集上的实验结果证明了PEA的效率和效果。例如，当/epsilon1=2时，在局域网设置下，我们可以在7分钟内训练一个准确率为88%的差分隐私分类模型用于CIFAR-10。这个结果明显优于CryptGPU这个最先进的MPL框架的结果：用相同的准确性在CIFAR-10上训练一个非隐私的深度神经网络模型需要超过16小时。\n\n关键词：安全多方计算、多方学习、差分隐私、隐私计算"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7B：ML Security and Privacy\\Scalable and Privacy-Preserving Federated Principal Component Analysis.pdf": {
        "title": "Scalable and Privacy-Preserving Federated Principal Component Analysis",
        "abstract": "主成分分析（PCA）是许多数据科学领域中用于降维的基本算法。我们解决了在多个数据提供者之间分布的私有数据上执行联合主成分分析的问题，并确保数据的机密性。我们的解决方案SF-PCA是一个端到端安全系统，可以在被动对手模型下保护原始数据和所有中间结果的机密性，即使多个参与方中有一个参与方泄露信息。SF-PCA同时利用多方同态加密、交互协议和边缘计算，可以高效地在本地明文数据上进行计算，并在集体加密数据上进行操作。SF-PCA的结果与非安全的集中式解决方案一样准确，与参与方之间的数据分布无关。它的性能与数据集维度和数据提供者数量呈线性或更好的比例。SF-PCA比现有的通过组合局部分析结果来近似解决方案的方法更精确，并且比仅基于安全多方计算或同态加密的保护隐私的替代方法快3倍到250倍。我们的工作展示了在私有分布式数据集上安全和联合的主成分分析的实际适用性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7B：ML Security and Privacy\\Spectral-DP：Differentially Private Deep Learning through Spectral Perturbation and Filtering.pdf": {
        "title": "Spectral-DP：Differentially Private Deep Learning through Spectral Perturbation and Filtering",
        "abstract": "—差分隐私是在深度学习算法背景下广泛接受的隐私度量标准，实现差分隐私依赖于一种称为差分隐私随机梯度下降（DP-SGD）的噪声训练方法。DP-SGD要求在密集神经网络中对每个梯度进行直接噪声添加，但这种隐私保护是以显著的效用成本为代价的。在这项工作中，我们提出了一种新的差分隐私学习方法——Spectral-DP，它将频谱域中的梯度扰动与频谱滤波相结合，以更低的噪声尺度和更好的效用实现所需的隐私保证。我们基于Spectral-DP开发了基于差分隐私的深度学习方法，适用于同时包含卷积和全连接层的架构。特别地，对于全连接层，我们将基于块循环的空间重构与Spectral-DP相结合，以获得更好的效用。通过全面的实验，我们研究并提供了在基准数据集上实现Spectral-DP深度学习的指南。与基于最先进的DP-SGD方法相比，Spectral-DP在从头开始训练和迁移学习设置中都表现出更好的效用性能。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7C：Human factors\\'How technical do you get. I'm an English teacher'：Teaching and Learning Cybersecurity and AI Ethics in High School.pdf": {
        "title": "'How technical do you get. I'm an English teacher'：Teaching and Learning Cybersecurity and AI Ethics in High School",
        "abstract": "当今的网络安全和人工智能技术往往面临伦理挑战。其中一个有希望的方向是向当今的年轻人教授网络安全和人工智能伦理。然而，在大学之前我们对这些课程的教学了解甚少。通过对16位美国高中教师和11位学生的访谈，我们发现网络安全和人工智能伦理通常在非技术类课程中教授，如社会学和语言艺术。我们还确定了相关主题，其中认识论规范、隐私和数字公民权利出现最频繁。虽然教师运用传统和新颖的教学策略，包括讨论（将当前事件作为案例研究）、游戏化活动和内容创作，但仍然面临许多挑战。例如，教师因担心被认为有立场偏见而犹豫讨论当前事件，并可能激怒家长；网络卫生教育在教育青少年和促进更安全的网络行为方面似乎非常无效；代沟使得教师与学生难以建立联系。根据研究结果，我们提出了对教育工作者、学校管理者和网络安全从业者的实用建议，以改善对青少年的网络安全和人工智能伦理教育。\n\n关键词：网络安全，人工智能伦理，教育"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7C：Human factors\\'We are a startup to the core'：A qualitative interview study on the security and privacy development practices in Turkish software startups.pdf": {
        "title": "'We are a startup to the core'：A qualitative interview study on the security and privacy development practices in Turkish software startups",
        "abstract": "安全和隐私在软件开发中经常被忽视，并且很少是开发者的首要任务。这一认识通常基于研究人员进行的研究以及生活和工作在美国、欧洲和英国的开发者群体。然而，软件的生产是全球性的，重要技术中心的关键人群并未得到充分的研究。土耳其的软件创业环境具有影响力，与软件安全和隐私相关的理解、知识和缓解措施仍未得到充分研究。为了弥补这一研究空白，我们对土耳其软件创业公司的16名开发者进行了半结构化访谈研究。访谈研究的目标是分析开发者是否以及如何确保他们的软件安全并保护用户隐私。我们的主要发现是，由于缺乏意识、技能和资源，开发者很少将安全和隐私作为首要任务。我们发现，法规可以对安全和隐私产生积极影响。基于这项研究，我们向行业、个人开发者、研究人员、教育工作者和监管机构提出了建议。我们的建议可以为软件开发中的安全和隐私问题提供更全球化的解决方案。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7C：Human factors\\Everybody's Got ML, Tell Me What Else You Have：Practitioners' Perception of ML-Based Security Tools and Explanations.pdf": {
        "title": "Everybody's Got ML, Tell Me What Else You Have：Practitioners' Perception of ML-Based Security Tools and Explanations",
        "abstract": "—已经进行了重要的努力来开发基于机器学习（ML）的工具来支持安全操作。然而，在实践中它们仍然面临重要挑战。机器学习被普遍认为存在解释不足的问题，这促使研究人员开发机器学习解释技术。然而，在安全操作环境下，安全从业人员如何看待机器学习的好处和问题，目前还不清楚。为了填补这一空白并了解“需要什么”，我们对18名具有不同角色、职责和专业知识的安全从业人员进行了半结构化访谈。我们发现，从业人员普遍认为应该将ML工具与传统基于规则的方法结合使用，而不是替代。虽然ML的输出被认为难以推理，但令人惊讶的是，基于规则的方法并不一定更容易解释。我们还发现，只有少数从业人员考虑到安全性（对抗性攻击的鲁棒性）作为选择工具的关键因素。关于ML解释，虽然认识到它们在模型验证和理解安全事件方面的价值，但从业人员也指出现有解释方法与他们下游任务的需求之间存在差距。我们收集并综合了从业人员关于解释方案设计的建议，并讨论未来的工作如何帮助满足这些需求。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7C：Human factors\\No One Drinks From the Firehose：How Organizations Filter and Prioritize Vulnerability Information.pdf": {
        "title": "No One Drinks From the Firehose：How Organizations Filter and Prioritize Vulnerability Information",
        "abstract": "每年发布的软件漏洞数量都在增加。尽管组织的人力资源有限，但他们如何在攻击面上保持控制？先前的研究分析了整体软件漏洞生态系统以及组织内的补丁流程，但没有分析这两者之间的联系。\n\n我们通过对22个关键基础设施和政府服务组织进行半结构化访谈来调查这个缺失的环节。我们分析了这些组织中有关收集和分类软件漏洞信息的责任分配情况，并发现我们的受访者中没有人全面获取此类信息，甚至没有像国家漏洞数据库（NVD）这样的简化和汇总形式。这意味着即使是在关键基础设施组织中，有关已知漏洞的信息也会被忽视。我们观察到组织采用隐性和显性的应对机制来减少漏洞信息的接收，并确定了这些策略中的三个权衡：独立性、主动性和形式化。\n\n尽管我们的受访者的行为与广泛接受的安全建议相冲突，即收集关于活动系统的全面漏洞信息，但没有受访者回忆起曾经发生与已知软件漏洞的信息缺失有关的安全事件。这表明在资源稀缺的情况下，将漏洞信息的接收减少高达95%可以被视为一种理性策略。我们的发现对于找到易受攻击系统的责任和问责分配提出了问题，并暗示了对于收集漏洞信息的期望的变化。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7C：Human factors\\Skilled or Gullibleƒ Gender Stereotypes Related to Computer Security and Privacy.pdf": {
        "title": "Skilled or Gullibleƒ Gender Stereotypes Related to Computer Security and Privacy",
        "abstract": "性别刻板印象在美国社会仍然普遍存在，并对所有性别的人造成伤害。在首次调查中，我们以二元性别（女性和男性）为重点，通过实证研究与计算机安全和隐私相关的性别刻板印象。我们利用Prolific进行了两项针对美国参与者的调查，旨在：（1）揭示与安全和隐私相关的潜在性别刻板印象（N = 202），以及（2）评估对安全和隐私参与、个人特征和行为的性别刻板印象的信念（N = 190）。我们发现刻板印象的信念与参与者的性别以及性别歧视程度显著相关，并深入探讨了参与者对其信念的证明。除了对此类刻板印象的存在和普遍性进行科学研究外，我们还描述了潜在的影响，包括对众包工作者辅助用户研究的偏见。此外，我们的工作为进一步研究刻板印象在计算机安全和隐私以及整个性别和身份范围内的影响奠定了基础。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 7C：Human factors\\Vulnerability Discovery for All：Experiences of Marginalization in Vulnerability Discovery.pdf": {
        "title": "Vulnerability Discovery for All：Experiences of Marginalization in Vulnerability Discovery",
        "abstract": "漏洞发现是软件安全的一个重要方面。目前，对安全专家的需求远远超过了可用的漏洞发现人才。此外，现有的漏洞发现人才高度同质化，以白人和亚洲男性为主导。因此，通过招募和留住更广泛的人群，增加漏洞发现社区的能力是一种有希望的途径。尽管以前的研究已经广泛探讨了计算机领域中的公平和包容性挑战，但漏洞发现工作的竞争性和经常是自学的性质可能会带来这些挑战的新变化。本文报告了一项半结构化访谈研究（N = 16），调查了边缘化人群如何参与漏洞发现、是否感到受到漏洞发现社区的欢迎以及加入漏洞发现社区时面临的挑战。我们发现，边缘化人群面临一些独特的挑战，同时漏洞发现中常见的其他挑战也因边缘化而加剧。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8A：Low-level software security\\AEM：Facilitating Cross-Version Exploitability Assessment of Linux Kernel Vulnerabilities.pdf": {
        "title": "AEM：Facilitating Cross-Version Exploitability Assessment of Linux Kernel Vulnerabilities",
        "abstract": "本文研究了Linux内核跨版本的可利用性评估问题。具体来说，给定一个漏洞利用示例，该示例展示了特定内核版本上的漏洞可利用性，我们的目标是理解同一漏洞在其他内核版本上的可利用性。为了解决跨版本的可利用性评估问题，自动化漏洞利用生成（AEG）是目前唯一存在且适用的解决方案。然而，由于AEG采用了模板驱动的方式，并且忽视了可用漏洞利用的能力，因此AEG并不适用。\n\n在这项工作中，我们引入了一种新的方法，自动化漏洞迁移（AEM），以促进对Linux内核的跨版本可利用性评估。AEM的关键洞察力是观察到漏洞利用所采用的策略通常适用于其他可利用的内核版本。从技术上讲，我们将漏洞利用可以工作的内核版本作为参考，并调整漏洞利用以强制其他内核版本与参考版本保持一致。通过这种方式，我们可以在其他版本上复现漏洞利用行为。为了降低成本并增加可行性，我们有针对性地确定真正影响利用的执行点，并只在这些点上强制保持一致。我们设计并实现了AEM的原型。在我们对67个需要进行漏洞迁移的案例的评估中，我们的原型成功地迁移了56个案例的漏洞，成功率为83.5%。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8A：Low-level software security\\Precise Detection of Kernel Data Races with Probabilistic Lockset Analysis.pdf": {
        "title": "Precise Detection of Kernel Data Races with Probabilistic Lockset Analysis",
        "abstract": "在现代内核开发中，找到数据竞争对于确保安全至关重要。然而，在内核中找到数据竞争是具有挑战性的，因为它需要同时搜索可能的系统调用和并发执行计划的组合。内核竞争测试系统通常通过执行来自语料库的一组模糊器种子，并在追踪中应用调度模糊和动态竞争预测的组合来执行此搜索。然而，预测哪些种子的组合可以在内核中暴露竞争是困难的，因为由于线程间通信和同步，模糊器种子通常会遵循不同的执行路径。\n\n为了解决这个挑战，我们引入了一种新的内核竞争预测分析，概率锁集分析（Probabilistic Lockset Analysis，PLA），它解决了内核竞争预测所面临的挑战。PLA利用观察到系统调用几乎总是执行某些内存访问来执行其功能。PLA使用随机并发追踪采样来识别一致执行的内存访问，并估计在内核锁同步的条件下它们之间竞争的概率。通过优先处理高概率竞争，PLA能够进行准确的预测。\n\n我们将PLA与相似的内核竞争测试方法进行评估，并显示它在24小时内以3倍的速率发现竞争。我们使用PLA在linux内核v5.18-rc5中找到了183个竞争，其中包括102个有害竞争。PLA能够找到在经过大量测试的核心内核模块中具有严重安全影响的竞争，包括内存管理中的使用后释放，网络加密中的越界写入以及泄漏内核堆内存信息。其中一些漏洞多年来一直被现有系统忽视：PLA发现的一个涉及越界写入的竞争自2013年（版本v3.14-rc1）以来一直存在于内核中，并被指定为高严重性CVE。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8A：Low-level software security\\RSFuzzer：Discovering Deep SMI Handler Vulnerabilities in UEFI Firmware with Hybrid Fuzzing.pdf": {
        "title": "RSFuzzer：Discovering Deep SMI Handler Vulnerabilities in UEFI Firmware with Hybrid Fuzzing",
        "abstract": "系统管理模式（SMM）是一种由统一可扩展固件接口（UEFI）固件支持的x86处理器的安全操作模式。SMM旨在提供一个安全的执行环境，用于访问高度特权数据或控制低级硬件（如电源管理）。在SMM中运行的程序称为SMM驱动程序，系统管理中断（SMI）处理程序是SMM驱动程序的最重要组成部分，因为它们是唯一能够接收和处理来自SMM执行环境外部的数据的组件。尽管当操作系统受到威胁时，SMM可以作为额外的保护层，但SMM驱动程序（尤其是SMI处理程序）中的漏洞可能会使该保护无效，并对设备造成严重损害。因此，对于UEFI固件安全来说，早期发现SMI处理程序的漏洞非常重要。\n\n为了实现这一目标，研究人员提出使用混合模糊测试技术来检测SMI处理程序的漏洞。特别是，英特尔开发了一种名为Excite的混合模糊器，并将其用于保护英特尔产品。尽管现有的混合模糊测试技术可以检测SMI处理程序中的漏洞，但由于两个主要问题，它们的有效性受到限制：1）它们只能通过最常见的输入接口向SMI处理程序提供输入，缺乏利用其他输入接口的能力。2）它们对多个SMI处理程序共享的变量没有意识，缺乏探索与这些变量相关的代码段的能力。通过解决现有工作面临的挑战，我们提出了RSF UZZER，一种混合灰盒模糊测试技术，可以学习输入接口和格式信息，并检测通过调用多个SMI处理程序触发的深藏的漏洞。我们实现了RSF UZZER，并在六个供应商提供的16个UEFI固件映像上进行了评估。实验结果显示，RSF UZZER平均可以覆盖617%更多的基本块，并检测到828%更多的漏洞，比最先进的混合模糊测试技术要好。此外，我们在评估的UEFI固件映像中发现并报告了65个0-day漏洞，并分配了14个CVE ID。值得注意的是，其中6个0-day漏洞是在英特尔的现成产品中发现的，这些产品在发布之前可能已经经过了Excite的测试。\n\n索引术语-UEFI；SMM；模糊测试；SMI处理程序；SMM漏洞。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8A：Low-level software security\\SegFuzz：Segmentizing Thread Interleaving to Discover Kernel Concurrency Bugs through Fuzzing.pdf": {
        "title": "SegFuzz：Segmentizing Thread Interleaving to Discover Kernel Concurrency Bugs through Fuzzing",
        "abstract": "通过模糊测试发现内核并发错误是具有挑战性的。与非并发错误不同，识别内核并发错误需要分析两个或多个线程之间可能的交错。然而，由于线程交错的搜索空间非常广阔，因此不可能研究所有可能的线程交错。为了探索广阔的搜索空间，大多数先前的方法执行随机或简单的启发式搜索，而没有对线程交错进行覆盖或具有不足的覆盖形式。结果，它们要么进行了冗余执行的无用搜索，要么忽视了其覆盖范围无法处理的并发错误。为了克服这些限制，我们提出了SEGFUZZ，一种用于内核并发错误的模糊测试框架。在探索线程交错的搜索空间时，SEGFUZZ将整个线程交错分解为一组段，每个段表示少量指令的交错，并将各个段用作交错覆盖，称为交错段覆盖。在搜索线程交错时，SEGFUZZ会改变已探索的交错段中的交错，以构建尚未探索的新线程交错。使用SEGFUZZ，我们在Linux内核中发现了21个新的并发错误，并通过显示SEGFUZZ相较于最先进的方法能够平均快4.1倍来证明SEGFUZZ的效率。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8A：Low-level software security\\When Top-down Meets Bottom-up：Detecting and Exploiting Use-After-Cleanup Bugs in Linux Kernel.pdf": {
        "title": "When Top-down Meets Bottom-up：Detecting and Exploiting Use-After-Cleanup Bugs in Linux Kernel",
        "abstract": "当设备从系统中分离时，可能会发生使用后清理（UAC）漏洞，因为运行中的内核线程可能不知道设备的分离，并尝试使用已被清理线程释放的对象。我们的调查表明，攻击者可以利用UAC漏洞获取任意代码执行和权限提升的能力，而这在社区中受到很少关注。虽然现有工具主要关注于已知的并发漏洞，如数据竞争，但很少有目标是UAC漏洞的工具。\n\n在本文中，我们提出了一个名为UACatcher的工具，用于系统地检测UAC漏洞。UACatcher由三个主要阶段组成。首先，它扫描整个内核以找到目标层。然后，它采用上下文和流敏感的跨过程分析以及指向分析，以定位底向上的清理线程中可能的释放（释放）位置和顶向下的内核线程中可能引发UAC漏洞的使用（解引用）位置。然后，UACatcher使用基于例行切换点算法，依赖于同步和路径约束，来检测这些位置中的UAC漏洞并估计可利用的漏洞。对于可利用的漏洞，我们利用基于伪终端的设备仿真技术开发了实用的利用工具。\n\n我们已经实现了UACatcher的原型，并在5.11 Linux内核上进行了评估。结果，我们的工具成功检测到了346个UAC漏洞，并向社区报告了这些漏洞（已确认和修复了277个漏洞，并分配了15个CVE编号）。此外，还有13个漏洞是可利用的，可以用于开发在内核空间中获得任意代码执行原语和实现权限提升的工作利用工具。最后，我们讨论了UACatcher的局限性，并提出了修复和预防UAC漏洞的可能解决方案。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8B：Privacy and covert channels\\A Theory to Instruct Differentially-Private Learning via Clipping Bias Reduction.pdf": {
        "title": "A Theory to Instruct Differentially-Private Learning via Clipping Bias Reduction",
        "abstract": "我们研究了在差分隐私随机梯度下降（DP-SGD）中引入的偏差，其中使用了剪切或归一化的每个样本梯度。作为确保有界敏感性的最流行但人工操作之一，梯度剪切使得可以对许多迭代优化方法进行复合隐私分析，而无需对学习模型或输入数据进行额外的假设。尽管梯度剪切具有广泛的适用性，但它在系统地指导隐私或效用的改进方面也存在理论上的挑战。一般而言，在没有对全局梯度进行有界假设的情况下，经典的收敛分析并不适用于剪切梯度下降。此外，由于对效用损失的理解有限，许多现有的DP-SGD改进方法都是启发式的，特别是在私有深度学习的应用中。\n\n在本文中，我们提供了通过彻底的实证结果验证的DP-SGD的有意义的理论分析。我们指出梯度剪切导致的偏差在先前的工作中被低估了。对于通过DP-SGD进行通用非凸优化，我们展示了一个关键因素导致偏差，即要剪切的随机梯度的采样噪声。因此，我们使用开发的理论从不同的角度建立了一系列减少采样噪声的改进方法。从优化角度来看，我们研究了方差减小技术，并提出了内外动量。在学习模型（神经网络）层面上，我们提出了几种增强网络内部归一化和BatchClipping的技巧，以精确剪切一批样本的梯度。对于数据预处理，我们对最近提出的通过数据归一化和（自我）增强进行改进的理论进行了理论上的证明。\n\n将这些系统的改进方法结合在一起，通过DP-SGD进行私有深度学习在许多任务中可以得到显著的增强。例如，在计算机视觉应用中，使用(ϵ= 8, δ= 10−5)的DP保证，我们成功地在CIFAR10和SVHN上训练了ResNet20，分别获得了76.0%和90.1%的测试准确率；对于自然语言处理，使用(ϵ= 4, δ= 10−5)，我们成功地在IMDb数据上训练了一个递归神经网络，获得了77.5%的测试准确率。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8B：Privacy and covert channels\\Continual Observation under User-level Differential Privacy.pdf": {
        "title": "Continual Observation under User-level Differential Privacy",
        "abstract": "在Dwork等人的基础工作中[15]，关于差分隐私（DP）下的持续观察，提出了两种隐私模型：事件级别的DP和用户级别的DP。后者提供了更强的隐私概念，因为它允许用户贡献任意数量的项目。在事件级别的DP下，他们的机制在静态设置中与最优效用界限相匹配，直到多对数因子为止，适用于所有保持并集的函数。不幸的是，与事件级别DP的这一强结果相比，他们的用户级别DP机制在数据上具有较弱的效用保证和许多限制。在本文中，我们采用实例特定的方法，在用户级别DP下为若干基本函数设计持续观察机制。我们的机制不需要对数据进行任何先验限制，同时在数据难度增加时提供逐渐降低的效用保证。对于计数和求和函数，我们的机制是下邻域最优的，在多对数因子上与静态设置相匹配。对于其他函数，它们与静态情况不匹配，但我们证明这是不可避免的，这是差分隐私下持续观察的第一个分离结果。\n\n关键词-差分隐私、持续观察、用户级别差分隐私"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8B：Privacy and covert channels\\Discop：Provably Secure Steganography in Practice Based on 'Distribution Copies'.pdf": {
        "title": "Discop：Provably Secure Steganography in Practice Based on 'Distribution Copies'",
        "abstract": "—隐写术是将秘密信息的传输伪装成看似无害的行为。虽然几十年来已经提出了可证明安全的隐写术，但由于其对传统数据环境的严格要求（如完美的采样器和明确的数据分布），它在这个领域并不常见。深度生成模型的流行度逐渐增加，可以为解决这个问题提供良好的机会。近年来已经提出了几种基于深度生成模型的试图实现可证明安全的隐写术方法。然而，由于不切实际的条件，例如离散元素的平衡分组和消息与通道分布的完美匹配，它们在实践中无法达到预期的安全性。在本文中，我们提出了一种新的可证明安全的实践隐写术方法，名为Discop，在生成过程中构建了几个“分布副本”。在生成的每个时间步骤中，消息确定从哪个“分布副本”中进行采样。只要接收者与发送者在某些共享信息上达成一致，他就可以无误地提取消息。为了进一步提高嵌入率，我们通过创建哈夫曼树递归地构建更多的“分布副本”。我们证明Discop可以严格保持原始分布，使得对手无法比随机猜测更好。此外，我们对多种数字媒体的多个生成任务进行了实验，结果显示Discop的安全性和效率优于先前的方法。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8B：Privacy and covert channels\\Locally Differentially Private Frequency Estimation Based on Convolution Framework.pdf": {
        "title": "Locally Differentially Private Frequency Estimation Based on Convolution Framework",
        "abstract": "本文介绍了本地差分隐私（Local differential privacy, LDP）的概念，它在保护用户隐私和消除对可信数据收集器的需求时收集用户数据。已经提出并在真实应用中部署了几种LDP协议。频率估计是LDP协议中的一项基本任务，它使得数据分析中的更高级任务成为可能。然而，现有的LDP协议会放大频率估计中添加的噪声，从而无法达到最佳的准确性。本文引入了一个卷积框架来分析和优化LDP协议中的频率估计。这个卷积框架可以等效地将原始的频率估计问题转化为一个带有噪声的反卷积问题。因此，我们将基于维纳滤波器的反卷积算法添加到LDP协议中，以估计频率并抑制添加的噪声。对不同的真实世界数据集进行的实验结果表明，我们提出的算法可以使最先进的LDP协议在平滑数据集上的准确性大幅提高。这些算法也能够在非平滑数据集上工作，但只有在有限程度上。我们的代码可在 https://github.com/SEUNICK/LDP 上找到。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8B：Privacy and covert channels\\Telepath：A Minecraft-based Covert Communication System.pdf": {
        "title": "Telepath：A Minecraft-based Covert Communication System",
        "abstract": "在面对国家级对手的情况下，隐秘、抗审查的通信需要使用无法通过网络流量分析来检测的不可见通道。流量替代，即用隐秘内容替换由“掩盖”应用程序传输的数据，利用已存在的加密通道来产生与掩盖应用程序的流量在统计上无法区分的流量，从而难以进行审查。\n\n在线游戏是建立绕过通道的有希望的平台，因为它们在许多受审查的地区非常受欢迎。然而，我们发现以前提出的流量替代方法无法直接应用于游戏中。它们的痕迹，即使在统计上类似于游戏的痕迹，可能违反游戏特定的不变量，因此容易被检测到，因为它们无法由实际游戏生成。\n\n我们解释了如何识别非破坏性内容，其替代不会导致客户端-服务器不一致性，并利用这些思想设计和实现了一个名为TELEPATH的隐秘通信系统，它使用Minecraft作为平台。TELEPATH利用了（1）Minecraft的加密客户端-服务器通道，（2）分散架构，使得个人用户可以运行自己的服务器，以及（3）为Minecraft客户端和服务器增加功能的“模组”的普及性。TELEPATH运行一个Minecraft游戏，但用隐秘内容替代了非破坏性的游戏内消息，而不改变游戏与网络管理器的交互。\n\n我们测量了TELEPATH在Web浏览和音频流媒体方面的性能，并展示了由TELEPATH生成的网络流量能够抵抗旨在将其与流行的Minecraft机器人区分开来的统计流量分析。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8C：Side-channel attacks\\A Security RISC：Microarchitectural Attacks on Hardware RISC-V CPUs.pdf": {
        "title": "A Security RISC：Microarchitectural Attacks on Hardware RISC-V CPUs",
        "abstract": "微架构攻击即使在没有软件漏洞的情况下，也会威胁计算机系统的安全。在x86和ARM CPU上已经广泛研究了这种攻击，提出了各种尚未部署的硬件对策。随着RISC-V指令集架构的标准化和主要处理器供应商对该架构的支持宣布，RISC-V CPU即将成为无处不在的存在。然而，第一批商用的RISC-V硬件CPU的微架构攻击面仍需探索。本文分析了两款商用的现成64位RISC-V（硬件）CPU，这些CPU被大多数运行完整的普通Linux系统的RISC-V系统所使用。我们评估了这些CPU的微架构攻击面，并介绍了三种新的微架构攻击技术：Cache+Time，一种新颖的基于缓存行的缓存攻击，无需共享内存；Flush+Fault利用哈佛缓存结构实现Flush+Reload；CycleDrift利用非特权访问指令退休信息。我们还展示了许多已知攻击对这些RISC-V CPU也适用，主要是由于缺乏硬件对策和指令集的微妙之处未考虑到微架构攻击面。我们在6个案例研究中演示了我们的攻击，包括第一个针对RISC-V的微架构KASLR破解和基于CycleDrift的检测内核活动的方法。根据我们的分析，我们强调在CPU设计的每个步骤中都需要考虑微架构攻击面，包括自定义ISA扩展。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 8C：Side-channel attacks\\DevIOus：Device-Driven Side-Channel Attacks on the IOMMU.pdf": {
        "title": "DevIOus：Device-Driven Side-Channel Attacks on the IOMMU",
        "abstract": "现代计算机系统利用输入/输出内存管理单元（IOMMU）来保护内存免受DMA攻击，或在虚拟化中实现强隔离。尽管IOMMU有很多潜在好处，但它也可能成为安全威胁的新来源。与内存管理单元（MMU）类似，IOMMU也有一个名为IOTLB的地址转换缓存，用于保存最近的转换。因此，IOTLB可能成为一种时序侧信道攻击的目标，揭示受害者的秘密。本文介绍了一种新型的基于设备的侧信道攻击D EVIOUS，利用IOTLB来进行攻击。D EVIOUS利用支持DMA的PCIe设备（如GPU和支持RDMA的NIC）来进行攻击。因此，我们的攻击对受害者机器的CPU缓存或TLB没有影响。实施D EVIOUS并不容易，因为Intel处理器的IOTLB的微体系结构细节是隐藏的。我们通过逆向工程IOTLB并揭示其隐藏的体系结构属性来克服这个问题。基于此，我们使用GPU和RNIC构建了两种基于IOTLB的时序攻击原语。然后，我们演示了针对硬件辅助隔离下的共存虚拟机和通过RDMA网络连接的远程机器的实际攻击。我们还讨论了可能的缓解措施来抵御提出的侧信道攻击。"
    }
}