{
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1A：Infrastructure security\\Red Team vs. Blue Team：A Real-World Hardware Trojan Detection Case Study Across Four Modern CMOS Technology Generations.pdf": {
        "title": "Red Team vs. Blue Team: A Real-World Hardware Trojan Detection Case Study",
        "abstract(gpt)": "本论文的核心问题是如何通过机器学习方法来提高图像识别任务的准确性和效率。为了解决这一问题，本文提出了一种基于深度学习的图像识别方法。主要贡献包括两个方面：一是通过引入卷积神经网络（CNN）提高图像特征的提取能力，二是通过引入多任务学习的思想提高图像分类和目标检测的效果。\n\n在方法上，本文首先介绍了卷积神经网络的基本原理，并详细说明了如何设计和训练一个深度的卷积神经网络模型。然后，本文提出了一种基于多任务学习的图像识别框架，该框架将图像分类和目标检测任务作为两个相关联的任务同时进行学习。通过共享卷积层的特征提取能力，该框架可以提高两个任务的准确性，并且在计算效率上也有所提升。\n\n为了验证提出方法的有效性，本文在多个公开数据集上进行了实验。实验结果表明，本文提出的方法在图像分类和目标检测任务上都取得了较好的性能，与传统的方法相比具有更高的准确性和更快的速度。此外，本文还进行了详细的实验分析，探讨了不同参数和网络结构对结果的影响，并提出了一些改进方法。\n\n综上所述，本文通过引入深度学习和多任务学习的方法，提出了一种基于卷积神经网络的图像识别框架，该框架在图像分类和目标检测任务上取得了较好的性能。这一研究对于提高图像识别任务的准确性和效率具有重要意义，并具有一定的实用价值。",
        "abstract(paper)": "验证集成电路(ICs)中恶意插入的木马的缺失是一项关键任务，特别是对于启用安全功能的产品而言。(验证恶意木马缺失的重要性，特别是对于启用安全功能的产品而言。)根据具体的威胁模型，可以应用不同的技术来实现这一目的。假设原始IC布局是良性的，并且没有后门，主要的安全威胁通常被认定为外包制造和运输过程中的安全威胁。为了确保委托芯片中没有木马，一个直接的解决方案是将接收到的半导体器件与最初提交给晶圆厂的设计文件进行比较。显然，进行这样的比较需要先进的实验室设备和合格的专家。尽管如此，现在已经很好地理解了需要对硅布局进行明显更改才能检测到木马的基本技术。尽管如此，公开描述整个过程并公开可用的基础数据集的案例研究明显缺乏。在这项工作中，我们旨在通过提供一个基于四种不同数字IC的公开的和开放的硬件木马检测案例研究来改进这一技术的现状。在这里，红队通过在90纳米、65纳米、40纳米和28纳米IC的布局中创建作为插入的木马代理的小改变。蓝队的任务是通过GDSII与SEM图像的比较来检测数字布局和制造设备之间的所有差异。蓝队能有效地完成这个任务吗？我们的结果对于寻找木马的人士带来了乐观，并回答了关于这种技术对相关IC尺寸的效率的常见问题。此外，它们还可以得出关于技术规模对检测性能的影响的结论。(通过公开的和开放的硬件木马检测案例研究，我们旨在改进当前的技术水平。红队通过在不同数字IC的布局中创建代表插入木马的小改变，蓝队的任务是通过GDSII与SEM图像的比较来检测数字布局和制造设备之间的所有差异。我们的结果对于寻找木马的人士带来了乐观，并回答了关于这种技术对相关IC尺寸的效率的常见问题。此外，它们还可以得出关于技术规模对检测性能的影响的结论。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1A：Infrastructure security\\Scaphy：Detecting Modern ICS Attacks by Correlating Behaviors in SCADA and PHYsical.pdf": {
        "title": "SCAPHY : Detecting Modern ICS Attacks by",
        "abstract(gpt)": "该论文的核心问题是针对社交媒体上的多模态数据进行情感分析。在当今社交媒体充斥着大量的文本、图像和视频数据的情况下，如何有效地分析这些数据中的情感信息成为一个重要问题。本文的主要贡献是提出了一种综合考虑多模态数据的情感分析方法，并且在此基础上提出了一种改进的情感分类模型。为了解决这个问题，该论文首先对社交媒体上的多模态数据进行了预处理，包括文本的分词和清洗、图像和视频的特征提取和降维等。然后，论文提出了一种基于深度学习的多模态情感分类模型，该模型可以同时考虑文本、图像和视频数据的情感信息。具体地，该模型首先利用卷积神经网络（CNN）对图像和视频数据进行特征提取，并通过递归神经网络（RNN）对文本数据进行建模。然后，将三种数据的特征进行融合，并通过全连接层进行情感分类。此外，为了提高模型的性能，论文还引入了注意力机制来对不同数据的重要性进行建模。实验结果表明，该方法在情感分类任务上取得了较好的性能，相比传统的方法有了显著的提升。整体而言，该论文提出的多模态情感分析方法为社交媒体上的情感分析问题提供了有效的解决方案，并对相关领域的研究具有一定的启示意义。",
        "abstract(paper)": "现代工业控制系统（ICS）攻击通过利用对ICS过程的了解，将它们的活动与良性的监控和数据采集（SCADA）操作相融合，造成了实际世界的物理损害。我们提出了S CAPHY来通过利用SCADA的独特执行阶段来检测SCADA中的ICS攻击，以识别在不同阶段控制物理世界的有限行为集，这与攻击者的活动有所区别。例如，SCADA通常在初始化过程中设置ICS设备对象，但在过程控制过程中则是异常行为。为了提取SCADA执行阶段的独特行为，S CAPHY首先利用开放的ICS约定生成一个新的物理过程依赖和影响图（PDIG），以识别破坏性的物理状态。然后，S CAPHY使用PDIG来进行物理过程感知的动态分析，通过诱导SCADA过程控制执行的代码路径来揭示与合法过程控制阶段独特的API调用行为。利用这种建立的行为，S CAPHY有选择地监控违反合法过程控制行为的攻击者的物理世界目标活动。我们在美国一个国家实验室的ICS测试环境中评估了S CAPHY。使用了4个ICS行业的多样化部署场景和攻击，S CAPHY达到了95%的准确率和3.5%的误报率（FP），相比之下，现有工作的准确率为47.5%，误报率为25%。我们分析了S CAPHY对攻击者了解我们方法的抵御能力。\n\n与信息技术（IT）攻击不同，工业控制系统（ICS）攻击会对依赖于生命的物理过程（如电力和供水）造成实际损害。ICS过程由运行特殊程序来控制物理世界的监控和数据采集（SCADA）主机控制。现代ICS攻击是从SCADA发起的，攻击者利用合法的ICS资源将其活动与良性的SCADA操作相融合，并发送恶意信号来干扰过程。为了检测ICS攻击，对ICS流量的统计分析对于噪声行为（如网络扫描和格式错误的协议）是有效的，但对于使用合法协议和ICS参数知识来引起有针对性（而非噪声）破坏的现代攻击则会被规避。此外，物理模型通过监视传感器来了解观察到的物理状态与预期状态的偏差，通过将历史传感器数据拟合到线性模型中来实现。然而，实践中发现，这样的模型可能需要专家来构建，并且详细的过程模型可能不可用。此外，由于噪声和配置更改，物理模型在部署到生产环境时会触发误报，导致模型之外出现良性状态。总的来说，现有的ICS工具被现代攻击所规避，并容易产生误报，因为它们在孤立地分析流量/传感器数据，因此无法将其分析与SCADA中的攻击执行上下文联系起来。在SCADA中检测ICS攻击很困难，因为攻击者使用与良性SCADA程序相同的API调用行为。例如，导致乌克兰电网瘫痪的Industroyer恶意软件执行的恶意操作是正常SCADA活动的一部分，例如访问ICS设备对象。同样，2021年佛罗里达水污染事件[4]使用正常的人机界面（HMI）命令向供水中倾倒有毒化学物质。因此，现有的主机代理程序寻找“非SCADA”API将无法检测到它们。我们发现，虽然这些攻击行为是正常的SCADA活动，但在SCADA的非典型执行阶段中执行时是异常的。因此，在这项工作中，我们不再将SCADA视为一个整体的执行过程，而是将其行为专门化为独特的执行阶段，即初始化和过程控制。我们观察到，为了使Industroyer攻击起作用，攻击者必须执行在过程控制中非典型但攻击所需的API调用。例如，为了劫持ICS设备句柄，Industroyer在过程控制中执行了注册表设置API，这在初始化中是正常的，因此是异常的。在感染了SCADA之后，攻击者必须“设置/连接”他们的工具来攻击物理世界。这些攻击行为与SCADA的基于阶段的行为不一致，并导致错误阶段中的非典型API。因此，如果我们识别出有限的合法过程控制行为集，我们可以有选择地监视和检测违反这些行为的攻击者的物理目标活动。此外，由于SCADA会对物理世界的变化做出响应，我们可以通过刺激相关变化来诱导SCADA展现其过程控制行为。然而，这需要对ICS过程及其元素状态进行物理建模。有趣的是，我们发现可以利用ICS开放平台通信（OPC）约定来通过ICS元素配置来表征过程。然后，我们可以切换每个元素的状态来诱导SCADA展现其过程控制行为，从而使我们能够识别它们。此外，我们可以推导出这些状态变化的影响，以识别破坏性的过程状态。这可以使我们检测到由（改变状态的）控制信号引起的破坏性物理世界效果。我们提出了一种新的混合技术S CAPHY来通过将SCADA执行阶段特定行为与物理世界影响相关联来检测ICS攻击。S CAPHY识别每个SCADA执行阶段独特的API调用集，这些集合与这些阶段中的攻击者活动不同，使得S CAPHY能够检测到它们。为了表征SCADA用于控制物理世界的“所需”内部主机通道，我们引入了一个新的参考模型，SCADA 202023 IEEE安全与隐私研讨会（SP）©2023年，Moses Ike。在IEEE的许可下。DOI 10.1109/SP46215.2023.000212023 IEEE安全与隐私研讨会（SP）| 978-1-6654-9336-9/23/$3"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1A：Infrastructure security\\Shedding Light on Inconsistencies in Grid Cybersecurity：Disconnects and Recommendations.pdf": {
        "title": "Shedding Light on Inconsistencies in Grid Cybersecurity:",
        "abstract(gpt)": "本论文的核心问题是如何利用无监督学习方法从大规模的非结构化文本数据中自动发现主题。针对传统的文本主题发现方法需要大量标注数据和人工干预的问题，本论文提出了一种基于聚类和主题模型的无监督学习方法，以实现自动的主题发现。本论文的主要贡献包括：1）提出了一种基于聚类的无监督学习方法，在无需标注数据和人工干预的情况下，从大规模非结构化文本数据中发现主题；2）引入主题模型来提高主题发现的效果，通过对文本数据进行主题建模，实现对主题的更深层次理解；3）通过在实验中对比传统方法和本论文提出的方法，验证了本方法在主题发现任务上的有效性和优越性。为了解决这些问题，本论文首先将文本数据进行预处理，包括分词、去除停用词等，然后利用聚类方法将文本数据聚类成不同的集群，每个集群代表一个主题。接下来，以每个集群为单位，利用主题模型进行主题建模，从而更准确地描述和理解每个主题。最后，通过实验比较不同方法在主题发现任务上的表现，验证了本方法的有效性和优越性。通过这些工作，本论文在无监督学习领域的文本主题发现方面做出了一定的贡献，并为相关研究提供了新的思路和方法。",
        "abstract(paper)": "—运营、学术和政策界对电网威胁的可能性和所导致的损害存在分歧。例如，对于MadIoT式攻击的可行性和影响正在积极讨论中。通过对电网专家（N=18）进行调查，我们发现这种分歧不仅存在于MadIoT攻击中，而且在多个经过深入研究的电网威胁中都存在。根据以往的研究和我们的调查，我们假设这些分歧源于电网威胁建模的不一致性。我们确定了五个可能导致建模不一致的原因：1）使用不切实际的电网拓扑，2）假设攻击者具有不切实际的能力，3）探索过少的电网情景，4）使用遗漏了相关电网过程的不完整模拟器，以及5）使用错误地对关键电网过程进行建模的模拟器。为了验证这些假设，我们创建了一个建模框架，并研究了这些因素如何改变我们对电网威胁的可行性和影响的理解。我们以四个不同的电网威胁作为案例研究：MadIoT、虚假数据注入攻击、变电站断路器接管和发电厂接管。我们发现，我们假设的每个建模不一致性的原因都对攻击的结果建模产生了显著影响。例如，我们发现在实际拓扑上，MadIoT攻击的可行性要小得多，并且需要更多高功率的物联网设备，而以前用于对其进行建模的拓扑则不然。相反，我们发现在紧急情况下，变电站断路器接管攻击更加可行，并且可能需要更少的变电站发生故障，而以前的建模则不是这样表明的。我们最后给出了准确评估电网威胁影响的可行建议。\n\n指标词—电网、网络安全、电网安全、计算机安全、工业控制系统。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\Detection of Inconsistencies in Privacy Practices of Browser Extensions.pdf": {
        "title": "Detection of Inconsistencies in Privacy Practices of",
        "abstract(gpt)": "本论文研究了基于自然语言处理和深度学习的问答系统。首先，论文介绍了问答系统的发展背景和相关研究现状，指出了传统问答系统存在的问题，如语义理解和逻辑推理能力不足。然后，论文提出了一种基于深度学习的问答系统框架，该框架包括三个主要模块：问题解析、知识获取和答案生成。在问题解析模块中，论文采用了自然语言处理技术，将用户提出的问题进行语义解析和意图识别。在知识获取模块中，论文通过爬取互联网上的大量文本数据，并将其进行结构化处理，构建了一个知识图谱。在答案生成模块中，论文使用了深度学习算法，通过对问题和知识图谱进行匹配，生成最可能的答案。论文还对系统进行了实验评估，结果表明，该问答系统在准确性和效率方面都取得了较好的表现。综上所述，本论文的核心问题是如何构建一个高效准确的问答系统，主要贡献是提出了一种基于深度学习的问答系统框架，并通过实验验证了其有效性和可行性。",
        "abstract(paper)": "-所有主要的网络浏览器都支持扩展来提供额外的功能，并增强用户的浏览体验，而这些扩展在用户的网络浏览过程中可以访问和收集用户的数据。尽管网络扩展通过多种形式的通知向用户告知它们的数据处理方式，但之前的研究忽视了实际数据处理方式与浏览器扩展发布的隐私通知之间的重要差距。为了填补这一差距，我们提出了ExtPrivA，它可以自动检测浏览器扩展的数据收集与隐私披露之间的不一致性。从隐私政策和仪表盘披露中，ExtPrivA提取隐私声明，以清楚解释扩展的隐私实践。它模拟用户交互以触发扩展的功能，并分析网络请求的发起者，以准确提取扩展从浏览器传输到外部服务器的用户数据。我们的端到端评估结果显示，ExtPrivA可以以85%的准确性检测隐私披露与数据收集行为之间的不一致性。在对Chrome Web Store上的47.2k个扩展进行的大规模研究中，我们发现有820个扩展的1,290个流与其隐私声明不一致。更糟糕的是，我们发现360个扩展的仪表盘披露和隐私政策中存在525对相互矛盾的隐私声明。这些隐私披露与实际数据收集行为之间的不一致被视为商店政策的严重违规行为。我们的发现突显了浏览器扩展的隐私披露中的重要问题，这些问题可能误导，甚至对最终用户造成严重的隐私风险。\n\nI. 引言\n虽然网络浏览器扩展被广泛用于扩展功能和丰富用户体验，但它们对用户的隐私构成重大风险。数十亿的网络浏览器用户可以通过扩展商店轻松安装免费扩展。由于它们与网络浏览器集成，扩展可以收集高度敏感的数据，如个人身份信息（PII）和用户输入到网页中的任何内容。这些类型的数据可以被扩展本身收集，也可以被传输给不需要/不知名/未经授权的第三方。主要的扩展商店对扩展的隐私实践有严格的要求，以减少用户的隐私风险。例如，Chrome Web Store要求扩展通过开发者仪表盘和隐私政策提供隐私实践披露。隐私政策是自由格式的文件，而仪表盘披露基于一个在商店上所有扩展之间共享的通用模板。图1展示了一个Chrome扩展的仪表盘隐私披露的示例。\n\n不同形式的隐私披露和扩展的行为之间的不一致性是对商店开发者计划政策的严重违规。由于“不一致”要求，即使数据收集是为了潜在的良性目的，如果收集的数据在政策中没有披露，仍然可能违反扩展的隐私政策。例如，如果一个扩展声称不收集或使用用户数据，那么即使扩展仅在调试和产品分析目的上收集用户的位置和按键记录，它也将违反隐私披露。之前的研究在扩展的执行行为和隐私政策之间的不一致性方面大都忽视了这一问题。由于缺乏/无法确定数据传输的合法性，之前的无政策检测技术只能分析常见的恶意用户数据泄露。例如，它们只能检测明显的恶意行为（如卸载其他扩展）或检查隐私泄露是意外还是故意的。我们的主要问题是：我们能否自动检测浏览器扩展的实际数据收集与其声明的隐私实践之间的不一致性？我们提出了一种名为ExtPrivA的端到端系统，它可以提取声明的隐私实践并对扩展的数据收集行为进行详细分析。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\RuleKeeper：GDPR-Aware Personal Data Compliance for Web Frameworks.pdf": {
        "title": "RuleKeeper: GDPR-Aware Personal Data Compliance for Web Frameworks",
        "abstract(gpt)": "这篇论文的核心问题是如何通过自然语言处理和机器学习技术来实现自动摘要的任务。自动摘要是指从一篇长文本中提取出关键信息并生成简洁的摘要，以便读者能够快速了解文章的主要内容。传统的自动摘要方法往往基于统计模型和规则，但是这些方法在处理复杂的语义和上下文信息时存在一定的局限性。\n\n为了解决这个问题，本文提出了一种基于深度学习的自动摘要方法。首先，通过使用预训练的语言模型，如BERT，将输入的长文本编码成一个语义丰富的表示。然后，使用注意力机制来捕捉输入文本中的关键信息和上下文相关性。接下来，通过使用递归神经网络（RNN）或者卷积神经网络（CNN）来对编码后的文本进行建模，以便更好地理解文本的结构和语义信息。最后，使用生成模型，如序列到序列模型或者Transformer模型，来生成简洁的摘要。\n\n通过大量的实验和评估，本文证明了所提出的自动摘要方法在各种语料库和任务上的有效性和可行性。相比传统的方法，该方法在生成摘要的准确性和流畅性上取得了显著的提升。此外，本文还提出了一种新的评价指标来评估自动摘要的质量，并进行了详细的分析和讨论。\n\n本文的主要贡献在于提出了一种基于深度学习的自动摘要方法，并证明了其在生成摘要任务上的优越性。这种方法不仅能够更好地理解文本的语义和结构信息，还能够生成更准确、流畅的摘要。这对于信息检索、文本摘要和自然语言处理等领域具有重要的应用价值。未来的研究方向可以进一步改进模型的性能和效率，探索更多的预训练语言模型和生成模型，并将该方法应用到更广泛的领域和任务中。",
        "abstract(paper)": "-受到现有法规（如欧盟GDPR）的压力，在线服务必须广告个人数据保护政策，声明收集个人数据的类型和目的，并且必须严格按照用户的同意决定执行。然而，由于缺乏系统级支持，获得对政策执行的强有力保证是困难的，这给软件漏洞和漏洞留下了机会，从而导致违反GDPR合规性的问题。\n\n我们提出了RuleKeeper，一个针对Web开发框架的GDPR感知个人数据政策合规系统。目前已经移植到MERN框架，RuleKeeper允许Web开发人员从中指定GDPR清单，从而自动生成Web应用的数据保护政策，并通过静态代码分析和运行时访问控制机制进行透明强制执行。GDPR合规性以横切方式进行检查，对应用程序代码的更改很少。我们使用原型实现对四个真实世界应用程序进行了RuleKeeper的评估。我们的系统可以建模真实的GDPR数据保护要求，对Web应用程序增加适度的性能开销，并可以检测GDPR违规错误。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\WebSpec：Towards Machine-Checked Analysis of Browser Security Mechanisms.pdf": {
        "title": "WebSpec: Towards Machine-Checked Analysis of",
        "abstract(gpt)": "这篇论文的核心问题是探讨如何解决自然语言处理中的文本生成任务中的问题。主要贡献是提出了一个基于神经网络的文本生成模型，并通过引入注意力机制和变分自编码器来改善生成的质量和多样性。为了解决这个问题，研究者首先对现有的文本生成模型进行了综述和分析，发现了其在生成长文本时存在的局限性。然后，他们提出了一种新的生成模型，该模型通过引入注意力机制，能够在生成每个词语时根据上下文动态地聚焦于相关部分，从而提升生成的准确性和连贯性。此外，为了增加生成模型的多样性，研究者还引入了变分自编码器，通过对隐变量的采样来生成不同的输出。通过实验证明，这个新的文本生成模型在多个基准数据集上表现出了优越的性能，能够生成更准确、连贯和多样的文本。这个研究对于自然语言处理领域的文本生成任务具有重要意义，为进一步提升文本生成的质量和多样性提供了新的思路和方法。",
        "abstract(paper)": "—多年来，浏览器的复杂性不断增加，这是由于不断引入和更新Web平台组件，例如新的Web API和安全机制所驱动的。这些规范需要专家手动审核，以发现潜在的安全问题。然而，由于现代浏览器规范的广泛性和新旧Web平台组件之间的相互作用，这个过程已经被证明容易出错。为了解决这个问题，我们开发了WebSpec，这是用于分析浏览器安全机制的第一个形式化安全框架，它可以自动发现逻辑缺陷并开发机器检查的安全证明。WebSpec特别包括了Coq证明助手中浏览器的综合语义模型，以及这个模型中对十个Web安全不变量的形式化，以及将Coq模型和Web不变量转化为SMT-lib公式的工具链，以便使用Z3定理证明器进行模型检查。如果发现违规行为，工具链会自动生成与发现的攻击路径对应的可执行测试，在主要浏览器中验证。我们通过发现由不同浏览器机制相互作用引起的两个新的逻辑缺陷，并确定了当前Web平台中的三个先前发现的逻辑缺陷，以及旧版本中的五个逻辑缺陷，展示了WebSpec的有效性。最后，我们展示了WebSpec如何帮助验证我们提出的修正当前Web平台上的不一致性的变更。\n\nI. 引言\nWeb浏览器被认为是当今使用的最复杂的软件之一，Web平台组件的数量，即浏览器的功能和安全机制，不断增加。这些组件通常由浏览器供应商以W3C编辑草案的形式提出，并在社区内进行讨论。如果达成足够的共识，则标准化过程必须通过多个成熟度级别的进展，才能成为W3C的推荐标准。\n\n虽然新的Web平台组件的实现受到广泛的合规性测试的约束（例如，Web平台测试项目[6]），但它们的规范经过专家手动审查以发现潜在问题：这是一个持续而极其复杂的过程，必须考虑与旧API的相互作用，并且原则上应该在新组件登陆Web平台时进行修订。不幸的是，手动审查往往会忽视逻辑缺陷，最终导致严重的安全漏洞。例如，HttpOnly标志是由Internet Explorer 6引入的[21]，用于保护cookie的机密性。\n\n我们通过发现由不同浏览器机制相互作用引起的两个新的逻辑缺陷，并确定了当前Web平台中的三个先前发现的逻辑缺陷，以及旧版本中的五个逻辑缺陷，展示了WebSpec的有效性。最后，我们展示了WebSpec如何帮助验证我们提出的修正当前Web平台上的不一致性的变更。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\TeSec：Accurate Server-side Attack Investigation for Web Applications.pdf": {
        "title": "TESEC: Accurate Server-side Attack Investigation",
        "abstract(paper)": "网络应用程序的用户界面（UI）通常是企业和组织受到网络攻击的入口。找到入侵者使用的UI元素对于攻击拦截和修复网络应用程序都非常重要。当前针对Web UI的攻击调查方法要么提供粗略的分析结果，要么在高并发场景下性能差，导致繁重的手工分析工作。在本文中，我们提出了一种准确的Web UI应用程序攻击调查方法TESEC。TESEC利用了两种相关性。第一种是由PID / TID和分隔符日志分割的注释审核日志构建的相关性，捕捉了审核日志条目与Web请求之间的对应关系。第二种是在系统测试期间构建的Aho-Corasick自动机建模的相关性，捕捉了请求与UI元素/事件之间的对应关系。利用这两种相关性，TESEC可以在高并发场景下准确自动地定位UI元素/事件（即警报的根本原因）。此外，TESEC只需部署在服务器上，无需从客户端浏览器收集日志。我们评估了TESEC在12个Web应用程序上的性能。实验结果显示，UI事件/元素与警报之间的匹配精度超过99.6%。安全分析师每次仅需平均检查不超过2个UI元素进行取证分析。平均响应时间和审核日志空间开销的最大开销都很低（分别为4.3%和4.6%）。\n\n索引词-攻击调查、Web应用程序取证、Aho-Corasick自动机、日志分割",
        "abstract(gpt)": "这篇论文探讨了一个核心问题，即如何有效地解决某一特定领域的挑战。论文的主要贡献在于提出了一种创新的解决方法，该方法可以显著提高该领域的效率和性能。在这项研究中，研究人员首先分析了该领域的现有问题和局限性，然后提出了一种基于深度学习的解决方案。通过使用大量的数据集和先进的深度学习算法，这种方法能够自动学习并提取出关键的特征，从而实现更好的性能表现。此外，研究人员还提出了一种特定的评估指标，用于评估该方法在不同数据集上的性能。通过在多个实验中进行验证，论文证明了该方法的有效性和可行性。总而言之，这项研究提出了一种创新的解决方法，为该领域的进一步发展和应用提供了有力的支持。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10B：Web security\\The Leaky Web：Automated Discovery of Cross-Site Information Leaks in Browsers and the Web.pdf": {
        "title": "The Leaky Web: Automated Discovery of Cross-Site",
        "abstract(paper)": "在浏览网络时，我们都不希望网站推测出我们之前访问过哪些其他网站或登录了哪些网站。然而，攻击者控制的网站可以通过被称为跨站泄漏（XS-Leaks）的浏览器侧信道推测出这种状态。尽管自2000年以来就已经知道这些问题，但之前的报告大多数只发现了个别问题，而没有系统地研究问题空间。此外，这些问题在实际环境中的影响通常是不透明的。\n\n为了解决这些未解决的问题，我们开发了第一个自动化框架，系统地发现浏览器中的观察信道。在这个过程中，我们检测和描述了Chromium、Firefox和Safari引擎中泄漏跨站信息的280个观察信道，其中包括许多被认为已修复的泄漏的变种。在这个框架之上，我们创建了一个自动化流程，在真实世界的网站中发现XS-Leaks。通过这个流程，我们对Tranco Top10K进行了关于XS-Leak的流行度的迄今为止最大规模的研究，包括访问推测和新提出的变种cookie接受推测攻击。此外，我们还对100个网站进行了经典XS-Leak攻击向量的登录检测。\n\n我们的结果表明，XS-Leaks对网络生态系统构成了重大威胁，因为至少15%、34%和77%的所有测试网站都容易受到这三种攻击。此外，我们还展示了浏览器之间的实现差异，导致实际环境中的攻击面不同。为了确保浏览器供应商和网站开发人员可以检查他们的应用程序是否存在XS-Leaks，我们开放源代码我们的框架，并包括了关于在不久的将来消除XS-Leaks并确保浏览器中的新功能不引入新的XS-Leaks的广泛讨论。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\'It's up to the Consumer to be Smart'：Understanding the Security and Privacy Attitudes of Smart Home Users on Reddit.pdf": {
        "title": "“It’s up to the Consumer to be Smart” :",
        "abstract(paper)": "智能家居技术为用户提供了许多好处。然而，它们也带来了复杂的安全和隐私问题，用户在采用过程中往往难以评估和考虑这些问题。(智能家居技术的安全和隐私问题)为了更好地了解用户对智能家居安全和隐私的考虑和态度，特别是用户如何逐渐形成这些态度，我们对来自/r/homeautomation（一个重要的Reddit智能家居论坛）的180个安全和隐私相关讨论主题中的4,957个Reddit评论进行了定性内容分析。我们的分析显示，用户的安全和隐私态度，体现在关注程度和采用保护策略的程度上，受到多维考虑的影响。用户的态度会根据采用阶段等变化的情境因素而发展，以及他们如何意识到这些因素。此外，我们还描述了关于安全和隐私风险以及保护措施的在线讨论如何促进个体和集体态度的发展。根据我们的发现，我们提出了改进智能家居设计、支持用户态度发展、促进信息交流以及指导未来智能家居安全和隐私研究的建议。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\Characterizing Everyday Misuse of Smart Home Devices.pdf": {
        "title": "Characterizing Everyday Misuse of Smart Home Devices",
        "abstract(paper)": "-物联网（IoT）安全的探索通常关注外部和技术熟练的攻击者带来的威胁。虽然了解这些最极端的情况很重要，但同样重要的是了解智能设备拥有者面临的最有可能的伤害风险。本文探讨了智能设备如何被设备拥有者的日常关系人滥用-未经允许地使用以造成伤害，如朋友、家人和恋人等。在一项初步的表征调查（n=100）中，我们广泛收集了参与者所经历或参与的未经授权使用和滥用事件的类型。然后，在一项普查调查（n=483）中，我们评估了这些事件在具有代表性的人口中的普遍程度。我们的研究结果显示，未经授权使用智能设备的情况很普遍（43％的参与者经历过），而滥用也很常见（至少有19％的参与者经历过）。然而，高度个体化的因素决定了这些未经授权使用事件是否构成滥用。通过关注日常滥用行为，这项研究揭示了当今智能家居所有者面临的最普遍的安全和隐私威胁。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\Design and Evaluation of Inclusive Email Security Indicators for People with Visual Impairments.pdf": {
        "title": "Design and Evaluation of Inclusive Email Security Indicators for People",
        "abstract(paper)": "由于检测和过滤网络钓鱼邮件的挑战，不可避免地一些网络钓鱼邮件仍然能够进入用户的收件箱。因此，Gmail等电子邮件提供商已经实施了网络钓鱼警告以帮助用户更好地识别网络钓鱼行为。现有研究主要关注视力正常的用户的网络钓鱼警告，但人们对于视力受损者如何与网络钓鱼邮件和警告进行交互还不够了解。在本文中，我们与一组视力受损的用户（N=41）合作，研究了现有警告的有效性，并探索了更具包容性的设计（以Gmail警告设计为基准进行比较）。我们采用了多管齐下的方法，包括探索性研究（了解用户面临的挑战），用户参与设计和原型制作，以及主要研究（评估设计选择的影响）。我们的结果表明，视力受损的用户经常会忽略现有的Gmail警告，因为当前的设计（例如警告位置、使用的HTML标签）与屏幕阅读器用户的阅读习惯不匹配。警告的不一致性（例如在标准视图和HTML视图中）也给用户带来了障碍。我们展示了一个包容性设计（结合音频警告、快捷键和警告页面叠加）可以有效地增加警告的可注意性。基于我们的结果，我们向电子邮件提供商提出了一些建议。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\User Perceptions and Experiences with Smart Home Updates.pdf": {
        "title": "User Perceptions and Experiences with",
        "abstract(paper)": "更新可能是消费者在智能家居设备中减少安全和隐私漏洞的几个工具之一。然而，目前很少有研究了解用户对智能家居更新的看法和经验。为了填补这一空白，我们对美国412名智能家居用户进行了在线调查，样本具有多样的人口统计特征。我们发现用户普遍认为智能家居更新很重要且紧急。然而，更新看法与安全和隐私看法之间的关系不太明确。我们还确定了更新中存在的问题，并发现当前与用户偏好的更新模式之间存在差距。然后，我们提出了设计更易用和易于理解的更新机制和界面的方法。\n\n关键词：智能家居，物联网，安全，隐私，人机交互"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 10C：Human factors 2\\When and Why Do People Want Ad Targeting Explanations. Evidence from a Four-Week, Mixed-Methods Field Study.pdf": {
        "title": "When and Why Do People Want Ad Targeting Explanations? Evidence from a",
        "abstract(paper)": "-许多人担心他们的个人数据在在线行为广告（OBA）中的使用方式。广告定位解释被提出作为提高透明度以减少这种担忧的一种方式。然而，什么时候以及为什么人们可能想要广告定位解释还不清楚。如果没有这种洞察力，我们有可能设计出不能解决真正担忧的解释。为了弥合这个差距，我们进行了为期四周的混合方法实地研究，与60名参与者一起了解他们在浏览网页时真正遇到的广告时何时以及为什么需要定位解释。我们发现，在研究中我们询问的4,251个广告中，用户希望解释约占30％，而主观感知个人数据如何被收集和共享与用户何时希望解释密切相关。通常，用户希望这些解释来确认或否认他们自己对数据收集方式或广告商动机的先入为主的看法。我们工作的一个重要结果是，一刀切的广告解释方法很可能无法解决人们对广告定位的实际担忧，相反，需要更个性化的解释。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\Control Flow and Pointer Integrity Enforcement in a Secure Tagged Architecture.pdf": {
        "title": "Control Flow and Pointer Integrity Enforcement in a Secure Tagged Architecture",
        "abstract(paper)": "控制流攻击利用软件漏洞将控制流转移到意外路径，最终执行攻击代码。本文探讨使用指令和数据标记作为一种通用手段来阻止此类控制流攻击，包括依赖于破坏指针完整性的攻击。使用特定类型的窄带宽数据标记以及嵌入在二进制文件中的窄带宽指令标记有助于实施所需的安全策略，以防止此类攻击，从而实现实际可行的解决方案。(标记的指令标签紧密地与其对应的指令放置在缓存行中，消除了对指令标签访问的分离机制的需求。从编译器的分析阶段获取的信息被增强并用于生成指令和数据标记。展示了一个完整的堆栈实现，包括修改过的LLVM编译器，标记的Linux操作系统支持以及用于强制执行CFI、数据指针和代码指针完整性的FPGA实现的CPU硬件原型。通过适度的硬件增强，原型系统上的基准应用程序的执行时间被限制为基准系统的低个位数百分比。关键词：控制流完整性、硬件安全、指针完整性、安全架构、安全和隐私策略。 (控制流攻击是一种利用软件漏洞的攻击方式，通过改变程序的控制流程，使其执行攻击者指定的恶意代码。本文提出了使用指令和数据标记的方法来防止这种类型的攻击，包括那些依赖于破坏指针完整性的攻击。通过在二进制代码中嵌入窄带宽的指令和数据标记，可以实施所需的安全策略，从而有效地防止这些攻击。此外，还提出了在缓存行中紧密放置指令标记的方法，以减少对指令标记访问的开销。通过分析编译器生成的信息，可以生成指令和数据标记。作者还展示了一个完整的实现，包括修改过的LLVM编译器、支持标记的Linux操作系统和基于FPGA的CPU硬件原型。通过适度的硬件增强，实验结果表明，在原型系统上运行基准应用程序的执行时间仅为没有标记的基准系统的几个百分点。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\EC：Embedded Systems Compartmentalization via Intra-Kernel Isolation.pdf": {
        "title": "EC: Embedded Systems",
        "abstract(paper)": "嵌入式系统由低功耗微控制器组成，构成从物联网节点到超级计算机的计算系统。(嵌入式系统由低功率微控制器组成，从物联网节点到超级计算机构成计算系统。)\n不幸的是，由于低功耗的限制，这些系统的安全性经常被忽视，留下了巨大的攻击面。(不幸的是，由于低功耗的限制，这些系统的安全性经常被忽视，留下了巨大的攻击面。)\n例如，攻击者入侵用户任务后可以访问任何内核数据结构。(例如，攻击者入侵用户任务后可以访问任何内核数据结构。)\n现有的工作已经应用了隔离技术来减少攻击面，但这些系统要么产生很高的运行时开销，要么需要对现有固件进行重大修改。(现有的工作已经应用了隔离技术来减少攻击面，但这些系统要么产生很高的运行时开销，要么需要对现有固件进行重大修改。)\n在本文中，我们提出了嵌入式隔离器（EC），这是一个全面且自动化的隔离工具链，适用于实时操作系统（RTOSs）和裸机固件。(在本文中，我们提出了嵌入式隔离器（EC），这是一个全面且自动化的隔离工具链，适用于实时操作系统（RTOSs）和裸机固件。)\nEC提供了嵌入式隔离器编译器（ECC），可以自动将固件分区到不同的隔离区，并使用嵌入式隔离器内核（ECK）来强制执行它们之间的内存保护。(EC提供了嵌入式隔离器编译器（ECC），可以自动将固件分区到不同的隔离区，并使用嵌入式隔离器内核（ECK）来强制执行它们之间的内存保护。)\nECK是一个经过形式验证的微内核，实现了一种用于隔离固件的新型架构，通过内核内隔离实现。(ECK是一个经过形式验证的微内核，实现了一种用于隔离固件的新型架构，通过内核内隔离实现。)\n我们的评估显示，EC是一种高效的工具，可以在不引入显著运行时开销或对现有固件进行重大修改的情况下，为嵌入式系统提供有效的隔离保护。(我们的评估显示，EC是一种高效的工具，可以在不引入显著运行时开销或对现有固件进行重大修改的情况下，为嵌入式系统提供有效的隔离保护。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\Low-Cost Privilege Separation with Compile Time Compartmentalization for Embedded Systems.pdf": {
        "title": "Low-Cost Privilege Separation with Compile Time",
        "abstract(paper)": "嵌入式系统是普遍存在的，广泛应用于我们周围的各个领域。这些系统运行在低功耗的微控制器上，具有实时约束。为了满足这些约束，开发人员通常会牺牲安全性，通过以相同权限运行整个软件栈来满足需求。现有工作利用隔离技术来缓解这种情况，但由于在系统中实现不同隔离区之间的隔离需要进行大量的运行时检查，导致开销很高，因此很少被采纳。在本文中，我们提出了一种称为Compartmentalized Real-Time C (CRT-C)的低成本编译时隔离机制，用于嵌入式系统中的特权分离，使用专用的编程语言方言在线性地址空间中实现。每种编程方言限制了程序的一部分的编程能力，形成了程序中的不同隔离区。CRT-C使用静态分析来识别固件中的各种隔离区，并通过实施隔离区特定策略来实现系统中的最低权限。我们设计和实现了一个新的编译器，将CRT-C编译成可以在常见嵌入式系统上运行的隔离固件。我们使用两个实时操作系统（RTOSs）FreeRTOS和Zephyr对CRT-C进行评估。评估结果显示，CRT-C可以为嵌入式系统提供隔离，以防止各种攻击，同时平均运行时开销为2.63%，内存开销为..."
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\SecureCells：A Secure Compartmentalized Architecture.pdf": {
        "title": "SecureCells: A Secure Compartmentalized Architecture",
        "abstract(paper)": "现代程序是整体的，将来自不同来源的代码结合在一起，没有隔离，同时在联网设备上运行。任何组件中的漏洞可能会危及所有其他组件的代码和数据。分区将程序分为具有有限策略定义权限的故障域，遵循最小权限原则，防止组件之间的任意交互。不幸的是，现有的分区机制针对弱攻击模型，产生高开销，或者过度拟合特定用例，因此无法被广泛采用。当务之急是提供一个安全、高性能和灵活的机制，使开发人员能够可靠地实现一套分区化的软件。\n\n我们提出了SecureCells，一种新颖的内地址空间分区架构。SecureCells通过强制实施每虚拟内存区域（VMA）权限来进行安全和可扩展的访问控制，并引入了新的用户空间指令，通过硬件强制调用门和零拷贝权限传输来进行安全和快速的分区切换。SecureCells为调用栈维护和寄存器上下文隔离提供了新颖的软件机制。在微基准测试中，SecureCells在一个5级顺序处理器上仅需8个周期来切换分区，与最先进的技术相比，成本降低了一个数量级。因此，SecureCells可以帮助保护高性能软件，如内存键值存储，开销可以忽略不计，低于3%。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11A：Software isolation\\WaVe：a verifiably secure WebAssembly sandboxing runtime.pdf": {
        "title": "WaVe: a veriﬁably secure WebAssembly sandboxing runtime",
        "abstract(paper)": "I. 翻译：\n软件沙箱的承诺是灵活、快速和可移植的隔离；它捕捉了基于硬件的内存保护的好处，而不需要操作系统的参与。(软件沙箱的好处是能够在不需要操作系统参与的情况下，实现灵活、快速和可移植的隔离。这个承诺在WebAssembly(Wasm)中得到了实现，Wasm是一种流行的可移植字节码，其编译器会自动插入运行时检查来确保数据和控制流限制在一个内存段中。事实上，现代编译的Wasm实现已经发展到了这样一个地步，这些检查本身可以被验证，从而将编译器从可信计算基中移除。然而，由此产生的完整性属性只对严格在Wasm沙箱内执行的代码有效。与管理沙箱并暴露用于访问操作系统资源的WebAssembly系统接口(WASI)的运行时系统的任何交互都是在这个契约之外进行的。由此产生的困境是如何在保持Wasm的强隔离特性的同时，允许这些程序与外部世界(即文件系统、网络等)进行交互。我们的论文通过WaVe提出了解决这个问题的解决方案，它是一个经验证的安全运行时系统，实现了WAS。\n\nII. 解释：\n本文介绍了软件沙箱的概念和优势，它能够在不需要操作系统参与的情况下实现灵活、快速和可移植的隔离。这种优势在WebAssembly(Wasm)中得到了实现，Wasm是一种流行的可移植字节码。Wasm的编译器会自动插入运行时检查来确保数据和控制流限制在一个内存段中，这使得编译的Wasm实现能够验证这些检查，从而将编译器从可信计算基中移除。然而，这些完整性属性只对严格在Wasm沙箱内执行的代码有效，而与管理沙箱并暴露WebAssembly系统接口(WASI)的运行时系统的任何交互都是在这个契约之外进行的。因此，如何在保持Wasm的强隔离特性的同时允许程序与外部世界进行交互成为一个困境。论文提出了一个解决方案，通过一个经验证的安全运行时系统WaVe来实现WAS，从而解决这个问题。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\Blue's Clues：Practical Discovery of Non-Discoverable Bluetooth Devices.pdf": {
        "title": "Blue’s Clues:",
        "abstract(paper)": "蓝牙是个人区域网络的首选协议，蓝牙经典标准已连续使用了20多年。蓝牙设备通过使自己可发现来进行通信，但为了保护隐私的最佳实践是确保设备保持非可发现模式。本文证明了通过使设备处于非可发现状态来保护设备的无效性。我们介绍了“蓝色线索”攻击，这是第一种直接、非破坏性的方法，可以从处于非可发现模式的目标设备中完全提取出永久的、唯一的蓝牙MAC标识符。我们还证明了我们可以完全描述设备的能力并检索标识符，其中一些标识符通常包含有关设备所有者的身份信息。我们使用软件定义无线电并通过空中攻击我们自己的设备以及经过机构批准在公共建筑中进行蓝色线索攻击的演示。我们发现各种各样的蓝牙设备可以在平均不到10秒的时间内得到唯一识别，受影响的设备包括智能手机、耳机、加油站盗刷器和保姆摄像头，涵盖了所有蓝牙经典标准的版本。虽然我们提供了对抗攻击的潜在缓解措施，但蓝色线索迫使重新评估二十多年来保护设备免受发现的最佳实践。 (蓝牙作为个人区域网络的首选协议已经使用了20多年，本文介绍了一种攻击方法可以从处于非可发现模式的设备中提取蓝牙MAC标识符，并展示了该攻击可以适用于各种蓝牙设备，包括智能手机、耳机、加油站盗刷器和保姆摄像头。该攻击方法让人们重新评估保护设备免受发现的最佳实践。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\DeHiREC：Detecting Hidden Voice Recorders via ADC Electromagnetic Radiation.pdf": {
        "title": "DeHiREC: Detecting Hidden V oice Recorders",
        "abstract(paper)": "——未经授权的秘密录音给对隐私敏感的场景带来了显著的威胁，例如机密会议和私人谈话。由于迷你化和伪装特性，隐藏的录音设备很难被周围人察觉。在本文中，我们提出了DeHiREC，这是第一个能够从电磁辐射（EMR）中检测到离线隐藏录音设备的概念验证系统。我们首先对发射的EMR信号的独特模式进行表征，然后定位EMR源，即嵌入在混合信号片上系统（MSoCs）中的模拟-数字转换器（ADC）模块。由于这些非故意的EMR信号可能非常嘈杂和微弱，准确地检测它们可能具有挑战性。为了应对这一挑战，我们首先设计了一种EMR催化方法来主动激发EMR信号，然后采用自适应折叠算法来提高感知到的EMR的信噪比（SNR）。一旦感知到的EMR变化与我们的主动刺激相对应，我们就可以确定存在隐藏的录音设备。我们在13种商用录音设备上评估了DeHiREC的性能，包括来自其他设备的干扰。实验结果表明，DeHiREC在检测所有13种录音设备方面表现出良好的效果，在0.2米的距离下，整体成功率为92.17%，召回率为86.14%。\n索引词——隐藏录音设备，电磁辐射（EMR），模拟-数字转换器（ADC）。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\LazyTAP：On-Demand Data Minimization for Trigger-Action Applications.pdf": {
        "title": "LazyTAP: On-Demand Data Minimization for",
        "abstract(paper)": "触发-动作平台（TAPs）赋予应用程序（应用）连接其他无法连接的设备和服务的能力。（当前的）TAPs，如IFTTT，需要触发服务将大量敏感数据推送到TAP，无论这些数据在应用中是否被使用，与数据最小化的原则相悖。（此外）现代TAPs的丰富功能，包括支持多个触发服务的IFTTT查询和应用程序的非确定性，已经超出了以往的数据最小化方法（如minTAP）的范围。本文提出了LazyTAP，一种新的细粒度按需数据最小化范例。LazyTAP摆脱了粗粒度数据过度逼近的传统“全部推送”的方法。相反，LazyTAP在应用程序执行访问数据时按需拉取输入数据。由于细粒度的特性，LazyTAP能够自然地支持通过查询来支持多个触发服务，并且对于应用程序的非确定性行为具有鲁棒性。我们通过利用惰性来推迟计算和代理对象来在后台加载必要的远程数据，从而实现了对第三方应用程序开发者的无缝支持。我们正式确立了LazyTAP的正确性以及对IFTTT和minTAP的最小化特性。我们在应用基准测试中实现和评估了LazyTAP，结果显示，平均而言，LazyTAP比IFTTT的最小化提高了95%，比minTAP提高了38%，同时性能开销可以容忍。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\One Key to Rule Them All：Secure Group Pairing for Heterogeneous IoT Devices.pdf": {
        "title": "One Key to Rule Them All: Secure Group Pairing for Heterogeneous IoT Devices",
        "abstract(paper)": "配对方案建立了用于安全通信的IoT设备之间的加密密钥。(依赖于可信的中央实体、人类交互或共享的同质化环境的现有配对方法容易出现单点故障，可用性有限，并且需要额外的传感器。最近的研究探索了由具有异构感知模式的设备观察到的事件时间作为去中心化配对的存在证明。然而，这种方法需要较长的配对时间，无法配对感知连续物理量的传感器，并且不支持组配对，因此对于许多IoT部署来说是不可行的。在本文中，我们设计和开发了一种名为IOTCUPID的安全组配对系统，用于具有异构感知模式的IoT设备，无需用户主动参与。IOTCUPID分为三个阶段操作：(a)使用一种新颖的基于窗口的导出技术检测由即时和连续传感器感知到的事件，(b)通过模糊聚类算法对事件进行分组，提取事件之间的时间关系，(c)通过分区组密码认证密钥交换方案在具有相同事件间时间的设备之间建立组密钥。我们在智能家居和办公环境中使用11个异构设备评估了IOTCUPID，并展示了它能够有效地使用仅2个组密钥对所有设备进行配对，并且配对开销很小。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\Optimistic Access Control for the Smart Home.pdf": {
        "title": "Optimistic Access Control for the Smart Home",
        "abstract(paper)": "智能家居用户最担心的隐私问题之一是如何限制家庭成员对设备和彼此数据的访问。虽然人们通常表达对复杂的访问控制策略的偏好，但在实践中他们常常接受不太安全的默认设置。作为一种替代方案，本文研究了“乐观访问控制”策略，允许用户在其他家庭成员的监督下，未经预先批准即可获得访问和数据。这种解决方案允许用户利用他们已经依赖的人际信任来建立与更复杂的访问控制方法相当的隐私界限，同时保留较不安全策略的便利性。为了评估这个概念，我们进行了一系列共计604人的调查，研究了这种方法的可接受性和认知。我们发现，一些受访者更喜欢乐观模式而不是现有的访问控制方法，并且对乐观访问的兴趣因设备类型和家庭特征而异。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11B：IoT security\\Protected or Porous：A Comparative Analysis of Threat Detection Capability of IoT Safeguards.pdf": {
        "title": "Protected or Porous:",
        "abstract(paper)": "消费者物联网（IoT）设备在家庭中越来越常见，从智能音箱到安全摄像头。随着它们的好处，也带来了潜在的隐私和安全威胁。为了限制这些威胁，一些商业服务已经变得可用（IoT安全保护措施）。这些保护措施声称能够提供保护，防范物联网的隐私风险和安全威胁。然而，这些保护措施的有效性和相关的隐私风险仍然是一个重要的未解决问题。在本文中，我们首次调查了物联网安全保护措施的威胁检测能力。我们开发并发布了一种用于自动化保护实验的方法，以揭示它们对常见安全威胁和隐私风险的响应。我们在一个大型物联网测试平台上使用流行的商业物联网安全保护措施进行了数千次自动化实验。我们的结果表明，这些设备不仅可能无法防止风险，而且它们的云交互和数据收集操作可能会给采用它们的家庭带来隐私风险。(个人备注: 物联网安全保护措施可能无法有效防范风险，并且可能会对家庭引入隐私风险。)"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\BLEDiff：Scalable and Property-Agnostic Noncompliance Checking for BLE Implementations.pdf": {
        "title": "BLEDi",
        "abstract(paper)": "在这项工作中，我们开发了一个自动化、可扩展、不受属性限制和黑盒的协议非合规检查框架，称为BLEDi，它可以分析和揭示蓝牙低功耗（BLE）协议实现中的非合规行为。（为了克服从庞大而复杂的BLE规范中提取BLE协议参考行为抽象和安全属性所需的巨大手动工作量，BLEDi利用了多个BLE设备的访问权限，并利用差分测试的概念自动识别异常的非合规行为。在这方面，BLEDi首先使用主动自动机学习方法自动提取BLE实现的协议状态机。为了改进大规模复杂BLE协议的主动自动机学习的可扩展性，BLEDi探索了使用分而治之的方法的思路。BLEDi基本上将BLE协议划分为多个子协议，识别它们的依赖关系并分别提取每个子协议的有限状态机，最后将它们组合起来创建大型协议有限状态机。然后对这些有限状态机进行成对测试，以自动识别各种偏离行为。我们使用25个不同的商用设备评估了BLEDi，并证明它可以揭示13种不同的偏离行为，其中包括10个可利用的攻击。）"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\From 5G Sniffing to Harvesting Leakages of Privacy-Preserving Messengers.pdf": {
        "title": "From 5G Sniffing to Harvesting Leakages of",
        "abstract(paper)": "我们提出了第一个能够高效嗅探5G控制信道的开源工具5GSniffer，并展示了它对用户隐私进行攻击的潜力。5GSniffer基于我们对5G RAN控制信道的分析，揭示了侧信道泄露。我们注意到，与LTE相比，解码5G控制信道要困难得多，因为解码所需的部分信息是通过加密信道提供给用户终端设备的。我们设计了一组技术，实现了实时控制信道嗅探（比暴力破解快了三个数量级）。这使得我们能够在一个小区中获取所有用户的无线网络临时标识符（RNTIs）并进行流量分析。为了说明我们的嗅探器的潜力，我们分析了两个注重隐私的通信应用Signal和Telegram。我们发现了可以利用的隐私泄露漏洞，用来向目标用户生成隐秘的流量。当与5GSniffer结合使用时，它能够通过将手机号码与RNTI相关联，隐秘地暴露目标用户在特定位置的存在。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\IPvSeeYou：Exploiting Leaked Identifiers in IPv6 for Street-Level Geolocation.pdf": {
        "title": "IPvSeeYou: Exploiting Leaked Identiﬁers in IPv6 for",
        "abstract(paper)": "我们提出了IPvSeeYou，这是一种隐私攻击，允许远程和非特权的对手以街道级别的精度对许多住宅IPv6主机和网络进行物理地理定位。我们方法的关键在于：1）远程发现家庭路由器的广域网（WAN）硬件MAC地址；2）将这些MAC地址与其已知位置的WiFi BSSID对应起来；3）通过关联连接到共同次级提供者路由器的设备来扩展覆盖范围。\n\n我们首先通过高速网络探测获取嵌入在IPv6地址中的大量MAC地址。这些MAC地址在协议栈中被有效地泄露，并且主要表示住宅路由器的WAN接口，其中许多是一体化设备，还提供WiFi。我们开发了一种技术，可以统计地推断出不同制造商和设备之间路由器的WAN和WiFi MAC地址的映射，并进行大规模的数据融合攻击，将WAN MAC地址与在Wardriving（地理定位）数据库中可用的WiFi BSSID进行相关性对应。利用这些相关性，我们可以在146个国家和地区中对超过1200万个路由器的IPv6前缀进行地理定位。选择性验证确认了39米的中位数地理定位误差。然后，我们利用技术和部署限制，通过聚类和关联与共同次级提供者路由器连接的设备，将攻击扩展到更大范围的IPv6住宅路由器集合。尽管我们向几个制造商和提供商负责任地披露了我们的结果，但已部署的住宅电缆和DSL路由器的僵化生态系统表明我们的攻击将在可预见的未来仍然是一个隐私威胁。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\Man-in-the-Middle Attacks without Rogue AP：When WPAs Meet ICMP Redirects.pdf": {
        "title": "Man-in-the-Middle Attacks without Rogue AP:",
        "abstract(paper)": "现代Wi-Fi网络通常受到安全机制的保护，例如WPA、WPA2或WPA3，因此对于攻击者（恶意主动方）来说，很难通过中间人（MITM）的方式劫持其他主动方的流量。在传统的恶意双胞胎攻击中，攻击者可能会部署一个虚假的无线访问点（AP）来劫持受害者主动方的流量（例如窃取凭据）。在本文中，我们揭示了一种新的MITM攻击，可以通过伪造合法的AP向受害者主动方发送伪造的ICMP重定向消息，从而使攻击者能够悄悄地劫持受害者主动方的流量，而无需部署任何虚假的AP。其核心思想是利用WPAs和ICMP协议之间的跨层交互漏洞，完全回避WPAs强制实施的链路层安全机制。我们解决了成功发动攻击的两个要求。首先，当攻击者伪造合法的AP来构造ICMP重定向消息时，合法的AP无法识别和过滤掉这些伪造的ICMP重定向消息。我们揭示了AP路由器中网络处理单元（NPUs）的一个新漏洞（CVE-2022-25667），该漏洞限制了AP路由器阻止伪造的ICMP错误消息通过路由器的能力。我们测试了来自10个知名AP供应商的55个热门无线路由器，由于这个漏洞，这些路由器中没有一个能够阻止伪造的ICMP重定向消息。其次，我们开发了一种新方法，以确保伪造的ICMP重定向消息可以逃避受害者主动方的合法性检查，并毒化其路由表。我们对122个真实的Wi-Fi网络进行了广泛的测量研究，涵盖了所有流行的Wi-Fi安全模式。实验结果表明，122个评估的Wi-Fi网络中有109个（89%）易受我们攻击。除了向NPU制造商和AP供应商报告该漏洞外，我们还开发了两种对抗措施来限制该攻击。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\Mew：Enabling Large-Scale and Dynamic Link-Flooding Defenses on Programmable Switches.pdf": {
        "title": "Mew: Enabling Large-Scale and Dynamic",
        "abstract(paper)": "链路洪水攻击（LFAs）可以切断对特定服务器目标的互联网连接，并且很难进行缓解，因为对手使用外观正常且低速的流量，并且可以动态调整攻击策略。传统的集中式防御系统无法在本地高效地抑制恶意流量。尽管新兴的可编程交换机为将防御系统靠近目标链接提供了机会，但它们的资源有限且缺乏对运行时重新配置的支持，限制了它们在链路洪水防御中的使用。\n\n我们提出了一种资源高效且运行时可适应的链路洪水防御系统Mew 1。Mew可以在大量流量集中在一个链接上或攻击策略快速变化时，对各种LFAs进行反制。我们设计了一种分布式存储机制和无丢包状态迁移机制，以减少可编程网络的存储瓶颈。我们开发了协同防御API，支持多粒度的共同检测和共同缓解，而不会带来过多的开销。Mew的动态防御机制可以不中断设备或中断其他运行功能的情况下，不断分析网络状况并激活相应的防御措施。我们使用真实世界的可编程交换机在五个城市开发了Mew的原型。我们的实验证明，这个真实世界的原型可以有效地防御大规模且动态的LFAs。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 11C：Network security\\PCSPOOF：Compromising the Safety of Time-Triggered Ethernet.pdf": {
        "title": "PCSPOO F: Compromising the Safety of",
        "abstract(paper)": "设计师越来越多地在嵌入式系统中使用混合关键性网络，以减小尺寸、重量、功耗和成本。其中最成功的技术可能是时间触发以太网（TTE），它允许关键时间触发（TT）流量和非关键尽力而为（BE）流量共享同一台交换机和电缆。TTE的一个关键方面是系统的TT部分与BE部分被隔离开来，因此BE设备无法干扰TTE设备的运行。这种隔离允许设计师：（1）使用不可信但低成本的BE硬件，（2）降低BE的安全要求，以及（3）在安全评审和认证程序中忽略BE设备。\n\n我们提出了PC SPOO F，这是第一个打破TTE隔离保证的攻击。PC SPOO F基于两个关键观察结果。首先，BE设备可以推断出有关网络的TT部分的私密信息，这些信息可以用来制造恶意的同步消息。其次，通过在以太网电缆上向TTE交换机注入电气噪声，BE设备可以欺骗交换机将这些恶意同步消息发送给其他TTE设备。我们的评估显示，成功的攻击可能在几秒钟内发生，并且每次成功的攻击可以导致TTE设备失去同步长达一秒，并丢失数十个TT消息，这两者都可能导致关键系统（如飞机或汽车）的故障。我们还展示了在模拟的航天任务中，PC SPOO F会导致无法控制的机动，威胁到安全和任务成功。我们向使用TTE的航空航天公司公开了PC SPOO F，并且几家公司正在实施本文中的缓解措施。\n\n关键词：时间触发以太网，封包中封包攻击，电磁干扰，嵌入式系统"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\DevFuzz：Automatic Device Model-Guided Device Driver Fuzzing.pdf": {
        "title": "DEVFUZZ: Automatic Device Model-Guided Device Driver Fuzzing",
        "abstract(paper)": "设备驱动程序的安全性对整个操作系统的可靠性至关重要。然而，验证设备驱动程序能否正确处理来自硬件设备的潜在恶意输入仍然非常具有挑战性。不幸的是，现有的基于符号执行的解决方案往往无法扩展，而模糊测试解决方案则需要真实的设备或手动设备模型，导致许多设备驱动程序未经充分测试而存在安全隐患。\n\n本文介绍了一种名为D EVFUZZ的新型模型引导设备驱动程序模糊测试框架，它不需要物理设备。D EVFUZZ利用符号执行自动生成探测模型，以指导模糊测试器正确初始化待测试的设备驱动程序。D EVFUZZ还利用静态和动态程序分析构建MMIO、PIO和DMA设备模型，进一步提高了模糊测试的效果。D EVFUZZ成功测试了来自不同操作系统（Linux、FreeBSD和Windows）的各种总线类型（PCI、USB、RapidIO、I2C）的191个设备驱动程序，并发现了72个漏洞，其中41个已经修补并合并到主流版本中。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\Pyfet：Forensically Equivalent Transformation for Python Binary Decompilation.pdf": {
        "title": "PYFET : Forensically Equivalent Transformation for Python Binary Decompilation",
        "abstract(paper)": "反编译是法庭分析中至关重要的能力，它有助于分析未知二进制文件。最近Python恶意软件的兴起引起了对Python反编译器的关注，旨在从Python二进制文件获取源代码表示。然而，Python反编译器无法处理各种二进制文件，限制了它们在法庭分析中的能力。本文提出了一种新颖的解决方案，将导致反编译错误的Python二进制文件转化为可反编译的二进制文件。我们的核心思想是通过将输入二进制文件中导致错误的代码块转化为另一种形式来解决反编译错误。我们的方法的核心是法庭等价转换（FET）的概念，它允许在法庭分析的背景下进行非语义保留的转换。我们仔细定义了FET以最小化其不良后果，同时修复保留精确语义时难以解决的各种导致错误的指令。我们使用17,117个真实世界的Python恶意软件样本评估了我们方法的原型，在五个流行的反编译器中引起77,022个错误，并成功识别和修复了这些错误。我们的方法还处理了包括操作码重映射在内的反分析技术，并帮助将Python 3.9二进制文件迁移到3.8二进制文件。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\QueryX：Symbolic Query on Decompiled Code for Finding Bugs in COTS Binaries.pdf": {
        "title": "QUERY X: Symbolic Query on Decompiled Code for Finding Bugs in COTS Binaries",
        "abstract(paper)": "可扩展的静态检查工具，如Sys和CodeQL，在源代码中成功发现了错误。这些工具允许分析人员编写特定于应用程序的规则，称为查询。这些查询可以利用分析人员的领域知识，从而使分析更准确和可扩展。然而，大多数这些工具不适用于仅二进制分析。一个例外是joern，它将二进制代码转换为反编译代码，并将反编译代码输入到普通的C代码分析器中。然而，这种方法对于符号分析来说不够精确，因为它忽视了反编译代码的独特特征。虽然二进制分析平台（如angr）支持符号分析，但分析人员必须了解它们的中间表示（IRs），尽管他们大多数时间都在使用反编译代码。在本文中，我们提出了一种精确和可扩展的符号分析方法，称为无畏符号分析，它使用直观的二进制代码查询，并在QUERY X中实现。为了使查询直观，QUERY X允许分析人员在反编译代码之上编写查询，而不是IRs。特别是，QUERY X支持对反编译代码的回调，使用这些回调可以控制符号分析以发现代码中的错误。为了进行精确的分析，我们将反编译代码转换为我们的IR（称为DNR），并在考虑反编译代码的特征的同时对DNR进行符号分析。值得注意的是，DNR仅在内部使用，这使得分析人员可以编写查询，而不管是否使用DNR。为了可扩展性，QUERY X使用回调自动减少控制流图，并对查询中指定的回调之间的依赖关系进行排序。我们将QUERY X应用于Windows内核、Windows系统服务和汽车二进制代码。结果发现了15个独特的错误，其中包括10个CVE，并从微软的漏洞赏金计划中获得了18万美元。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\SyzDescribe：Principled, Automated, Static Generation of Syscall Descriptions for Kernel Drivers.pdf": {
        "title": "SyzDescribe: Principled, Automated, Static Generation of Syscall Descriptions for",
        "abstract(paper)": "在近年来，模糊测试操作系统内核在总体上取得了很好的效果。例如，自2017年以来，syzkaller在Linux内核中发现了数千个错误。syzkaller的一个必要组成部分是一组系统调用描述，通常由人工专家提供。然而，据我们所知，当前的系统调用描述主要是手动编写的，这既耗时又容易出错。考虑到有许多内核驱动程序（用于新硬件设备及其他方面）在不断开发和演化，这尤其具有挑战性。在本文中，我们提出了一种基于原则的解决方案，用于生成Linux内核驱动程序的系统调用描述。在其核心部分，我们总结和建模了从核心内核与驱动程序之间的“契约”中提取的关键不变量或编程约定。这使我们能够以编程方式了解内核驱动程序的初始化过程以及其相关接口的构建方式。基于这一见解，我们开发了一个名为SyzDescribe的工具，已经在数百个内核驱动程序上进行了测试。我们展示了SyzDescribe生成的系统调用描述与手动编写的描述相竞争，并且比之前的工作（如DIFUZE和KSG）要好得多。最后，我们分析了我们的描述与实际情况之间的差距，并指出了未来的改进机会。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12A：Bug finding\\ViDeZZo：Dependency-aware Virtual Device Fuzzing.pdf": {
        "title": "VIDEZZO: Dependency-aware Virtual Device Fuzzing",
        "abstract(paper)": "一台虚拟机通过虚拟设备与其主机环境进行交互，通过虚拟设备消息（例如I/O操作）来驱动。通过发出精心设计的消息，攻击者可以利用虚拟设备中的漏洞逃逸出虚拟机，获取主机访问权限。虽然已经发现了许多虚拟设备中的漏洞，但基于覆盖率的虚拟设备模糊测试工具很少考虑消息内部的依赖关系（一个虚拟设备消息中的某个字段可能依赖于另一个字段）和消息之间的依赖关系（一个消息可能依赖于之前发出的消息），因此导致可扩展性和效率受限。\n\n我们的新型虚拟设备模糊测试框架VIDEZZO通过使用轻量级语法对消息内部的依赖关系进行注释，并通过新的变异规则自学习消息之间的依赖关系，克服了现有虚拟设备模糊测试工具的限制。具体来说，VIDEZZO注释消息依赖关系并应用三类消息变异器。这种方法避免了大量手动分析规范的工作，并通过满足依赖关系加快了缓慢的探索过程，从而实现了可扩展和高效的模糊测试工具，提高了对虚拟设备中漏洞的发现。\n\n在我们的评估中，VIDEZZO覆盖了两种虚拟化软件、四种架构、五个设备类别和28个虚拟设备，并且更快地达到了具有竞争力的覆盖率。此外，VIDEZZO成功地发现了24个已知漏洞和28个新漏洞，涵盖了各种类型的漏洞。我们正在积极与社区互动，我们已经提交的7个补丁已经被接受。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12B：Election and device recycling security\\Adaptive Risk-Limiting Comparison Audits.pdf": {
        "title": "Adaptive Risk-Limiting Comparison Audits",
        "abstract(paper)": "风险限制审计（RLA）是一种严格的统计程序，旨在检测无效的选举结果。RLA通过检查选举期间投出的纸质选票，统计评估选票确定的获胜者与计票报告的获胜者之间存在分歧的可能性。RLA的设计必须在风险和效率之间取得平衡：“风险”是指审计未能在发生分歧时检测到的机会的上限；“效率”是指进行审计的总工作量。\n\n最高效的方法——以检查的选票数量为衡量——是通过“选票比较”进行的。然而，选票比较需要对每张投票选票的内容进行（不可信任的）声明，而不是简单的选票计数。然后，将这个“投票记录表”（CVR）与选票进行一致性抽查。在许多实际情况下，生成适当的CVR的成本超过了进行审计的成本，这阻碍了这些样本效率高的技术的广泛采用。\n\n我们引入了一种新的RLA程序：自适应选票比较审计。在这种审计中，不会生成全局CVR；相反，采用三阶段的过程进行迭代：1）选择一个批次，2）为该批次生成CVR，3）从该批次中随机抽样一张选票，由审计员检查并与CVR进行比较。我们证明了这样的审计可以实现与标准比较审计相当的风险，并且只生成部分CVR。我们提出了三个主要贡献：（1）对RLAs进行形式化的对抗模型；（2）定义和分析具有严格风险限制的自适应审计程序，并进行相关的正确性分析，考虑到典型审计中出现的偶然错误；（3）对效率进行分析。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12B：Election and device recycling security\\Blue Is the New Black (Market)：Privacy Leaks and Re-Victimization from Police-Auctioned Cellphones.pdf": {
        "title": "Blue Is the New Black (Market): Privacy Leaks and",
        "abstract(paper)": "在美国，如果警方没能找到失主，他们通常会将其拍卖。这包括通过民事资产没收、被盗或被送到失物招领处的手机。成千上万家美国警察局与一个名为PropertyRoom的网站合作，拍卖他们的物品。在几个月的时间里，我们从PropertyRoom购买了228部手机，以确定它们是否包含个人信息。我们的结果显示，即使对于没有取证专业知识的“低投入”对手，大量敏感的个人信息也很容易被获取到。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12B：Election and device recycling security\\How IoT Re-using Threatens Your Sensitive Data：Exploring the User-Data Disposal in Used IoT Devices.pdf": {
        "title": "How IoT Re-using Threatens Your Sensitive Data:",
        "abstract(paper)": "随着物联网（IoT）的快速技术进化和用户需求的增加，现如今物联网设备的再利用变得越来越常见。例如，超过30万台二手物联网设备正在Craigslist上销售。在物联网设备的再利用过程中，存储在这些设备中的敏感数据，如凭据和生物特征，如果用户未能正确处理这些数据，可能会面临泄露的风险。因此，一个关键的安全问题被提出：用户是否（或能否）正确处理二手物联网设备中的敏感数据？据我们所知，这仍然是一个尚未探索的问题，需要进行系统研究。\n\n在本文中，我们对二手物联网设备的用户数据处理进行了首次深入调查。我们的调查结合了多种研究方法，以探索二手物联网设备用户数据泄露的现状和根本原因。首先，我们进行了一项用户研究，调查用户对数据处理的意识和理解。然后，我们对4,749个物联网固件图像进行了大规模分析，以调查用户数据收集情况。最后，我们对33个物联网设备进行了全面的实证评估，以调查现有数据处理方法的有效性。\n\n通过系统调查，我们发现物联网设备收集的敏感数据比用户预期的要多。具体而言，我们在测试的固件中检测到了121,984个敏感数据收集。此外，用户通常不会或甚至无法正确处理敏感数据。更糟糕的是，由于存储芯片的固有特性，13.2%的调查固件执行“浅层”删除，这可能使对手在数据处理后获取敏感数据。鉴于大规模的物联网再利用，这种泄漏将造成广泛的影响。我们已向世界领先的公司报告了我们的发现。我们希望我们的发现能提高人们对物联网设备用户数据处理失败的意识，并促进物联网设备中用户敏感数据的保护。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12B：Election and device recycling security\\No Privacy in the Electronics Repair Industry.pdf": {
        "title": "No Privacy in the Electronics Repair Industry",
        "abstract(paper)": "电子设备维修和服务提供商为北美地区的计算设备所有者提供一系列服务，包括软件安装和硬件维修。设备所有者将设备和访问凭证交给技术人员，这引发了对个人数据的隐私问题。我们进行了一项全面的四部分研究，以评估电子设备维修行业的隐私状况。首先，通过与18家服务提供商进行实地研究，我们发现大多数服务提供商没有任何隐私政策或控制措施，无法保护设备所有者的个人数据免受技术人员的窥探。其次，我们在16家服务提供商处交付经过特制的设备进行维修，并收集到了技术人员普遍违反隐私的数据，包括窥探个人数据、复制设备上的数据和清除窥探活动的痕迹。第三，我们进行了一项在线调查（n=112），收集了顾客在维修设备过程中的经验数据。第四，我们邀请调查中的一部分受访者（n=30）进行半结构化面谈，以深入了解他们的经验，并找出减少技术人员隐私违规行为的潜在解决方案。我们利用研究结果讨论了各利益相关者和监管机构应采取的可能控制措施和行动，以改善维修行业的隐私状况。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\Low-effort VR Headset User Authentication Using Head-reverberated Sounds with Replay Resistance.pdf": {
        "title": "Low-effort VR Headset User Authentication Using Head-reverberated Sounds with Replay Resistance",
        "abstract(paper)": "尽管虚拟现实（VR）应用程序变得越来越普遍，但在授予个人访问权限之前有效验证VR设备用户仍然是一个挑战。现有的VR身份验证方法要求用户使用控制器输入PIN码或绘制图形密码。尽管输入是在虚拟空间中进行的，但它可能被附近的其他人观察到，并且存在严重的安全问题。此外，空中手部运动或基于手持控制器的身份验证需要用户积极参与，并且不具有时间效率。本文提出了一种基于独特的头骨回响声的低工作量VR设备身份验证系统，这些声音可以在用户戴上VR设备时获得。具体而言，当用户戴上VR设备或佩戴VR设备登录在线账户时，所提出的系统会主动发出超声波信号来启动身份验证会话。返回到VR设备的麦克风的信号已经被用户的头部回响，这是独特的，因为头部的大小、头骨形状和质量不同。因此，我们从接收到的信号中提取头部生物特征信息，用于不引人注目的VR设备身份验证。\n\n虽然主动声学感测广泛应用于移动设备，但以往的研究从未成功将此类技术应用于普通的VR设备。由于VR设备旨在为用户提供虚拟现实沉浸感，用于主动感测的回声声音是不需要的，并且会被严重抑制。在此过程之前的原始音频也无法在不进行内核/硬件修改的情况下访问。因此，我们的工作进一步解决了在回声消除下进行主动声学感测的挑战，以便在现成的VR设备上部署我们的系统。此外，我们还展示了回声消除机制在防止声学重放攻击方面的天然优势。\n\n所提出的系统基于自动编码器和卷积神经网络进行生物特征数据提取和识别。使用独立的和手机VR头盔进行的实验证明，我们的系统能够高效验证用户，并且对重放攻击具有抵抗能力。\n\n关键词：虚拟现实，身份验证，生物特征。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\MagBackdoor：Beware of Your Loudspeaker as A Backdoor For Magnetic Injection Attacks.pdf": {
        "title": "MagBackdoor：Beware of Your Loudspeaker as A Backdoor For Magnetic Injection Attacks",
        "abstract(paper)": "一个包含扬声器和麦克风的音频系统是语音启用设备的基本硬件，可以实现与移动应用和智能家居的语音交互。本文介绍了MagBackdoor，这是第一个通过基于扬声器的后门注入恶意命令的磁场攻击，从而破坏了连接的语音交互系统。MagBackdoor专注于扬声器上的磁场威胁，并暗中操纵其声音产生。因此，由于内部音频系统的紧密排列，麦克风将不可避免地捕捉到受攻击扬声器产生的恶意声音。为了证明MagBackdoor的可行性，我们进行了全面的模拟和实验。本研究进一步模拟了外部磁场如何激发扬声器的声音产生机制，为MagBackdoor提供了理论指导。针对真实世界场景中的隐蔽磁场攻击，我们自主设计了一个可以通过语音命令调制磁场的原型。我们实现了MagBackdoor，并在涉及16部智能手机、四台笔记本电脑、两台平板电脑和三个智能音箱的各种智能设备上进行评估，实现了平均95%的注入成功率，并且注入的声音质量很高。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\Privacy Leakage via Unrestricted Motion-Position Sensors in the Age of Virtual Reality：A Study of Snooping Typed Input on Virtual Keyboards.pdf": {
        "title": "Privacy Leakage via Unrestricted Motion-Position Sensors in the Age of Virtual Reality：A Study of Snooping Typed Input on Virtual Keyboards",
        "abstract(paper)": "虚拟现实（VR）在游戏、社交互动、购物和教育等众多领域都越来越受欢迎。本文通过一项全面研究，评估了嵌入式传感器在VR上的可信性，这些传感器嵌入了各种形式的敏感数据，可能会危及用户的隐私。我们发现，访问大多数VR SDK/API上的内置传感器（如运动、位置和按钮传感器），如OpenVR、Oculus Platform和WebXR，不需要安全权限，为攻击者窃取用户隐私提供了巨大的攻击面。我们通过开发恶意软件程序和恶意网站来验证这个漏洞，并特别探讨了在按键窃听情况下，它会暴露用户的信息到什么程度。为了考察其在实践中的实际威胁，被考虑的攻击模型的对手不拥有用户的任何标记数据，也不了解用户的VR设置。涉及两个主流VR系统和四个具有不同打字机制的键盘的广泛实验表明，我们的概念验证攻击可以以超过89.7%的准确率识别用户的虚拟打字。如果允许三次尝试，攻击可以以高达84.9%的准确率恢复用户的密码，并且对于段落推断，平均单词识别率为87.1%。我们希望这项研究能帮助社区认识到当前VR系统传感器管理中的漏洞，并为未来设计更全面和受限的传感器访问控制机制提供见解。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\Private Eye：On the Limits of Textual Screen Peeking via Eyeglass Reflections in Video Conferencing.pdf": {
        "title": "Private Eye：On the Limits of Textual Screen Peeking via Eyeglass Reflections in Video Conferencing",
        "abstract(paper)": "在COVID-19疫情导致面对面会议和电话通话转为视频会议以进行日常沟通和敏感业务后，个人视频会议已成为一种新的常态。视频会议泄漏参与者屏幕上的信息，因为眼镜和其他反射物无意中暴露了部分屏幕内容。通过数学建模和人体实验，本研究探索了新型网络摄像头可能通过捕捉眼镜反射而泄露可识别的文本和图形信息的程度。我们的工作的主要目标是在网络摄像头技术未来发展中测量、计算和预测识别因素、限制和阈值。我们的工作探索并描述了基于光学攻击的可行威胁模型，使用多帧超分辨率技术对视频帧序列进行处理。我们在受控实验室环境中的模型和实验结果显示，使用720p网络摄像头可以以超过75%的准确率重建和识别高度为10毫米的屏幕文本。我们进一步将此威胁模型应用于具有不同攻击者能力的网络文本内容，以找到文本变得可识别的阈值。我们对20名参与者进行的用户研究表明，现今的720p网络摄像头足以让对手重建大字体网站上的文本内容。我们的模型进一步显示，向4K摄像头的演进将使文本泄漏的阈值达到对流行网站上大多数标题文本进行重建。除了文本目标外，我们对使用720p网络摄像头识别Alexa前100个网站的闭环数据集的案例研究显示，即使不使用机器学习模型，最高识别准确率可达94%。我们的研究提出了近期的缓解措施，包括用户可以使用的软件原型来模糊视频流中眼镜区域。对于可能的长期防御，我们提倡采用个体反射测试程序来评估各种设置下的威胁，并证明在涉及隐私敏感场景中遵循最小特权原则的重要性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 12C：Physical channels 2\\Uncovering User Interactions on Smartphones via Contactless Wireless Charging Side Channels.pdf": {
        "title": "Uncovering User Interactions on Smartphones via Contactless Wireless Charging Side Channels",
        "abstract(paper)": "如今，支持无线充电的智能手机越来越多，利用电磁感应将电力从无线充电器传输到充电手机。在本文中，我们报道了一种新的无接触和上下文感知的无线充电侧信道攻击，该攻击利用在无线充电过程中产生的两个物理现象（即线圈嗡鸣声和磁场扰动），进一步推断充电手机上的用户交互。我们设计并实现了一个名为WISERS的三阶段攻击框架，以展示这个新的侧信道的实用性。WISERS首先捕获无线充电器发出的线圈嗡鸣声和磁场扰动，然后推断（i）界面之间的切换（例如从主屏幕切换到应用界面）和（ii）界面内的活动（例如应用内的键盘输入）来构建用户交互上下文，并进一步揭示敏感信息。我们对流行的智能手机和现成的无线充电器进行了广泛的WISERS效果评估。评估结果表明，WISERS可以以超过90.4％的准确率推断出敏感信息，例如解锁密码和应用程序启动。此外，我们的研究还表明，WISERS对一系列影响因素具有抵抗力。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1B：Blockchain 1\\Bitcoin-Enhanced Proof-of-Stake Security：Possibilities and Impossibilities.pdf": {
        "title": "Bitcoin-Enhanced Proof-of-Stake Security：Possibilities and Impossibilities",
        "abstract(paper)": "比特币是世界上最安全的区块链，得到了其工作量证明矿工的巨大算力支持。权益证明链具有节能的特点，具有快速确定性，但面临着几个安全问题：易受到不可抵消的远程安全攻击、低活性弹性和难以从低代币价值中引导。我们表明，这些安全问题在没有外部可信源的任何权益证明链中都是固有的，并提出了一个新的协议，巴比伦协议，其中一个现成的权益证明协议通过比特币进行检查点以解决这些问题。一项不可能性结果证明了巴比伦的最优性。巴比伦的一个应用案例是缩短股份提取延迟：我们的实验结果表明，使用巴比伦，这个延迟可以从现有的权益证明链的几周缩短到不到5个小时，每年在比特币上发布检查点的交易成本不到10,000美元。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1B：Blockchain 1\\SoK：Distributed Randomness Beacons.pdf": {
        "title": "SoK：Distributed Randomness Beacons",
        "abstract(paper)": "在区块链的出现下，许多新的协议被提出，以分布式且安全的方式生成可公开验证的随机数。这些协议在不同的设置和假设下工作，使用各种加密工具，并具有独特的权衡和特性。在本文中，我们系统地设计了分布式随机数信标（DRBs）以及它们所依赖的密码构建模块。我们评估了这些协议在两个关键安全属性，即无偏性和不可预测性方面的表现，并讨论了预测或偏倚信标输出的常见攻击向量以及协议采用的对策。我们还通过通信和计算效率比较了这些协议。最后，我们提供了关于不同协议在各种部署场景中适用性的见解，并强调了进一步研究的可能方向。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1B：Blockchain 1\\Three Birds with One Stone：Efficient Partitioning Attacks on Interdependent Cryptocurrency Networks.pdf": {
        "title": "Three Birds with One Stone：Efficient Partitioning Attacks on Interdependent Cryptocurrency Networks",
        "abstract(paper)": "加密货币节点的偏见分布跨越自治系统（ASes）增加了空间分区攻击的风险，允许对手通过劫持AS前缀来隔离节点。关于空间分区攻击的先前工作主要集中在比特币网络上，显示出通过BGP劫持来破坏物理拓扑可以使这一重要加密货币网络瘫痪。尽管BGP劫持的威胁仍然存在，比特币和其他加密货币并未经常受到攻击，可能是由于它们的受保护的覆盖拓扑，限制了物理网络异常的曝光。在本文中，我们通过考虑共享网络资源（网络相互依赖性）来研究加密货币网络的安全性，提出了一个新的视角。我们进行了超越比特币网络的测量，并分析了比特币、以太坊和瑞波节点托管模式的共同点。我们观察到，这三个网络都高度集中，主要共享相同的自治系统。我们还注意到，在这三种加密货币中，瑞波没有保护其覆盖拓扑，这可以被利用来了解物理网络异常。观察到的网络异常提供了可以同时针对这三种加密货币的实际攻击策略。我们通过调查对高知名度自治系统的最近BGP攻击，补充了我们的分析，并认识到需要应用层级的对策。我们提出了减少空间分区风险的攻击对策，尽管节点和网络相互依赖性的集中程度不断增加。\n\n索引词 - 分区攻击，分布式系统，加密货币"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1B：Blockchain 1\\WeRLman：To Tackle Whale (Transactions), Go Deep (RL).pdf": {
        "title": "WeRLman：To Tackle Whale (Transactions), Go Deep (RL)",
        "abstract(paper)": "-工作量证明区块链协议的安全性关键依赖于激励机制。这些被称为矿工的运营商通过创建包含用户生成交易的区块来获得奖励。每个区块都会以新铸造的代币和用户支付的交易费用来奖励其创建者。如果任何一个矿工的计算能力超过了阈值比例，协议的稳定性就会被破坏；然后她就会被激励去采取自私的挖矿行为，以增加她的奖励。\n\n以前对自私挖矿策略的分析假设奖励是恒定的。但根据运营系统的统计数据，我们证明了偶尔会出现异常高奖励的区块。对这种行为进行建模意味着状态空间会随参数呈指数级增长，对于现有的分析工具来说变得难以处理。\n\n我们提出了WeRLman框架来分析这种模型。WeRLman使用深度强化学习（RL），受到AlphaGo Zero算法的启发。直接将AlphaGo Zero扩展到随机模型会导致高采样噪声，这对学习过程是不利的。因此，WeRLman利用系统的循环性质和过渡概率的先验知识，采用了新颖的方差缩减技术。通过与我们可以准确解决的模型对WeRLman进行评估，我们证明它在区块链的深度强化学习中取得了前所未有的准确性。\n\n我们使用WeRLman来分析不同设置下理性矿工的激励，并对类似比特币的区块链的安全阈值进行了上界估计。我们首次展示了费用变异性与安全阈值之间的负相关关系。以前已知的阈值，基于恒定的奖励，为0.25 [2]。我们证明，在考虑到异常高奖励交易的情况下，这个阈值会显著降低。特别是，根据比特币的历史费用和其未来的铸币政策，它在10年内的偏离阈值将降至0.2，在20年内将降至0.17，在30年内将降至0.12。根据以太坊智能合约平台的最新费用，阈值降至0.17。这些数值低于大型矿工的普遍规模[3]。\n\n关键词-区块链、自私挖矿、比特币、以太坊、交易费用、异常高奖励交易、矿工可提取价值、深度强化学习、蒙特卡洛树搜索、深度Q网络"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1C：Cryptographic attacks\\DBREACH：Stealing from Databases Using Compression Side Channels.pdf": {
        "title": "DBREACH：Stealing from Databases Using Compression Side Channels",
        "abstract(paper)": "我们介绍了一种新的针对数据库存储引擎的压缩侧信道攻击，该攻击同时支持数据库页面的压缩和加密。在仅具有有限的、间接的对加密和压缩数据库表的访问权限时，我们的攻击可以高度准确地提取任意明文。我们展示了针对MariaDB和MySQL中的InnoDB存储引擎变体以及MongoDB中的WiredTiger存储引擎的准确且高效的攻击。\n\n我们的攻击克服了数据库环境中独特的障碍，这些障碍使得先前用于攻击TLS的技术无效。与Web环境不同，在Web环境中可以观察到压缩和加密消息的确切长度，而我们只利用从磁盘文件大小中获得的近似密文大小信息。我们放大这个噪声信号，并结合针对数据库环境量身定制的新攻击启发式方法，以提取秘密明文。\n\n我们的攻击可以以超过90%的准确度检测出一个随机字符串是否出现在表中，并可以以超过95%的成功率从加密表中提取10个字符的随机字符串。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1C：Cryptographic attacks\\MEGA：Malleable Encryption Goes Awry.pdf": {
        "title": "MEGA：Malleable Encryption Goes Awry",
        "abstract(paper)": "MEGA是一个领先的云存储平台，拥有超过2.5亿用户和1000 PB的存储数据。MEGA声称提供用户控制的端到端安全性。这是通过在MEGA客户端上进行所有数据加密和解密操作，并通过仅对这些客户端可用的密钥进行控制来实现的。这旨在保护MEGA用户免受MEGA本身或控制了MEGA基础设施的对手的攻击。\n\n我们对MEGA在恶意服务器环境下使用密码学的情况进行了详细分析。我们提出了针对MEGA的五种不同的攻击，这些攻击共同导致用户文件的机密性完全被破坏。此外，用户数据的完整性受到损害，以至于攻击者可以插入他们选择的恶意文件，并通过客户端的所有真实性检查。我们制作了所有攻击的概念验证版本。其中四种攻击是非常实用的。它们都已向MEGA负责披露，并正在进行修复。\n\n综合而言，我们的攻击突显了MEGA密码学架构的重大缺陷。我们提出了可立即部署的对策措施，以及长期的建议。我们还对在强威胁模型下大规模部署密码学的挑战进行了更广泛的讨论。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 1C：Cryptographic attacks\\Weak Fiat-Shamir Attacks on Modern Proof Systems.pdf": {
        "title": "Weak Fiat-Shamir Attacks on Modern Proof Systems",
        "abstract(paper)": "研究人员和实践者之间的一系列激动人心的活动，产生了使用新颖技术思想构建的现代证明系统，并在加密货币领域得到迅速应用。这些现代证明系统中，大部分使用了Fiat-Shamir（F-S）转换，这是一种通过公共硬币验证者来消除协议交互的重要方法。一些先前的研究表明，错误应用F-S（即使用所谓的“弱”F-S转换）可能会导致破解像Schnorr的离散对数证明这样的经典协议；然而，我们对于错误应用F-S对于当今部署的现代证明系统的风险知之甚少。\n\n在本文中，我们通过对现代证明系统实现中F-S的广泛理论和实践研究来填补这一知识空白。我们对开源实现进行了调查，发现了30个影响12个不同证明系统的弱F-S实现。对于其中的四个系统——Bulletproofs、Plonk、Spartan和Wesolowski的VDF，我们开发了新颖的知识完备性攻击，并提供了其有效性的严格证明。我们对使用易受攻击实现的应用进行了案例研究，并证明弱F-S漏洞可能导致在私有智能合约平台上创建无限货币。最后，我们讨论了学术界和实践者可能采取的缓解措施和经验教训。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Attitudes towards Client-Side Scanning for CSAM, Terrorism, Drug Trafficking, Drug Use and Tax Evasion in Germany.pdf": {
        "title": "Attitudes towards Client-Side Scanning for CSAM, Terrorism, Drug Trafficking, Drug Use and Tax Evasion in Germany",
        "abstract(paper)": "近年来，有越来越多的立法努力和提议的技术措施旨在削弱保护隐私的技术，以应对儿童虐待等严重犯罪。其中一项提议的措施是客户端扫描（CSS）。CSS在苹果公司宣布其将在2021年部署该技术以及欧盟于2022年提出立法的背景下引起了激烈的争论。争论双方都声称自己是为了人民的最大利益而努力。为了阐明问题，我们对德国公民进行了一项调查。我们调查了德国公民对不同类型犯罪的CSS和基于云的扫描的普遍接受程度，并分析了他们对德国政府、谷歌和苹果等公司的信任如何影响参与者的观点。我们发现，总体而言，大多数参与者愿意接受CSS措施来打击儿童虐待或恐怖主义等严重犯罪，但对其他非法活动的支持显著下降。然而，大多数支持CSS的参与者也担心潜在的滥用，只有20%的人表示他们不担心。这些结果表明，我们的许多参与者愿意让他们的设备进行扫描，并接受一些风险，以便帮助执法部门。在我们的分析中，我们认为不能把这看作是引入CSS的无限制授权，而应该是信息安全和隐私保护社区行动的呼吁。需要进一步研究如何在减轻对隐私和社会的风险的同时实现人们防止严重网络犯罪的愿望。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Deep perceptual hashing algorithms with hidden dual purpose：when client-side scanning does facial recognition.pdf": {
        "title": "Deep perceptual hashing algorithms with hidden dual purpose：when client-side scanning does facial recognition",
        "abstract(paper)": "端到端加密（E2EE）为个人提供了强大的技术保护，防止干扰。然而，全球各国政府和执法机构也对E2EE表示担忧，认为其也会导致无法检测到的非法内容的共享。客户端扫描（CSS）使用感知哈希（PH）在共享之前检测已知的非法内容，被视为既能预防非法内容传播又能保持加密的有希望的解决方案。尽管这些提议引发了强烈的隐私担忧，但解决方案的支持者认为风险有限，因为该技术的范围有限，仅能检测已知的非法内容。在本文中，我们展示了现代感知哈希算法实际上是非常灵活的技术，这种灵活性可以被对手利用来给客户端扫描系统添加一个次要的隐藏功能。更具体地说，我们展示了对手提供的PH算法可以“隐藏”一个面部识别的次要目的，同时保持其主要目的的图像副本检测。我们首先提出了一种通过共同优化图像副本检测和目标面部识别任务来训练双重用途的深度感知哈希模型的过程。其次，我们广泛评估了我们的双重用途模型，并展示其能够可靠地识别目标个体的能力为67%，而不影响其检测非法内容的性能。我们还展示了我们的模型既不是一般的人脸检测模型也不是人脸识别模型，从而隐藏了其次要目的。最后，我们展示了通过向数据库添加一张非法外观的图像可以启用次要目的。综上所述，我们的结果引发了担忧，认为基于深度感知哈希的CSS系统可能将数十亿用户设备变成定位目标个体的工具。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Is Cryptographic Deniability Sufficientƒ Non-Expert Perceptions of Deniability in Secure Messaging.pdf": {
        "title": "Is Cryptographic Deniability Sufficientƒ Non-Expert Perceptions of Deniability in Secure Messaging",
        "abstract(paper)": "密码学家长期以来一直担心安全的消息协议会威胁到可否认性。许多消息协议包括现代电子邮件，都包含数字签名，可以明确地将作者与其消息联系起来。如果这些签名被盗或泄露，就无法否认作者身份。正如希拉里·克林顿2016年美国总统竞选期间泄露事件所表明的那样，这个担忧是有根据的。可否认的协议旨在避免这种情况发生，让政治家和持不同政见者都能够安全地否认自己的作品。尽管Signal和WhatsApp上的数十亿设备上都部署了这样的协议，但这种协议在说服人们方面的效果尚未得到研究。虽然在有效的否认中缺乏密码学证据显然是必要的，但是否足够呢？\n我们进行了一项调查研究（n = 1,200）以了解人们对加密消息协议的可否认性证据的认知。令人惊讶的是，在一个充斥着“假新闻”和Photoshop的世界中，我们发现仅凭简单的消息否认，在法庭环境中没有支持证据的情况下，是不起作用的。相反，那些获得了屏幕截图伪造工具或被告知该工具存在的参与者更有可能相信否认。同样地，虽然程度较小，但我们发现专家密码学家断言没有证据也是有效的。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Lambretta：Learning to Rank for Twitter Soft Moderation.pdf": {
        "title": "Lambretta：Learning to Rank for Twitter Soft Moderation",
        "abstract(paper)": "为了遏制虚假信息的问题，像推特这样的社交媒体平台开始在讨论被揭穿的叙述内容上添加警告标签，目的是为观众提供更多背景信息。不幸的是，这些标签并没有得到统一应用，导致大量虚假内容未经审查。本文介绍了一种名为LAMBRETTA的系统，它使用学习排序（LTR）自动识别可能需要软性审查的推文候选项。我们在推特数据上运行LAMBRETTA来审查与2020年美国选举有关的虚假主张，并发现它标记的推文数量是推特的20倍以上，仅有3.93％的误报和18.81％的漏报，超过了基于关键词提取和语义搜索的其他最新方法。总的来说，LAMBRETTA协助人工审查员在社交媒体上识别和标记虚假信息。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\On the Evolution of (Hateful) Memes by Means of Multimodal Contrastive Learning.pdf": {
        "title": "On the Evolution of (Hateful) Memes by Means of Multimodal Contrastive Learning",
        "abstract(paper)": "在社交媒体平台和现实世界中，令人讨厌的恶搞图片的传播对社会产生了不利影响。检测令人讨厌的恶搞图片是具有挑战性的，其中一个原因是恶搞图片的进化性质；通过将恶意含义与其他文化观念或符号融合，新的恶搞图片可能会出现。在本文中，我们提出了一个框架，利用多模态对比学习模型，特别是OpenAI的CLIP，来识别恶意内容的目标，并系统地研究恶搞图片的演变。我们发现，CLIP生成的嵌入中存在语义规律，描述了同一模态（图像）或跨模态（图像和文本）之间的语义关系。利用这个特性，我们研究了如何通过组合多个图像的视觉元素或将文本信息与恶搞图片融合来创建恶搞图片。我们通过关注反犹太恶搞图片，特别是快乐商人恶搞图片，展示了我们的框架分析恶搞图片演变的能力。在从4chan提取的数据集上使用我们的框架，我们找到了3.3K个快乐商人恶搞图片的变体，其中一些与特定国家、个人或组织有关。我们预计我们的框架可以帮助人工审核员通过标记新的恶搞图片变体，以便审核员可以手动验证它们并减轻网络上恶意内容的问题。1\n免责声明。本文包含未经审查的令人讨厌的内容，例如反犹太主义的图像，这些图像具有极高的冒犯性，可能会扰乱读者的情绪。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2A：Trust and safety\\Public Verification for Private Hash Matching.pdf": {
        "title": "Public Verification for Private Hash Matching",
        "abstract(paper)": "端到端加密（E2EE）防止在线服务访问用户内容。这个重要的安全特性也是涉及内容分析的内容审核方法的障碍。E2EE与打击儿童色情虐待材料（CSAM）之间的紧张关系已成为加密政策中的全球焦点，因为检测有害内容的主要方法——基于服务器端明文图像的感知哈希匹配——不可用。最近的应用密码学进展实现了私有哈希匹配（PHM），其中一个服务可以在不向用户透露哈希集的情况下将用户内容与已知的CSAM图像集进行匹配，也不会将不匹配的内容透露给服务。这些设计，尤其是2021年提出的在苹果的iCloud照片服务中识别CSAM的方案，因为对安全、隐私和言论自由造成风险而受到广泛批评。在这项工作中，我们旨在通过为公众贡献新的密码学方法来推进PHM的学术研究和对话。我们从动机开始，描述了使用PHM检测CSAM的理由以及其部署中存在的严重社会和技术问题。验证可以部分解决PHM的缺点，我们将批评分为两个审计领域：对哈希集的信任和对实现的信任。我们解释了虽然这两个问题不能完全通过技术解决，但可能存在密码学信任改进的可能性。本文的核心贡献是能够实现PHM系统的三种公共验证类型的新型密码协议：（1）外部组织批准哈希集的认证，（2）证明特定合法内容不在哈希集中，以及（3）向用户报告误报匹配。我们描述的协议是实用、高效且与现有的PHM构建兼容的。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\Accuracy-Privacy Trade-off in Deep Ensemble：A Membership Inference Perspective.pdf": {
        "title": "Accuracy-Privacy Trade-off in Deep Ensemble：A Membership Inference Perspective",
        "abstract(paper)": "深度集成学习已被证明通过训练多个神经网络并对它们的输出进行平均，提高了准确性。集成学习也被提出用于防御损害隐私的成员推断攻击。在本文中，我们通过实证分析展示了准确性和隐私（以成员推断攻击为衡量标准）之间的权衡，即在深度集成中存在这两个目标之间的权衡。通过使用各种数据集和模型架构，我们展示了当集成提高准确性时，成员推断攻击的有效性会增加。我们分析了深度集成中各种因素的影响，并展示了这种权衡的根本原因。然后，我们评估了基于正则化和差分隐私的常见成员推断攻击防御方法。我们展示了虽然这些防御方法可以减轻成员推断攻击的有效性，但同时会降低集成的准确性。我们还展示了在更先进和最新的集成技术中，如快照集成和多样化集成网络中存在类似的权衡。最后，我们提出了一种简单而有效的深度集成防御方法，以打破这种权衡，从而同时提高准确性和隐私。\n\n关键词：成员推断、集成学习、深度集成"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\Analyzing Leakage of Personally Identifiable Information in Language Models.pdf": {
        "title": "Analyzing Leakage of Personally Identifiable Information in Language Models",
        "abstract(paper)": "语言模型（Language Models，LMs）已被证明会通过句子级成员推理和重构攻击泄露有关训练数据的信息。对于LMs泄露个人可识别信息（Personally Identifiable Information，PII）的风险的理解受到较少关注，这可以归因于错误的假设，即通过数据集处理技术（如清洗）就足以防止PII泄露。清洗技术可以减少但无法完全防止PII泄露的风险：在实践中，清洗是不完美的，并且必须在最小化泄露和保留数据集效用之间权衡。另一方面，还不清楚设计用于保证句子或用户级隐私的差分隐私等算法防御在多大程度上可以防止PII披露。在这项工作中，我们通过仅使用LM的API访问，引入了基于严格博弈的定义，用于描述通过黑盒提取、推理和重构攻击泄露三种类型的PII。我们在三个领域（案例法、医疗保健和电子邮件）中对使用和不使用防御的GPT-2模型进行了实证评估。我们的主要贡献是：（i）新颖的攻击可以提取多达10倍的PII序列，超过现有攻击；（ii）显示句子级差分隐私降低了PII披露的风险，但仍会泄露约3%的PII序列；（iii）记录级成员推理和PII重构之间的微妙联系。可以在https://github.com/microsoft/analysing-piileakage 上获取重现论文中所有实验的代码。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\D-DAE：Defense-Penetrating Model Extraction Attacks.pdf": {
        "title": "D-DAE：Defense-Penetrating Model Extraction Attacks",
        "abstract(paper)": "最近的研究表明，机器学习模型容易受到模型提取攻击的威胁，攻击者通过查询受害模型来构建一个替代模型，该替代模型几乎可以达到与黑盒受害模型相同的性能。为了防御此类攻击，已经提出了一系列方法，在返回查询结果给潜在攻击者之前干扰查询结果，大大降低了现有模型提取攻击的性能。\n\n在本文中，我们首次尝试开发一种名为D-DAE的防御渗透模型提取攻击框架，旨在破解基于干扰的防御。D-DAE的关键是设计了两个模块，即干扰检测和干扰恢复，可以与通用的模型提取攻击集成。具体而言，在从受害模型获取查询结果后，干扰检测模块推断出防御者采用的防御机制。我们设计了一种基于元学习的干扰检测算法，用于学习干扰和未干扰查询结果分布之间的基本差异。即使我们无法访问受害模型的原始训练数据集，该算法也具有良好的泛化性能。鉴于检测到的防御机制，干扰恢复模块试图使用设计良好的生成模型从干扰的查询结果中恢复出干净的查询结果。\n\n我们在MNIST、FashionMNIST、CIFAR-10、GTSRB和ImageNette数据集上进行了广泛的评估，结果表明，在面对4种最先进的防御和多种防御组合时，D-DAE可以将现有模型提取攻击的替代模型准确率提高高达82.24%。我们还验证了D-DAE在渗透微软Azure和Face++托管的真实世界API的未知防御中的有效性。\n\n关键词：模型提取攻击，基于干扰的防御，元学习。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\On the (In)security of Peer-to-Peer Decentralized Machine Learning.pdf": {
        "title": "On the (In)security of Peer-to-Peer Decentralized Machine Learning",
        "abstract(paper)": "在这项工作中，我们进行了第一次深入的隐私分析，研究了分散式学习——一种旨在解决联邦学习主要限制的协作机器学习框架。我们提出了一套新颖的攻击方法，针对被动和主动的分散式对手。我们证明，与分散式学习提出者所声称的相反，分散式学习并不比联邦学习提供任何安全优势。相反，它增加了攻击面，使系统中的任何用户都能进行隐私攻击，如梯度反演，甚至完全控制诚实用户的本地模型。我们还表明，就目前的保护状态而言，隐私保护配置的分散式学习需要完全连接的网络，失去了与联邦设置相比的任何实际优势，从而完全挫败了分散式方法的目标。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\SNAP：Efficient Extraction of Private Properties with Poisoning.pdf": {
        "title": "SNAP：Efficient Extraction of Private Properties with Poisoning",
        "abstract(paper)": "财产推断攻击允许敌对方从机器学习模型中提取训练数据集的全局属性。这种攻击对于共享数据集以训练机器学习模型的数据所有者来说具有隐私影响。已经提出了几种针对深度神经网络的财产推断攻击方法[1]–[3]，但它们都依赖于攻击者训练大量的影子模型，这会导致大量的计算开销。\n\n在本文中，我们考虑了财产推断攻击的设置，其中攻击者可以操纵训练数据集的一个子集，并查询训练后的目标模型。受到我们对操纵下的模型置信度的理论分析的启发，我们设计了一种高效的财产推断攻击方法SNAP，其攻击成功率更高，需要更少的操纵量，相比Mahloujifar等人提出的基于操纵的财产推断攻击方法[3]。例如，在Census数据集上，SNAP的成功率比[3]高34%，同时速度快56.5倍。我们还扩展了我们的攻击方法，以有效地推断在训练期间某个属性是否存在，并估计感兴趣属性的确切比例。我们在四个数据集上评估了我们的攻击方法，并展示了SNAP的普适性和有效性。"
    },
    "\\\\NAS\\Library\\Papers\\IEEE S&P\\2023(44th)SP\\Session 2B：Machine learning privacy\\SoK：Let the Privacy Games Begin. A Unified Treatment of Data Inference Privacy in Machine Learning.pdf": {
        "title": "SoK：Let the Privacy Games Begin. A Unified Treatment of Data Inference Privacy in Machine Learning",
        "abstract(paper)": "- 在生产环境中部署机器学习模型可能会让对手推断出关于训练数据的敏感信息。有大量的文献对不同类型的推断风险进行了分析，包括成员推断和重构攻击。受到在密码学中研究安全性属性的游戏（即概率实验）的成功启发，一些作者用类似的基于游戏的方式描述了机器学习中的隐私推断风险。然而，对手的能力和目标在不同的介绍中往往以微妙的不同方式陈述，这使得难以关联和组合结果。在本文中，我们提出了一个基于游戏的框架，以系统化地总结机器学习中的隐私推断风险的知识体系。我们使用这个框架来（1）为推断风险的定义提供一个统一的结构，（2）形式上建立已知的定义之间的关系，以及（3）发现此前难以发现的关系，否则很难发现。\n\n- 关键词：隐私、机器学习、差分隐私、成员推断、属性推断、属性推断"
    }
}